[
    {
        "name": "3M",
        "description": "The 3M Company (originally the Minnesota Mining and Manufacturing Company) is an American multinational conglomerate operating in the fields of industry, worker safety, and consumer goods.[5] Based in the Saint Paul suburb of Maplewood,[6] the company produces over 60,000 products,[7] including adhesives, abrasives, laminates, passive fire protection, personal protective equipment, window films, paint protection film, electrical, electronic connecting, insulating materials, car-care products,[8] electronic circuits, and optical films.[9] Among its best-known consumer brands are Scotch Tape, Scotchgard surface protectants, Post-it notes, and Nexcare adhesive bandages. 3M's stock ticker symbol is MMM and is listed on the New York Stock Exchange, Inc. (NYSE), and the SIX Swiss Exchange.",
        "subsidiaries": []
    },
    {
        "name": "A. O. Smith",
        "description": "A. O. Smith Corporation is an American manufacturer of both residential and commercial water heaters and boilers, and the largest manufacturer and marketer of water heaters in North America. It also supplies water treatment and purification products in the Asian market.[7] The company has 27 locations worldwide, including five manufacturing facilities in North America, as well as plants in Bengaluru in India, Nanjing in China and Veldhoven in The Netherlands.[8]",
        "subsidiaries": []
    },
    {
        "name": "Abbott Laboratories",
        "description": "Abbott Laboratories, commonly known as Abbott, is an American multinational medical devices and health care company with headquarters in Abbott Park, Illinois. The company produces pharmaceuticals for sale outside the United States (13% of 2024 revenues), diagnostic products (20% of 2024 revenues), nutritional products (22% of 2024 revenues), and medical devices (45% of 2024 revenues).[2]",
        "subsidiaries": []
    },
    {
        "name": "AbbVie",
        "description": "AbbVie Inc. is an American pharmaceutical company headquartered in North Chicago, Illinois. They have produced drugs to treat a wide range of medical issues.[2]",
        "subsidiaries": []
    },
    {
        "name": "Accenture",
        "description": "Accenture plc is a multinational technology consulting company headquartered in Dublin, Ireland.[3][4] Founded in 1989, Accenture provides information technology and management consulting services across 120 countries globally.[3]",
        "subsidiaries": [
            "Avanade",
            "Droga5",
            "Udacity",
            "TalentSprint",
            "Faculty"
        ]
    },
    {
        "name": "Adobe Inc.",
        "description": "Adobe Inc. (/əˈdoʊbi/ ⓘ ə-DOH-bee), formerly Adobe Systems Incorporated, is an American multinational computer software company based in San Jose, California. It offers a wide range of programs from web design tools, photo manipulation and vector creation, through to video/audio editing, mobile app development, print layout and animation software.",
        "subsidiaries": []
    },
    {
        "name": "Advanced Micro Devices",
        "description": "Advanced Micro Devices, Inc. (AMD) is an American multinational semiconductor company headquartered in Santa Clara, California, with significant operations in Austin, Texas. It develops central processing units (CPUs), graphics processing units (GPUs), field-programmable gate arrays (FPGAs), system-on-chips (SoCs), and high-performance computer components. AMD serves a wide range of business and consumer markets, including personal computers (PCs), gaming, data centers, and embedded systems.",
        "subsidiaries": []
    },
    {
        "name": "AES Corporation",
        "description": "The AES Corporation is an American utility and power generation company. It owns and operates power plants, which it uses to generate and sell electricity to end users and intermediaries like utilities and industrial facilities. AES, headquartered in Arlington, Virginia, is one of the world's leading power companies, generating and distributing electric power in 15 countries[2] and employing 10,500 people worldwide. AES Corporation is a global Fortune 500 power company.[3] AES Ranks in the Top Ten of Fast Company's 2022 Best Workplaces for Innovators.[4]",
        "subsidiaries": []
    },
    {
        "name": "Aflac",
        "description": "Aflac Incorporated /ˈæflæk/ (American Family Life Assurance Company) is an American insurance company and is the largest provider of supplemental insurance in the United States.[3] It was founded in 1955 and is based in Columbus, Georgia. In the U.S., it underwrites a wide range of insurance policies, but is perhaps more known for its payroll deduction insurance coverage, which pays cash benefits when a policyholder has a covered accident or illness. The company states it \"provides financial protection to more than 50 million people worldwide\".[4]",
        "subsidiaries": []
    },
    {
        "name": "Agilent Technologies",
        "description": "Agilent Technologies, Inc. is an American global company headquartered in Santa Clara, California, that provides instruments, software, services, and consumables for laboratories. Agilent was established in 1999 as a spin-off from Hewlett-Packard. The resulting IPO of Agilent stock was the largest in the history of Silicon Valley at the time.[2][3] From 1999 to 2014, the company produced optics (LED, laser), semiconductors, EDA software and test and measurement equipment for electronics; that division was spun off to form Keysight.[4] Since then, the company has continued to expand into pharmaceutical, diagnostics & clinical, and academia & government (research) markets.[5]",
        "subsidiaries": []
    },
    {
        "name": "Air Products",
        "description": "Air Products and Chemicals, Inc. is a U.S.-based international corporation whose principal business is selling gases and chemicals for industrial use. Air Products is headquartered in Trexlertown, Pennsylvania, in the Lehigh Valley region of eastern Pennsylvania.",
        "subsidiaries": []
    },
    {
        "name": "Airbnb",
        "description": "Airbnb, Inc. (/ˌɛərbiːɛnˈbiː/ AIR-bee-en-BEE, an abbreviation of its original name, \"Air Bed and Breakfast\"[5]) is an American company operating an online marketplace for short-and-long-term homestays, experiences and services in various countries and regions. It acts as a broker and charges a commission from each booking. Airbnb was founded in 2008 by Brian Chesky, Nathan Blecharczyk, and Joe Gebbia.[6][7]",
        "subsidiaries": [
            "Luxury Retreats International Inc.",
            "Tilt.com",
            "Accomable",
            "Aibiying",
            "Trooly, Inc.",
            "Deco Software Inc.",
            "Trip4real Experiences, S.L.",
            "Larson8, Inc.",
            "MarketLog, Randorphire Inc.",
            "HotelTonight"
        ]
    },
    {
        "name": "Akamai Technologies",
        "description": "Akamai Technologies, Inc. is an American company specialized in content delivery network[4] (CDN), cybersecurity, DDoS mitigation, and cloud services.[5][6] It is headquartered in Cambridge, Massachusetts.",
        "subsidiaries": []
    },
    {
        "name": "Albemarle Corporation",
        "description": "Albemarle Corporation is an American specialty chemicals manufacturing company based in Charlotte, North Carolina. It serves several different industries including Agriculture/Food, Automotive/EV, Aviation/Aerospace, Building/Construction, Conventional Energy, Electronics, Grid Storage, and Industrial Processes. The company reported over $5.4 Billion in revenue in 2024.[2][3]",
        "subsidiaries": []
    },
    {
        "name": "Alexandria Real Estate Equities",
        "description": "Alexandria Real Estate Equities, Inc. is a real estate investment trust based in Pasadena, California that invests in office buildings and laboratories leased to tenants in the life science and technology industries.[1] Properties are generally located near universities to attract tenants.[3] The company owns several major technology/biotechnology office campuses including the 740,972 square foot Alexandria Center for Life Science in Manhattan, and the 2,365,487 square foot Alexandria Center at Kendall Square and the 1,181,635 square foot Technology Square (Cambridge, Massachusetts) in the Boston area.[1]",
        "subsidiaries": []
    },
    {
        "name": "Align Technology",
        "description": "Align Technology, Inc. is an American manufacturer of 3D digital scanners and Invisalign clear aligners used in orthodontics and restorative workflow. It was founded in 1997 and is headquartered in Tempe, Arizona. The company manufactures the aligners in Juarez, Mexico, and its scanners in Israel and China. The company is best known for its Invisalign system, which is a clear aligner treatment used to straighten teeth.",
        "subsidiaries": []
    },
    {
        "name": "Allegion",
        "description": "Though it comprises thirty-one global brands, including CISA, Interflex, LCN, Schlage and Von Duprin, the company operates through two main sections: Allegion International and Allegion Americas.[2] The company employs around 12,000 people,[3] sells its products in more than 130 countries across the world and in 2022 generated revenues of US$3.27 billion.[4]",
        "subsidiaries": []
    },
    {
        "name": "Alliant Energy",
        "description": "Alliant Energy Corporation is a public utility holding company headquartered in Madison, Wisconsin, providing power in Iowa and Wisconsin.",
        "subsidiaries": [
            "Interstate Power & Light",
            "Wisconsin Power & Light"
        ]
    },
    {
        "name": "Allstate",
        "description": "The Allstate Corporation is an American insurance company, headquartered in Glenview, Illinois (with a Northbrook, Illinois address) since 2022.[4] Founded in 1931 as part of Sears, Roebuck and Co., it was spun off in 1993, but was still partially owned by Sears until it became an independent company completely in June 1995.[2]  The company also has personal line insurance operations in Canada.",
        "subsidiaries": [
            "Encompass Insurance Company",
            "Esurance",
            "SquareTrade",
            "Allstate Identity Protection (formerly InfoArmor, Inc.)",
            "Allstate India",
            "Allstate Northern Ireland",
            "National General Insurance"
        ]
    },
    {
        "name": "Alphabet Inc.(Class A)",
        "description": "Alphabet Inc. is an American multinational technology conglomerate holding company headquartered in Mountain View, California. It was created through a restructuring of Google on October 2, 2015,[2] and became the parent holding company of Google and several former Google subsidiaries.[3][4][5] Alphabet is listed on the large-cap section of the Nasdaq under the ticker symbols GOOGL and GOOG; both classes of stock are components of major stock market indices such as the S&P 500 and Nasdaq-100. Alphabet has been described as a Big Tech company.",
        "subsidiaries": [
            "Calico",
            "CapitalG",
            "Google",
            "Google Fiber",
            "GV",
            "Isomorphic Labs",
            "Verily",
            "Waymo",
            "Wing"
        ]
    },
    {
        "name": "Alphabet Inc.(Class C)",
        "description": "Alphabet Inc. is an American multinational technology conglomerate holding company headquartered in Mountain View, California. It was created through a restructuring of Google on October 2, 2015,[2] and became the parent holding company of Google and several former Google subsidiaries.[3][4][5] Alphabet is listed on the large-cap section of the Nasdaq under the ticker symbols GOOGL and GOOG; both classes of stock are components of major stock market indices such as the S&P 500 and Nasdaq-100. Alphabet has been described as a Big Tech company.",
        "subsidiaries": [
            "Calico",
            "CapitalG",
            "Google",
            "Google Fiber",
            "GV",
            "Isomorphic Labs",
            "Verily",
            "Waymo",
            "Wing"
        ]
    },
    {
        "name": "Altria",
        "description": "Altria Group, Inc. is an American corporation and one of the world's largest producers and marketers of tobacco, cigarettes, and medical products in the treatment of illnesses caused by tobacco. It operates worldwide and is headquartered in the city of Richmond, Virginia.[2]",
        "subsidiaries": [
            "Philip Morris USA",
            "John Middleton, Inc.",
            "U.S. Smokeless Tobacco Company",
            "Helix Innovations",
            "NJOY",
            "Horizon Innovations LLC"
        ]
    },
    {
        "name": "Amazon",
        "description": "Amazon.com, Inc.[1] (doing business as Amazon)[a] is an American multinational technology company engaged in e-commerce, cloud computing, online advertising, digital streaming, and artificial intelligence.[5] Founded in 1994 by Jeff Bezos in Bellevue, Washington,[6] the company originally started as an online marketplace for books, but gradually expanded its offerings to include a wide range of product categories, referred to as \"The Everything Store\".[7] Amazon has been described as a Big Tech company.[8]",
        "subsidiaries": [
            "AbeBooks",
            "Amazon.com",
            "Amazon Air",
            "Amazon Books",
            "Amazon Fresh",
            "Amazon Games",
            "Amazon Lab126",
            "Amazon Logistics",
            "Amazon Pharmacy",
            "Amazon Publishing",
            "Amazon Robotics",
            "Amazon MGM Studios",
            "AWS",
            "Audible",
            "Blink",
            "Body Labs",
            "Brilliance Audio",
            "Eero LLC",
            "Goodreads",
            "IMDb",
            "Kuiper Systems",
            "PillPack",
            "Ring",
            "Twitch Interactive",
            "Whole Foods Market",
            "Woot",
            "Zappos",
            "Zoox"
        ]
    },
    {
        "name": "Amcor",
        "description": "Amcor plc is an Australian-founded Jersey-domiciled[2] global packaging company based in Switzerland. It develops and produces flexible packaging,[3] rigid containers, specialty cartons,[4] closures and services for food, beverage, pharmaceutical, medical-device, home and personal-care,[5] and other products.[6]",
        "subsidiaries": []
    },
    {
        "name": "Ameren",
        "description": "Ameren Corporation is an American power company created December 31, 1997, by the merger of Union Electric Company (formerly NYSE: UEP) of St. Louis, Missouri and the neighboring Central Illinois Public Service Company (CIPSCO Inc. holding, formerly NYSE: CIP) of Springfield, Illinois.[3] It is now a holding company for several power companies and energy companies. The company is based in St. Louis, with 2.4 million electric, and 900,000 natural gas customers across 64,000 square miles in central and eastern Missouri and the southern four-fifths of Illinois by area.[4]",
        "subsidiaries": []
    },
    {
        "name": "American Electric Power",
        "description": "American Electric Power Company, Inc. (AEP; railcar reporting mark: AEPX) is an American domestic electric utility company in the United States. It is one of the largest electric utility companies in the country, with more than five million customers in 11 states.[2]",
        "subsidiaries": []
    },
    {
        "name": "American Express",
        "description": "American Express Company[7] or Amex is an American bank holding company and multinational financial services corporation that specializes in payment cards. It is headquartered at 200 Vesey Street, also known as American Express Tower, in the Battery Park City neighborhood of Lower Manhattan.",
        "subsidiaries": [
            "American Express Global Business Travel(33.54%)[1]",
            "Resy",
            "American Express National Bank",
            "American Express Ventures",
            "American Express International, Inc.",
            "American Express Centurion Bank",
            "American Express Bank, FSB",
            "American Express Credit Corporation",
            "American Express Travel Related Services Company, Inc."
        ]
    },
    {
        "name": "American International Group",
        "description": "American International Group, Inc. (AIG) is an American multinational finance and insurance corporation with operations in more than 80 countries and jurisdictions.[5]: 8  As of 2023, AIG employed 25,200 people.[6] The company operates through three core businesses: general insurance, life & retirement, and a standalone technology-enabled subsidiary.[7][8][9] General Insurance includes Commercial, Personal Insurance, U.S. and International field operations. Life & Retirement includes Group Retirement, Individual Retirement, Life, and Institutional Markets.[7][8][9]\nAIG is the title sponsor of the AIG Women's Open golf tournament. In 2023, for the sixth consecutive year, DiversityInc named AIG among the Top 50 Companies for Diversity list.[10]",
        "subsidiaries": []
    },
    {
        "name": "American Tower",
        "description": "American Tower Corporation (also referred to as American Tower or ATC) is an American real estate investment trust which owns, develops and operates wireless and broadcast communications infrastructure in several countries. It is headquartered in Boston, Massachusetts.",
        "subsidiaries": []
    },
    {
        "name": "American Water Works",
        "description": "American Water is an American public utility company that, through its subsidiaries, provides water and wastewater services in the United States.[5]",
        "subsidiaries": []
    },
    {
        "name": "Ameriprise Financial",
        "description": "Ameriprise Financial, Inc. is an American diversified financial services company and bank holding company based in Minneapolis, Minnesota.[1] It provides financial planning products and services, including wealth management, asset management, insurance, annuities, and estate planning.[1]",
        "subsidiaries": [
            "Columbia Threadneedle Investments",
            "RiverSource Life Insurance Company"
        ]
    },
    {
        "name": "Ametek",
        "description": "AMETEK, Inc. is an American multinational conglomerate and global designer and manufacturer of electronic instruments and electromechanical devices with headquarters in the United States and over 150 sites worldwide.[2]",
        "subsidiaries": []
    },
    {
        "name": "Amgen",
        "description": "Amgen Inc. is an American multinational biopharmaceutical company headquartered in Thousand Oaks, California. The company is ranked 18th on the list of largest biomedical companies by revenue. The name \"AMGen\" is a portmanteau of the company's original name, Applied Molecular Genetics.",
        "subsidiaries": []
    },
    {
        "name": "Amphenol",
        "description": "Amphenol Corporation is an American producer of electronic and fiber optic connectors, cable and interconnect systems such as coaxial cables.[3] Amphenol is a portmanteau from the corporation's original name, American Phenolic Corp.[4]",
        "subsidiaries": []
    },
    {
        "name": "Analog Devices",
        "description": "Analog Devices, Inc. (ADI), also known simply as Analog, is an American multinational semiconductor company specializing in data conversion, signal processing, and power management technology, headquartered in Wilmington, Massachusetts.[2][3]",
        "subsidiaries": []
    },
    {
        "name": "Aon plc",
        "description": "Aon plc (English: /ˈeɪɒn/) is a British-American[3] professional services firm. The company operates two divisions: Risk Capital (67% of 2024 revenues), which provides brokerage and consulting services for risk management and insurance and reinsurance, and Human Capital (33% of 2024 revenues), which provides services for health insurance, retirement plans, pension plans, and talent advisory.[2]",
        "subsidiaries": []
    },
    {
        "name": "APA Corporation",
        "description": "APA Corporation is the holding company for Apache Corporation, an American company engaged in hydrocarbon exploration.[2] It is organized in Delaware and headquartered in Houston. The company is ranked 431st on the Fortune 500.[3]",
        "subsidiaries": []
    },
    {
        "name": "Apollo Global Management",
        "description": "Apollo Global Management, Inc. is an American asset management firm that primarily invests in alternative assets.[2][3][1] As of 2025[update], the company had $840 billion of assets under management, including $392 billion invested in credit, including mezzanine capital, hedge funds, non-performing loans, and collateralized loan obligations, $99 billion invested in private equity, and $46.2 billion invested in real assets, which includes real estate and infrastructure. The company invests money on behalf of pension funds, financial endowments, and sovereign wealth funds, as well as other institutional and individual investors.[1]",
        "subsidiaries": []
    },
    {
        "name": "Apple Inc.",
        "description": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, in Silicon Valley, best known for its consumer electronics, software and online services. Founded in 1976 as Apple Computer Company by Steve Jobs, Steve Wozniak and Ronald Wayne, the company was incorporated by Jobs and Wozniak as Apple Computer, Inc. the following year. It was renamed to its current name in 2007 as the company had expanded its focus from computers to consumer electronics. Apple is one of the Big Tech companies.",
        "subsidiaries": [
            "Apple Financing[1]",
            "Apple Studios",
            "Beats Electronics",
            "Beddit",
            "Braeburn Capital",
            "Claris",
            "Globalstar(20%)"
        ]
    },
    {
        "name": "Applied Materials",
        "description": "Applied Materials, Inc. is an American corporation that supplies equipment, services and software for the manufacture of semiconductor (integrated circuit) chips for electronics, flat panel displays for computers, smartphones, televisions, and solar products. The company also supplies equipment to produce coatings for flexible electronics, packaging and other applications. The company is headquartered in Santa Clara, California,[2] and is the second largest supplier of semiconductor equipment in the world based on revenue behind Dutch company ASML.[3][4]",
        "subsidiaries": []
    },
    {
        "name": "AppLovin",
        "description": "AppLovin Corporation is an American mobile technology company headquartered in Palo Alto, California.[3] Founded in 2012, the company helps developers market, monetize, analyze and publish their apps through its mobile advertising, marketing, and analytics platforms, SSP MAX;[4] DSP AppDiscovery; and SparkLabs creative studio.[5] The company also invests in various mobile game publishers.",
        "subsidiaries": []
    },
    {
        "name": "Aptiv",
        "description": "Aptiv PLC is an American[3][4] automotive technology supplier with headquarters in Schaffhausen, Switzerland.[1] Aptiv grew out of the now-defunct American company, Delphi Automotive Systems, which itself was formerly a component of General Motors.[5]",
        "subsidiaries": []
    },
    {
        "name": "Arch Capital Group",
        "description": "Arch Capital Group Ltd. (Arch Capital or ACGL) is a Bermuda exempted public company which writes insurance, reinsurance and mortgage insurance on a worldwide basis, with a focus on specialty lines, the segment of the insurance industry where the more difficult and unusual risks are written. The company is headquartered in Bermuda and operates globally in 60 offices in North America, Europe, Asia and Australia.[1]",
        "subsidiaries": []
    },
    {
        "name": "Archer Daniels Midland",
        "description": "The Archer-Daniels-Midland Company, commonly known as ADM, is an American multinational food processing and commodities trading corporation founded in 1902 and headquartered in Chicago, Illinois. The company operates more than 270 plants and 420 crop procurement facilities worldwide, where cereal grains and oilseeds are processed into products used in food, beverage, nutraceutical, industrial, and animal feed markets worldwide.",
        "subsidiaries": []
    },
    {
        "name": "Ares Management",
        "description": "Ares Management Corporation is a global alternative investment manager operating in the credit, private equity and real estate markets. The company was founded in 1997, with additional offices across North America, Europe, and Asia.",
        "subsidiaries": []
    },
    {
        "name": "Arista Networks",
        "description": "Arista Networks, Inc. (formerly Arastra)[3] is an American computer networking company headquartered in Santa Clara, California. The company designs and sells multilayer network switches to deliver software-defined networking (SDN) for large datacenter, cloud computing, high-performance computing, and high-frequency trading environments. These products include 10/25/40/50/100/200/400/800 gigabit low-latency cut-through Ethernet switches. Arista's Linux-based network operating system, Extensible Operating System (EOS), runs on all Arista products.",
        "subsidiaries": []
    },
    {
        "name": "Arthur J. Gallagher & Co.",
        "description": "Arthur J. Gallagher & Co. (Gallagher) is an insurance brokerage and risk management services company based in Rolling Meadows, Illinois, a suburb of Chicago. The company provides insurance brokerage (86% of 2024 revenues) and risk management services (14% of 2024 revenues), which primarily includes processing of workers compensation and automobile insurance claims via the company's adjusters.[1]",
        "subsidiaries": []
    },
    {
        "name": "Assurant",
        "description": "Assurant, Inc. doing business as Assurant,[3] is a global provider of risk management products and services[4] with headquarters in Atlanta.[2] Its businesses provide a diverse set of specialty, niche-market insurance products in the property, casualty, extended device protection, and preneed insurance sectors. The company's main operating segments are Global Housing and Global Lifestyle.[2]",
        "subsidiaries": []
    },
    {
        "name": "AT&T",
        "description": "AT&T Inc., an abbreviation of its predecessor's original name, the American Telephone and Telegraph Company,[5] is an American multinational telecommunications conglomerate headquartered at the Whitacre Tower in Downtown Dallas, Texas.[6] AT&T is the world’s third-largest telecommunications company by revenue, the third largest wireless carrier in the United States behind T-Mobile and Verizon, and the nation's biggest fiber internet provider.[7] On the New York Stock Exchange, AT&T trades under the ticker symbol “T,” and has a market capitalization of $186.83 billion. On the Fortune 500 (2025) AT&T ranked 37th among the largest American businesses and reported revenues of $125.6 billion last year.",
        "subsidiaries": []
    },
    {
        "name": "Atmos Energy",
        "description": "Atmos Energy Corporation, headquartered in Dallas, Texas, is one of the United States' largest natural-gas-only distributors,[3] serving about three million natural gas distribution customers in over 1,400 communities in nine states[4] from the Blue Ridge Mountains in the East to the Rocky Mountains in the West.[citation needed]",
        "subsidiaries": []
    },
    {
        "name": "Autodesk",
        "description": "Autodesk, Inc. is an American  multinational software corporation that provides software products and services for the architecture, engineering, construction, manufacturing, media, education, and entertainment industries. Autodesk is headquartered in San Francisco, California,[3] and has offices worldwide. Its U.S. offices are located in the states of California, Oregon, Colorado, Texas, Michigan,  New Hampshire and Massachusetts. Its Canadian offices are located in the provinces of Ontario, Quebec, Alberta, and British Columbia.",
        "subsidiaries": []
    },
    {
        "name": "Automatic Data Processing",
        "description": "Automatic Data Processing, Inc. (ADP) is an American multinational provider of cloud-based human resources management, payroll processing, and professional employer organization (PEO) services, headquartered in Roseland, New Jersey.",
        "subsidiaries": []
    },
    {
        "name": "AutoZone",
        "description": "AutoZone, Inc., doing business as AutoZone (and formerly known as Auto Shack from 1979 to 1987), is an American retailer of aftermarket automotive parts and accessories, the largest in the United States. Founded in 1979, AutoZone has 7,140 stores across the United States, Mexico, Puerto Rico, Brazil, and the US Virgin Islands. The company is based in Memphis, Tennessee.[1][2]",
        "subsidiaries": []
    },
    {
        "name": "AvalonBay Communities",
        "description": "AvalonBay Communities, Inc. is a publicly traded real estate investment trust that invests in apartments.",
        "subsidiaries": []
    },
    {
        "name": "Avery Dennison",
        "description": "Avery Dennison Corporation is an American multinational manufacturer and distributor of pressure-sensitive adhesive materials (such as self-adhesive labels), apparel branding labels and tags, RFID inlays, and specialty medical products.  The company is a member of the Fortune 500 and is headquartered in Mentor, Ohio.[3][4]",
        "subsidiaries": []
    },
    {
        "name": "Axon Enterprise",
        "description": "Axon Enterprise, Inc. (formerly TASER International) is an American company based in Scottsdale, Arizona, that develops weapons and technology products for military, law enforcement, and civilians.[2]",
        "subsidiaries": []
    },
    {
        "name": "Baker Hughes",
        "description": "Baker Hughes Company is an American global energy technology company co-headquartered in Houston, Texas and London, UK. As one of the world's largest oil field services, industrial and energy technology companies, it provides products and services to the oil and gas industry for exploration and production, as well as other energy and industrial applications. It operates in over 120 countries, with facilities in Australia, Brazil, Singapore, Malaysia, India, Dubai, Saudi Arabia, Italy, Germany, Norway, the United Kingdom, Namibia, Nigeria and the United States.",
        "subsidiaries": []
    },
    {
        "name": "Ball Corporation",
        "description": "Ball Corporation is an American aluminum manufacturing company headquartered in Westminster, Colorado. It is best known for its early production of glass jars, lids, and related products used for home canning. Since its founding in Buffalo, New York, in 1880,[2] when it was known as the Wooden Jacket Can Company, the Ball company has expanded and diversified into other business ventures, including aerospace technology. It eventually became the world's largest manufacturer of recyclable aluminum packaging for a variety of beverage, home and personal care applications.",
        "subsidiaries": []
    },
    {
        "name": "Bank of America",
        "description": "The Bank of America Corporation (Bank of America; often abbreviated BAC or BofA) is an American multinational investment bank and financial services holding company headquartered at the Bank of America Corporate Center in Charlotte, North Carolina, with investment banking and auxiliary headquarters in Manhattan. The bank was founded by the merger of NationsBank and Bank of America in 1998. It is the second-largest banking institution in the United States and the second-largest bank in the world by market capitalization, both after JPMorgan Chase. Bank of America is one of the Big Four banking institutions of the United States,[3] and one of eight systemically important financial institutions in the United States. It serves about 10 percent of all American bank deposits, in direct competition with JPMorgan Chase, Citigroup, and Wells Fargo. Its primary financial services revolve around commercial banking, wealth management, and investment banking.\nThrough mergers, the oldest branch of the Bank of America franchise dates back to 1784, when Massachusetts Bank was chartered, becoming the first federally chartered joint-stock-owned bank in the United States. Another branch of its history goes back to the American-based Bank of Italy, founded by Amadeo Pietro Giannini in 1904, which provided various banking services to Italian immigrants who faced service discrimination at the time.[4] Headquartered in San Francisco, California, Giannini acquired Banca d'America e d'Italia in 1922 and eventually did business as Bank of America.",
        "subsidiaries": []
    },
    {
        "name": "Baxter International",
        "description": "Baxter International Inc. is an American multinational healthcare company with headquarters in Deerfield, Illinois.[2]",
        "subsidiaries": []
    },
    {
        "name": "Becton Dickinson",
        "description": "Becton, Dickinson and Company (BD; also Becton Dickinson or Becton[1]) is an American multinational medical technology company that manufactures and sells medical devices, instrument systems, and reagents. BD  also provides consulting and analytics services in certain areas.[2]",
        "subsidiaries": []
    },
    {
        "name": "Berkshire Hathaway",
        "description": "Berkshire Hathaway Inc. (/ˈbɜːrkʃər/) is an American multinational conglomerate holding company headquartered in Omaha, Nebraska. Originally a textile manufacturer, the company transitioned into a conglomerate starting in 1965 under the management of chairman and CEO Warren Buffett (from 1970 to 2025) and vice chairman Charlie Munger (from 1978 to 2023). Greg Abel succeeded Buffett as CEO at the beginning of 2026.[5] Buffett personally owns 38.4% of the Class A voting shares of Berkshire Hathaway, representing a 15.1% overall economic interest in the company.[4]",
        "subsidiaries": []
    },
    {
        "name": "Best Buy",
        "description": "Best Buy Co., Inc. is an American multinational consumer electronics retailer headquartered in Richfield, Minnesota. Originally founded by Richard M. Schulze and James Wheeler in 1966 as an audio specialty store called Sound of Music, it was rebranded under its current name with an emphasis on consumer electronics in 1983.",
        "subsidiaries": [
            "Best Buy Mobile",
            "Best Buy Express",
            "Geek Squad",
            "Lively",
            "Magnolia Home Theater",
            "Pacific Sales"
        ]
    },
    {
        "name": "Bio-Techne",
        "description": "Bio-Techne Corporation is an American life sciences company that develops, manufactures and sells life science reagents, instruments and services for the research, diagnostic, and bioprocessing markets.[1]",
        "subsidiaries": []
    },
    {
        "name": "Biogen",
        "description": "Biogen Inc. is an American multinational biotechnology company based in Cambridge, Massachusetts, United States specializing in the treatment of neurological diseases.[1] The company's primary products are dimethyl fumarate (Tecfidera), diroximel fumarate (Vumerity), interferon beta-1a (AVONEX), peginterferon beta-1a (Plegridy), and natalizumab (Tysabri), all for the treatment of multiple sclerosis (collectively 45% of 2024 revenues); nusinersen (Spinraza) for the treatment of spinal muscular atrophy (16.2% of 2024 revenues); omaveloxolone (Skyclarys) for the treatment of Friedreich's ataxia (4.0% of 2024 revenues); tofersen (Qalsody) for the treatment of ALS; and dimethyl fumarate (Fumaderm) for the treatment of severe plaque psoriasis.[1] The company also produces 5 biosimilars (8.2% of 2024 revenues) and has collaborations with Genentech for several drugs (18.1% of 2024 revenues).[1]",
        "subsidiaries": []
    },
    {
        "name": "BlackRock",
        "description": "BlackRock, Inc. is an American multinational investment company. Founded in 1988, initially as an enterprise risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager,[1] with $12.5 trillion in assets under management as of 2025.[4] Headquartered in New York City, BlackRock has 70 offices in 30 countries and clients in 100 countries.[5]",
        "subsidiaries": [
            "iShares",
            "Global Infrastructure Partners",
            "HPS Investment Partners"
        ]
    },
    {
        "name": "Blackstone Inc.",
        "description": "Blackstone Inc. is an American alternative investment management company based in New York City. It was founded in 1985 as a mergers and acquisitions firm by Peter Peterson and Stephen Schwarzman, who had previously worked together at Lehman Brothers. Blackstone's private equity business has been one of the largest investors in leveraged buyouts in the last three decades, while its real estate business has actively acquired commercial real estate across the globe. Blackstone is also active in credit, infrastructure, hedge funds, secondaries, growth equity, and insurance solutions. As of September 30, 2025, Blackstone has $1.2 trillion in total assets under management, making it the world's largest alternative investment firm.",
        "subsidiaries": []
    },
    {
        "name": "Block, Inc.",
        "description": "Block, Inc. (formerly Square, Inc.[12]) is an American technology company and a financial services provider for consumers and merchants.[13][14][15] Founded in 2009 by Jack Dorsey, it is the U.S. market leader in point-of-sale systems.[16][17][18] As of 2024, Block serves 57 million users and 4 million sellers,[19][20] processing $241 billion in payments annually.[4]",
        "subsidiaries": [
            "Square Fin. Services, Inc.",
            "Afterpay Australia Pty Ltd",
            "TIDAL Music AS",
            "Aspiro AB",
            "Clearpay Finance Ltd"
        ]
    },
    {
        "name": "BNY Mellon",
        "description": "The Bank of New York Mellon Corporation, commonly known as BNY or by its prior brand name BNY Mellon, is an American international financial services company headquartered in New York City. It was established in its current form in July 2007 by the merger of the Bank of New York and Mellon Financial Corporation. Through the lineage of Bank of New York, which was founded in 1784 by a group that included Alexander Hamilton, BNY is regarded as one of the three oldest banks in the United States and among the oldest in the world. It was the first company listed on the New York Stock Exchange. In 2024, it was ranked 130th on the Fortune 500 list of the largest U.S. corporations by total revenue, and a 2018 Fortune analysis identified it as the oldest company on the list.[2] As of 2024, it was the 13th-largest bank in the United States by total assets and the 83rd-largest in the world. BNY is considered a systemically important financial institution by the Financial Stability Board.",
        "subsidiaries": []
    },
    {
        "name": "Boeing",
        "description": "The Boeing Company (/ˈboʊɪŋ/ BO-ing) is an American multinational corporation that designs, manufactures, and sells airplanes, rotorcraft, rockets, satellites, and missiles worldwide.[5] The company also provides leasing and product support services. Boeing is among the largest global aerospace manufacturers; it is the fourth-largest defense contractor in the world based on 2022 revenue[6] and is the largest exporter in the United States by dollar value.[7] Boeing was founded in 1916 by William E. Boeing in Seattle, Washington.[8] The present corporation is the result of the merger of Boeing with McDonnell Douglas on August 1, 1997.",
        "subsidiaries": [
            "Aurora Flight Sciences",
            "Boeing Australia",
            "Boeing Canada",
            "Boeing UK",
            "Insitu",
            "Jeppesen",
            "Spectrolab",
            "Spirit AeroSystems",
            "Wisk Aero"
        ]
    },
    {
        "name": "Booking Holdings",
        "description": "Booking Holdings Inc. is an American travel technology company incorporated under Delaware General Corporation Law. It is  located on 800 Connecticut Avenue in Norwalk, Connecticut, and owns and operates several travel fare aggregators and travel fare metasearch engines including namesake and flagship Booking.com, Priceline.com, Agoda, Kayak, Cheapflights, Rentalcars.com, Momondo, and OpenTable. It operates websites in about 40 languages and 200 countries.",
        "subsidiaries": []
    },
    {
        "name": "Boston Scientific",
        "description": "Boston Scientific Corporation (BSC) is an American biotechnology and biomedical engineering firm and multinational manufacturer of medical devices used in interventional medical specialties, including interventional radiology, interventional cardiology, peripheral interventions, neuromodulation, neurovascular intervention, electrophysiology, cardiac surgery, vascular surgery, endoscopy, oncology, urology and gynecology.",
        "subsidiaries": []
    },
    {
        "name": "Bristol Myers Squibb",
        "description": "Bristol-Myers Squibb Company, doing business as Bristol Myers Squibb, is an American multinational pharmaceutical company headquartered in Princeton, New Jersey.[1] The company's primary products are apixaban (Eliquis) for people with atrial fibrillation (28% of 2024 revenues); nivolumab (Opdivo), used to treat certain types of cancer (19% of 2024 revenues); lenalidomide (Revlimid), used to treat multiple myeloma, smoldering myeloma, and myelodysplastic syndromes (12% of 2024 revenues); abatacept (Orencia), used to treat autoimmune diseases such as rheumatoid arthritis (8% of 2024 revenues); pomalidomide (Pomalyst/Imnovid), an anti-cancer medication used for the treatment of multiple myeloma and AIDS-related Kaposi sarcoma (8% of 2024 revenues); ipilimumab (Yervoy), to treat cancer (5% of 2024 revenues); and luspatercept (Reblozyl) for the treatment of anemia in beta thalassemia and myelodysplastic syndromes (4% of 2024 revenues).[1] In 2024, 71% of the company's revenues came from the United States.[1]",
        "subsidiaries": []
    },
    {
        "name": "Broadcom",
        "description": "Broadcom Inc. is an American multinational designer, developer, manufacturer, and global supplier of a wide range of semiconductor and infrastructure software products. Broadcom's product offerings serve the data center, networking, software, broadband, wireless, storage, and industrial markets. As of 2025—amid the AI boom—Broadcom is one of the largest companies globally, and could be considered part of the Big Tech group and the Magnificent Seven,[4][5] replacing Tesla.[6]",
        "subsidiaries": []
    },
    {
        "name": "Broadridge Financial Solutions",
        "description": "Broadridge Financial Solutions, Inc. is a public corporate services  and financial technology company. Headquartered in Lake Success, New York,[3] the company was founded in 2007 as a spin-off from Automatic Data Processing.[1] Broadridge supplies companies in the financial industry with financial documents such as proxy statements and annual reports, as well as shareholder communications solutions such as virtual annual meetings.[1][4]",
        "subsidiaries": []
    },
    {
        "name": "Brown & Brown",
        "description": "Brown & Brown, Inc. is an American insurance brokerage firm headquartered in Daytona Beach, Florida. It is one of the largest independent insurance intermediaries in the United States, providing risk management solutions, insurance products, and services to businesses, governmental institutions, professional organizations, trade associations, and individuals.",
        "subsidiaries": []
    },
    {
        "name": "Brown–Forman",
        "description": "Brown-Forman Corporation is an American family-controlled publicly traded company, one of the largest in the spirits and wine business. Based in Louisville, Kentucky, it manufactures several well-known brands throughout the world, including Jack Daniel's, Old Forester, Woodford Reserve, GlenDronach, BenRiach, Glenglassaugh, Herradura, Korbel, and Chambord. Brown-Forman formerly owned Southern Comfort and Tuaca before selling them off in 2016.",
        "subsidiaries": []
    },
    {
        "name": "Builders FirstSource",
        "description": "Builders FirstSource, Inc. is a Fortune 500 company[1][2] that is a manufacturer and supplier of building materials.[3] The company is headquartered in Irving, Texas, and is the largest supplier of building products, prefabricated components and value-added services in the US. Builders FirstSource employs over 15,000 people throughout the USA.[4]  They serve new residential construction, repair and remodeling professionals.[5] The company was incorporated in March 1998.[6] The company has about 550 locations in 40 US states.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Bunge Global",
        "description": "Bunge Global SA (BUN-ghee)[2] is a global agribusiness and food company, incorporated in Geneva, Switzerland and headquartered in St. Louis, Missouri, United States.",
        "subsidiaries": []
    },
    {
        "name": "BXP, Inc.",
        "description": "BXP, Inc. (formerly Boston Properties, Inc.) is a publicly traded real estate investment trust which invests in premier workplaces in Boston, Los Angeles, New York City, San Francisco, Seattle, and Washington, D.C. As of December 31, 2023, the company owned or had interests in 188 commercial real estate properties, aggregating approximately 53.3 million net rentable square feet.[1]",
        "subsidiaries": []
    },
    {
        "name": "C.H. Robinson",
        "description": "C.H. Robinson Worldwide, Inc. is an American transportation company that includes third-party logistics (3PL). The company offers freight transportation, transportation management, brokerage and warehousing. It offers truckload, less than truckload, air freight, intermodal, and ocean transportation.[3]",
        "subsidiaries": []
    },
    {
        "name": "Cadence Design Systems",
        "description": "Cadence Design Systems, Inc. (stylized as cādence)[2] is an American multinational technology and computational software company[3] headquartered in San Jose, California.[2]  Initially specialized in electronic design automation (EDA) software for the semiconductor industry,[4] currently the company makes software and hardware for designing products such as integrated circuits, systems on chips (SoCs), printed circuit boards,[3] and pharmaceutical drugs, also licensing intellectual property for the electronics, aerospace, defense and automotive industries.[5]",
        "subsidiaries": []
    },
    {
        "name": "Camden Property Trust",
        "description": "Camden Property Trust is a publicly traded real estate investment trust that invests in apartments in the United States. As of December 31, 2023, the company owned interests in 176 apartment communities containing 59,800 apartment homes in the United States.[1] It is the 14th largest owner of apartments in the United States.[2]",
        "subsidiaries": []
    },
    {
        "name": "Campbell's Company (The)",
        "description": "The Campbell's Company (doing business as Campbell's and formerly known as the Campbell Soup Company) is an American company, most closely associated with its flagship canned soup products. The classic red-and-white can design used by many Campbell's branded products has become an American icon, and its use in pop art was typified by American artist Andy Warhol's series of Campbell's Soup Cans prints.",
        "subsidiaries": [
            "Pepperidge Farm",
            "Pace Foods",
            "Snyder's-Lance",
            "Pacific Foods",
            "Sovos Brands"
        ]
    },
    {
        "name": "Capital One",
        "description": "Capital One Financial Corporation is an American bank holding company founded on July 21, 1994, and specializing in credit cards, auto loans, banking, and savings accounts, headquartered in Tysons, Virginia, with operations primarily in the United States.[2] It is the sixth-largest bank in the United States by total assets as of June 30, 2025[update],[3] the third-largest issuer of Visa and Mastercard credit cards, and one of the largest car finance companies in the United States.",
        "subsidiaries": []
    },
    {
        "name": "Cardinal Health",
        "description": "Cardinal Health, Inc. is an American multinational health care services company, and the 15th highest revenue generating company in the United States. Headquartered in Dublin, Ohio, the company specializes in the distribution of pharmaceuticals and medical products, serving more than 100,000 locations. The company also manufactures medical and surgical product, including gloves, surgical apparel, and fluid management products. In addition, it operates one of the largest networks of radiopharmacies in the U.S.[2] Cardinal Health provides medical products to over 75 percent of hospitals in the United States.[3]",
        "subsidiaries": []
    },
    {
        "name": "Carnival",
        "description": "Carnival Corporation & plc is an Anglo-American cruise line operator that owns more than 90 vessels across eight brands.[4]",
        "subsidiaries": []
    },
    {
        "name": "Carrier Global",
        "description": "Carrier Global Corporation is an American multinational heating, ventilation, and air conditioning (HVAC), refrigeration, and fire and security equipment corporation based in Palm Beach Gardens, Florida. Carrier was founded in 1915 as an independent company manufacturing and distributing HVAC systems, and has since expanded to include manufacturing commercial refrigeration and food service equipment, and fire and security technologies.",
        "subsidiaries": [
            "International Comfort Products"
        ]
    },
    {
        "name": "Carvana",
        "description": "Carvana Co. is an online used car retailer based in Tempe, Arizona.[2] Carvana was named to the 2021 Fortune 500 list, one of the youngest companies to be added to the list.[3]",
        "subsidiaries": []
    },
    {
        "name": "Caterpillar Inc.",
        "description": "Caterpillar Inc. is an American construction, mining, and other engineering equipment manufacturer.[6] The company is the world's largest manufacturer of construction equipment.[3][7][8]\nIn 2018, Caterpillar was ranked number 73 on the Fortune 500 list[9] and number 265 on the Global Fortune 500 list.[10] Caterpillar stock is a component of the Dow Jones Industrial Average.[11]",
        "subsidiaries": [
            "Caterpillar Financial Services",
            "Caterpillar Insurance Holdings",
            "Caterpillar Logistics Services",
            "Caterpillar Marine Power Systems",
            "FG Wilson",
            "Perkins Engines",
            "SPM Oil & Gas",
            "Progress Rail",
            "Solar Turbines"
        ]
    },
    {
        "name": "Cboe Global Markets",
        "description": "Cboe Global Markets, Inc. (formerly CBOE Holdings) is an American financial exchange operator headquartered in Chicago. It owns and operates a portfolio of exchanges and trading venues across equities, options, futures, and digital assets.",
        "subsidiaries": []
    },
    {
        "name": "CBRE Group",
        "description": "CBRE Group, Inc. (an initialism of Coldwell Banker Richard Ellis) is an American commercial real estate services and investment firm, with corporate headquarters in Dallas, Texas, and global financial headquarters at Lever House in Midtown Manhattan.[1][3] It is the world's largest commercial real estate services and investment firm based on 2022 revenue.[4][5][6]",
        "subsidiaries": []
    },
    {
        "name": "CDW Corporation",
        "description": "CDW Corporation is an American multi-brand provider of information technology services, serving business, government, education, and healthcare sectors across the United States, the United Kingdom, and Canada. Headquartered in Vernon Hills, Illinois, CDW is a Fortune 500 and generated $21 billion in annual net sales in 2023.",
        "subsidiaries": []
    },
    {
        "name": "Cencora",
        "description": "Cencora, Inc., formerly known as AmerisourceBergen, is an American drug wholesale and distribution company and a contract research organization, that was formed by the merger of Bergen Brunswig and AmeriSource in 2001.[2] It was renamed to Cencora in 2023. Cencora is one of the largest pharmaceutical companies in the world and distributes generic pharmaceuticals, over-the-counter healthcare products, as well as home healthcare supplies and equipment.[3]",
        "subsidiaries": []
    },
    {
        "name": "Centene Corporation",
        "description": "Centene Corporation is an American for-profit healthcare company based in Clayton, Missouri, which is an intermediary for government-sponsored and privately insured healthcare programs. Centene ranked No. 23 on the 2025 Fortune 500.[2]",
        "subsidiaries": []
    },
    {
        "name": "CenterPoint Energy",
        "description": "CenterPoint Energy, Inc. is an American utility company based in Houston, Texas, that provides electric and natural gas utility to customers in several markets in the American states of Indiana, Ohio, Louisiana, Minnesota, Mississippi, and Texas. Part of the Fortune 500, the company was formerly known as Reliant Energy, NorAm Energy, Houston Industries, and HL&P. The company is headquartered in the CenterPoint Energy Tower at 1111 Louisiana Street in Downtown Houston.[3][4]",
        "subsidiaries": []
    },
    {
        "name": "CF Industries",
        "description": "CF Industries Holdings, Inc. is an American manufacturer and distributor of agricultural fertilizers, including ammonia, urea, and ammonium nitrate products. The company is based in Northbrook, Illinois, a suburb of Chicago,[3] and was founded in 1946 as the Central Farmers Fertilizer Company. For its first 56 years, it was a federation of regional agricultural supply cooperatives. CF then demutualized, and became a publicly traded company.",
        "subsidiaries": []
    },
    {
        "name": "Charles River Laboratories",
        "description": "Charles River Laboratories International, Inc. is an American pharmaceutical and biotechnology contract research organisation (CRO) headquartered in Wilmington, Massachusetts, United States. Founded in 1947, the company provides preclinical and clinical laboratory services for the development of new drugs, vaccines, and medical devices. Its operations span at least 20 countries, offering research models, safety assessment, and manufacturing support services to pharmaceutical, biotechnology, and government clients.[2]",
        "subsidiaries": []
    },
    {
        "name": "Charles Schwab Corporation",
        "description": "The Charles Schwab Corporation[1] is an American multinational financial services company. It offers banking, commercial banking, investing and related services including consulting, and wealth management advisory services to both retail and institutional clients. It is on the list of largest banks in the United States by assets.[1] As of December 31, 2024,[update] it had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace retirement plan participant accounts, and 2.0 million banking accounts.[1] It also offers a donor advised fund for clients seeking to donate securities.[4][5] It was founded in San Francisco, California, and is headquartered in Westlake, Texas. It has over 380 branches, primarily in financial centers in the United States and the United Kingdom.",
        "subsidiaries": []
    },
    {
        "name": "Charter Communications",
        "description": "Charter Communications, Inc., is an American telecommunications and mass media company with services branded as Spectrum. The company is headquartered in Stamford, Connecticut.",
        "subsidiaries": []
    },
    {
        "name": "Chevron Corporation",
        "description": "Chevron Corporation is an American multinational energy corporation predominantly specializing in oil and gas. The second-largest direct descendant of Standard Oil, and originally known as the Standard Oil Company of California (shortened to Socal or CalSo), it is active in more than 180 countries.",
        "subsidiaries": [
            "Chevron Phillips Chemical(50%)",
            "Chevron Lubricants Lanka(51%)"
        ]
    },
    {
        "name": "Chipotle Mexican Grill",
        "description": "Chipotle Mexican Grill, Inc. (/tʃɪˈpoʊtleɪ/ chih-POAT-lay),[3] often known simply as Chipotle, is an American multinational chain of fast casual restaurants specializing in bowls, tacos, and Mission burritos made to order in front of the customer.[4][5][6] As of December 2025, Chipotle has 4,000 locations.[7] Its name derives from chipotle, the Nahuatl name (from chilpoctli) for a smoked and dried jalapeño chili pepper.[8][9]",
        "subsidiaries": [
            "Pizzeria Locale(2013–2023)",
            "ShopHouse Southeast Asian Kitchen(2012–2018)",
            "Tasty Made(2016–2018)",
            "Farmesa (2023–2024)"
        ]
    },
    {
        "name": "Chubb Limited",
        "description": "Chubb Limited is an American–Swiss[2] company incorporated in Zürich, and listed on the New York Stock Exchange (NYSE) where it is a component of the S&P 500.[3] Chubb is a global provider of insurance products covering property and casualty, accident and health, reinsurance, and life insurance and is the largest publicly traded property and casualty insurance company in the world.[4] Chubb operates in 55 countries and territories and in the Lloyd's insurance market in London. Clients of Chubb consist of multinational corporations and local businesses, individuals, and insurers seeking reinsurance coverage. Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance, and life insurance.",
        "subsidiaries": []
    },
    {
        "name": "Church & Dwight",
        "description": "Church & Dwight Co., Inc. is an American consumer goods company focusing on personal care, household products, and specialty products. The company was founded in 1847 and is headquartered in Ewing, New Jersey. It is the parent company of well-known brands such as Arm & Hammer, Trojan, OxiClean, and First Response. In 2022, Church & Dwight reported annual revenue of $5.4 billion. The company's products and services include a wide range of consumer goods, including laundry detergent, air fresheners, baking soda, condoms, pregnancy tests, and oral hygiene products.",
        "subsidiaries": []
    },
    {
        "name": "Ciena",
        "description": "Ciena Corporation is an American optical networking systems and software company[4][5][6] based in Hanover, Maryland.[7][8] The company has been described as a vital player in optical connectivity.[9] The company reported revenues of $4.8 billion[1] and more than 9,000 employees, as of November 2025[update].[1] Gary Smith serves as president and chief executive officer (CEO).[3][10]",
        "subsidiaries": []
    },
    {
        "name": "Cigna",
        "description": "The Cigna Group is an American multinational for-profit managed healthcare and insurance company based in Bloomfield, Connecticut.[2][3] Cigna's insurance subsidiaries are major providers of medical, dental, disability, life and accident insurance and related products and services, the majority of which are offered through employers and other groups (e.g., governmental and non-governmental organizations, unions and associations).",
        "subsidiaries": []
    },
    {
        "name": "Cincinnati Financial",
        "description": "Cincinnati Financial Corporation offers property and casualty insurance, its main business, through The Cincinnati Insurance Company, The Cincinnati Indemnity Company and The Cincinnati Casualty Company. The company has 1.01% of the domestic property and casualty insurance premiums, which ranks it as the 20th largest insurance company by market share in the U.S.[2]",
        "subsidiaries": []
    },
    {
        "name": "Cintas",
        "description": "Cintas Corporation (/ˈsɪntɑːz/) is an American corporation headquartered in Mason, Ohio, which provides a range of products and services to businesses including uniforms, mats, mops, cleaning and restroom supplies, first aid and safety products, fire extinguishers and testing, and safety courses.[4] Cintas is a publicly held company traded on the Nasdaq Global Select Market under the symbol CTAS and is a component of the S&P 500 Index.",
        "subsidiaries": []
    },
    {
        "name": "Cisco",
        "description": "Cisco Systems, Inc. (using the trademark Cisco) is an American multinational technology conglomerate corporation that develops, manufactures, and sells hardware, software, telecommunications equipment and other high-technology services and products focused on networking, cyber security and AI.[4] Cisco specializes in specific tech markets, such as the Internet of things (IoT), domain security, videoconferencing, and energy management, including products such as Webex, OpenDNS, Jabber, and Jasper. The company is headquartered in San Jose, California and, as of December 2025, has a market capitalization of $317 billion.[5]",
        "subsidiaries": []
    },
    {
        "name": "Citigroup",
        "description": "Citigroup Inc. or Citi (stylized as citi) is an American multinational investment bank and financial services company based in New York City. The company was formed in 1998 by the merger of Citicorp, the bank holding company for Citibank, and Travelers; Travelers was spun off from the company in 2002.[2][3]",
        "subsidiaries": [
            "Bank Handlowy(Poland)",
            "Citibank Argentina",
            "Citibank Australia",
            "Citibank(United States)",
            "Citibank Bahrain",
            "Citibank China",
            "Citibank Europe",
            "Citi Private Bank",
            "Citibank (Hong Kong)",
            "Citibank India",
            "Citigroup Global Markets Japan",
            "Citibank Indonesia",
            "Citibank Korea",
            "Citibank Malaysia",
            "Citibank Russia",
            "Citibank Singapore",
            "Citibank Uganda",
            "Citibank United Arab Emirates",
            "Citi Private Bank",
            "Citi Global Wealth Management",
            "Grupo Financiero Banamex",
            "Beymen",
            "Salomon Brothers",
            "Nikko Cordial",
            "Acciones y Valores de México (Acciones y Valores Banamex, Casa de Bolsa Integrante del Grupo Financiero Banamex)",
            "Discover Student Loans",
            "Yield Book",
            "Citigroup Global Markets Inc",
            "Metalmark Capital",
            "Lava Trading"
        ]
    },
    {
        "name": "Citizens Financial Group",
        "description": "Citizens Financial Group, Inc. is an American bank holding company, headquartered in Providence, Rhode Island. The company owns the bank Citizens Bank, N.A., which operates in the U.S. states of Connecticut, Delaware, Florida, Maryland, Massachusetts, Michigan, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Rhode Island, Vermont, and Virginia, as well as Washington, DC.[2]",
        "subsidiaries": []
    },
    {
        "name": "Clorox",
        "description": "The Clorox Company (formerly Clorox Chemical Company) is an American multinational manufacturer and marketer of consumer and professional products.[11]  Clorox ranked annually on the Fortune 500 list from 2000 to 2024, where it last held the #485 spot.",
        "subsidiaries": []
    },
    {
        "name": "CME Group",
        "description": "CME Group Inc. (formerly Chicago Mercantile Exchange Holdings Inc.) is an American financial services company based in Chicago, Illinois. It operates financial derivatives exchanges, including the Chicago Mercantile Exchange (CME), the Chicago Board of Trade (CBOT), the New York Mercantile Exchange (NYMEX), and the Commodity Exchange (COMEX). The company owns 27% of S&P Dow Jones Indices.[2][3][4][5] It is the world's largest operator of financial derivatives exchanges. Its exchanges are platforms for trading in agricultural products, currencies, energy, interest rates, metals, futures contracts, options, stock indexes, and cryptocurrencies futures.",
        "subsidiaries": [
            "Chicago Mercantile Exchange",
            "Chicago Board of Trade",
            "New York Mercantile Exchange",
            "Commodities Exchange, Inc.",
            "NEX Group",
            "Kansas City Board of Trade"
        ]
    },
    {
        "name": "CMS Energy",
        "description": "CMS Energy Corporation is an American energy company based in Jackson, Michigan, that is focused principally on utility operations in Michigan.[3] Its principal business is Consumers Energy, a public utility that provides electricity and natural gas to more than 6 million of Michigan's 10 million residents.[4][5] Its non-utility businesses are focused primarily on domestic independent power production. Consumers Energy has operated since 1886.[6]",
        "subsidiaries": []
    },
    {
        "name": "Coca-Cola Company (The)",
        "description": "The Coca-Cola Company is an American multinational corporation founded in 1892 headquartered in Atlanta, Georgia. It manufactures, sells and markets soft drinks including Coca-Cola, other non-alcoholic beverage concentrates and syrups, and alcoholic beverages. Its stock is listed on the New York Stock Exchange and is a component of the DJIA and the S&P 500 and S&P 100 indices.",
        "subsidiaries": []
    },
    {
        "name": "Cognizant",
        "description": "Cognizant Technology Solutions Corporation is an American multinational information technology consulting and outsourcing company originally founded in India.[5] It is headquartered in Teaneck, New Jersey, United States. Cognizant is part of the NASDAQ-100 and trades under CTSH.  It was founded in Chennai, India, as an in-house technology unit of Dun & Bradstreet in 1994,[6] and started serving external clients in 1996.[6] After a series of corporate reorganizations, there was an initial public offering in 1998.[7] Ravi Kumar Singisetti has been the CEO of the company since January 2023, replacing Brian Humphries.[8]",
        "subsidiaries": []
    },
    {
        "name": "Coinbase",
        "description": "Coinbase Global, Inc. is an American cryptocurrency exchange.[4][5][6] It was founded in 2012 by Brian Armstrong and Fred Ehrsam.[1] Coinbase has over 100 million users,[7] and is the largest U.S. based cryptocurrency exchange as well as the world's biggest bitcoin custodian, as of 2024.[8][9][6] The company operates in more than 100 countries and holds nearly US$516 billion in assets, including nearly 12 percent of all bitcoin in existence and 11 percent of all staked Ether.[10][11][6][12]",
        "subsidiaries": []
    },
    {
        "name": "Colgate-Palmolive",
        "description": "The Colgate-Palmolive Company, commonly known as Colgate-Palmolive, is an American multinational consumer products company headquartered on Park Avenue in Midtown Manhattan, New York City. The company specializes in the production, distribution, and provision of household, health care, personal care, and veterinary products.[2]",
        "subsidiaries": []
    },
    {
        "name": "Comcast",
        "description": "Comcast Corporation, formerly known as Comcast Holdings,[note 1] is an American multinational mass media, telecommunications, and entertainment conglomerate. Comcast’s corporate headquarters is at the Comcast Center in Philadelphia,[8] while NBCUniversal, Comcast’s New York operations and other major Comcast assets is headquartered at 30 Rockefeller Plaza in Midtown Manhattan in New York City. The company was ranked 51st in the Forbes Global 2000 in 2023.[9] It is the fourth-largest telecommunications company by worldwide revenue, after AT&T, Verizon, and China Mobile.[10] Comcast is the third-largest pay-TV company, the second-largest cable TV company by subscribers, and the largest home Internet service provider in the United States.",
        "subsidiaries": [
            "NBCUniversal",
            "Sky Group",
            "Comcast Business",
            "Midco(49%)"
        ]
    },
    {
        "name": "Comfort Systems USA",
        "description": "Comfort Systems USA, Inc. is an American company that provides mechanical and electrical contracting services, primarily HVAC, plumbing, piping and controls, off-site construction, monitoring and fire protection, and installation and servicing of electrical systems.[1]",
        "subsidiaries": []
    },
    {
        "name": "Conagra Brands",
        "description": "Conagra Brands, Inc. (formerly ConAgra Foods) is an American consumer packaged goods holding company that makes and sells products under various brand names that are available in supermarkets, restaurants, and food service establishments. Based on its 2021 revenue, the company ranked 331st on the 2022 Fortune 500.[3] Headquartered in Chicago, Illinois, Conagra was founded in Nebraska in 1919 and was originally called Nebraska Consolidated Mills.",
        "subsidiaries": []
    },
    {
        "name": "ConocoPhillips",
        "description": "ConocoPhillips Company is an American multinational corporation engaged in hydrocarbon exploration and production. It is based in the Energy Corridor district of Houston, Texas.",
        "subsidiaries": []
    },
    {
        "name": "Consolidated Edison",
        "description": "Consolidated Edison, Inc., commonly known as Con Edison (stylized as conEdison) or ConEd, is an energy company based in New York City.  It is one of the largest investor-owned energy companies in the United States, with approximately $15.26 billion in annual revenues as of 2024, and over $70 billion in assets.[2] The company provides a wide range of energy-related products and services to its customers through its subsidiaries:",
        "subsidiaries": []
    },
    {
        "name": "Constellation Brands",
        "description": "Constellation Brands, Inc. is an American producer and marketer of beer, wine, and spirits. A Fortune 500 company,[3] Constellation is the largest beer import company in the US, measured by sales,[4] and has the third-largest market share (7.4 percent) of all major beer suppliers.[5] It also has sizable investments in medical and recreational cannabis through its association with Canopy Growth.[6] Based in Rochester, New York, Constellation has about 40 facilities and approximately 9,000 employees.[7]",
        "subsidiaries": []
    },
    {
        "name": "Constellation Energy",
        "description": "Constellation Energy Corporation is an American energy company headquartered in Baltimore, Maryland. The company provides electric power, natural gas, and energy management services. It has approximately two million customers across the continental United States.[2]",
        "subsidiaries": []
    },
    {
        "name": "Cooper Companies (The)",
        "description": "The Cooper Companies, Inc., branded as CooperCompanies, is a global medical device company headquartered in San Ramon, California.[2] The company consists of two business units, CooperVision (CVI) which manufactures contact lenses, and CooperSurgical (CSI), which manufactures medical devices and fertility and genomic products for the women's healthcare market.[3]",
        "subsidiaries": []
    },
    {
        "name": "Copart",
        "description": "Copart, Inc. is a multinational provider of online vehicle auction and remarketing services to automotive resellers such as insurance, rental car, fleet, and finance companies in 11 countries: the US, Canada, the UK, Germany, Ireland, Brazil, Spain, UAE, Bahrain, Oman, and Finland. Headquartered in Dallas, Texas, Copart has more than 200 physical locations, where it houses more than 10,000 acres of vehicle inventory. Copart sells used, wholesale and repairable vehicles in weekly and bi-weekly online auctions to buyers ranging from consumers to automotive businesses. Copart provides vehicle sellers with a range of services to process and sell repairable and clean title vehicles over the internet, using its patented virtual auction technology, named VB3, as well as others of its auction-related brands.",
        "subsidiaries": []
    },
    {
        "name": "Corning Inc.",
        "description": "Corning Incorporated is an American multinational technology company specializing in glass, ceramics, and related materials and technologies including advanced optics, primarily for industrial and scientific applications. Founded in 1851, the company was called Corning Glass Works for most of its history.[2] Corning was known during the 20th century for its consumer product lines, such as including CorningWare and Visions Pyroceram-based cookware, Corelle Vitrelle tableware, and Pyrex glass bakeware. It divested its consumer product lines in 1998 by selling the Corning Consumer Products Company (later Corelle Brands) to Borden.",
        "subsidiaries": []
    },
    {
        "name": "Corpay",
        "description": "Corpay, Inc. (formerly Fleetcor Technologies), headquartered in Atlanta, Georgia, provides payments and spend management systems and services that control expense-related purchasing and payment processes. The company focuses on vehicle-related expenses, lodging expenses, and corporate payments.[2]",
        "subsidiaries": []
    },
    {
        "name": "Corteva",
        "description": "Corteva, Inc. (also known as Corteva Agriscience) is an American company devoted to products for seeds and crop protection,[1] including herbicides, insecticides, fungicides, and biologicals (natural herbicides) that are sold in 110 countries.[1]  The company's name combines \"cor\" (Latin for \"heart\") with \"teva\" (the Hebrew word for nature).[2] It is headquartered in Indianapolis, Indiana. Corteva sells a large portion of their seeds under the Pioneer Hi-Bred International brand.",
        "subsidiaries": []
    },
    {
        "name": "CoStar Group",
        "description": "CoStar Group, Inc. is an American provider of information, analytics, and marketing services to the commercial property industry in North America and Europe. Founded in 1987 by Andrew C. Florance and based in Arlington, Virginia, the company operates the CoStar online database and news website and several online marketplaces, including Apartments.com and Homes.com.",
        "subsidiaries": [
            "Apartments.com",
            "Homes.com",
            "LoopNet",
            "Matterport",
            "STR"
        ]
    },
    {
        "name": "Costco",
        "description": "Costco Wholesale Corporation is an American multinational corporation which operates a chain of membership-only big-box warehouse club retail stores.[6] As of 2021, Costco is the third-largest retailer in the world,[7] and as of August 2024, Costco is the world's [citation needed] largest retailer of beef, poultry, organic produce, and wine, with just under a third of American consumers regularly shopping at Costco warehouses.[8] As of 2025[update], Costco is ranked 12th on the Fortune 500 rankings of the largest United States corporations by total revenue.[9]",
        "subsidiaries": []
    },
    {
        "name": "Coterra",
        "description": "Coterra Energy Inc. is an American energy company engaged in hydrocarbon exploration based in Houston, Texas. The company has operations in the Permian Basin, Marcellus Shale, and the Anadarko Basin.[1]",
        "subsidiaries": []
    },
    {
        "name": "CRH plc",
        "description": "CRH plc (an acronym for Cement Roadstone Holdings; pronounced \"Cee Orr Haitch\"[2]) is a building materials provider headquartered in Dublin. CRH produces construction materials, primarily aggregates and cement, and manufactures ready-mixed concrete, asphalt concrete, and infrastructural components, of which it is one of the largest suppliers in North America.[3][4] CRH operates with 3,816 locations in 28 countries in North America (72% of 2024 net income), Europe, Australia, and the Philippines.[1]",
        "subsidiaries": []
    },
    {
        "name": "CrowdStrike",
        "description": "CrowdStrike Holdings, Inc. is an American cybersecurity technology company based in Austin, Texas. It provides endpoint security, threat intelligence, and cyberattack response services.[3]",
        "subsidiaries": []
    },
    {
        "name": "Crown Castle",
        "description": "Crown Castle Inc. is a real estate investment trust and provider of shared communications infrastructure in the United States headquartered in Houston, Texas. Operating with 100 offices worldwide, its network includes over 40,000 cell towers and approximately 85,000 route miles of fiber supporting small cells and fiber systems.[5]",
        "subsidiaries": []
    },
    {
        "name": "CSX Corporation",
        "description": "CSX Corporation is an American holding company focused on rail transportation and real estate in North America, among other industries. The company was established in 1980 as part of the Chessie System and Seaboard Coast Line Industries merger. The various railroads of the former Chessie System and Seaboard Coast Line Industries that are now owned by CSX Corporation were eventually merged into a single line in 1986 and it became known as CSX Transportation. CSX Corporation currently has a number of subsidiaries beyond CSX Transportation. Previously based in Richmond, Virginia after the merger, the corporation moved its headquarters to Jacksonville, Florida, in 2003. CSX is a Fortune 500 company.",
        "subsidiaries": [
            "CSX Transportation",
            "Pan Am Railways",
            "Fruit Growers Express",
            "Conrail"
        ]
    },
    {
        "name": "Cummins",
        "description": "Cummins Inc. is an American multinational corporation that designs, manufactures, and distributes diesel engines, electric vehicle components, and power generation products.[2] Cummins also services engines and related equipment, including fuel systems, air handling systems controls, filtration, emission control, electrical power generation systems, and engine control units.",
        "subsidiaries": [
            "Brammo",
            "Hydrogenics",
            "Meritor",
            "Westport Innovations"
        ]
    },
    {
        "name": "CVS Health",
        "description": "CVS Health Corporation is an American multinational healthcare company that owns CVS Pharmacy, a retail pharmacy chain; CVS Caremark, a pharmacy benefits manager; and Aetna, a health insurance provider, among many other brands. The company is the world's second largest healthcare company, behind UnitedHealth Group. In 2023, the company was ranked 64th in the Forbes Global 2000.[3][4] CVS started in Lowell, Massachusetts by brothers Stanley and Sidney Goldstein and their partner Ralph Hoagland.[5] The name stood for Consumer Value Stores.[6][7]",
        "subsidiaries": [
            "CVS Pharmacy",
            "MinuteClinic",
            "CVS Caremark",
            "Longs Drugs",
            "Navarro Discount Pharmacies",
            "Omnicare",
            "Aetna",
            "Oak Street Health"
        ]
    },
    {
        "name": "Danaher Corporation",
        "description": "Danaher Corporation is an American healthcare company headquartered in Washington, D.C.. It develops products used for advances in biotechnology, life sciences, and diagnostics. The company operates three divisions: biotechnology (28% of 2024 revenues), which develops products for the development of therapeutics; life sciences (31% of 2024 revenues), which develops products to identify causes of disease, new therapies, and to test and manufacture new drugs, vaccines and gene editing technologies; and diagnostics (41% of 2024 revenues), which develops instruments, consumables, and software and services to diagnose diseases.[1] Danaher was founded in 1984 by brothers Steven Rales and Mitchell Rales; it was named after Danaher Creek in Western Montana, where the brothers came up with the idea for the company while fishing.[2][3][4]",
        "subsidiaries": []
    },
    {
        "name": "Darden Restaurants",
        "description": "Darden Restaurants, Inc. is an American multi-brand restaurant operator headquartered in Orlando, Florida.[1] Darden has more than 1,800 restaurant locations and more than 175,000 employees, making it the world's largest full-service restaurant company.[2] The company began as an extension of Red Lobster, founded by William Darden and initially backed by General Mills. Red Lobster was later sold in July 2014.",
        "subsidiaries": []
    },
    {
        "name": "Datadog",
        "description": "Datadog, Inc. is an American company that provides an observability service for cloud-scale applications, providing monitoring of servers, databases, tools, and services, through a SaaS-based data analytics platform. Founded and headquartered in New York City, the company is a publicly traded entity on the Nasdaq stock exchange.",
        "subsidiaries": []
    },
    {
        "name": "DaVita",
        "description": "DaVita Inc. is an American company that provides kidney dialysis services through a network of 2,675 outpatient centers in the United States, serving 200,800 patients, and 367 outpatient centers in 11 other countries serving 49,400 patients. The company primarily treats end-stage renal disease (ESRD), which requires patients to undergo kidney dialysis, often 3 times per week for the rest of their lives unless they receive a kidney transplant via organ donation. The company has a 37% market share in the U.S. dialysis market.[citation needed] It is incorporated in Delaware and headquartered in Denver.[2]",
        "subsidiaries": []
    },
    {
        "name": "Deckers Brands",
        "description": "Deckers Outdoor Corporation, doing business as Deckers Brands, is an American footwear designer and distributor founded in 1973 and based in Goleta, California. The company's portfolio of brands includes UGG, Teva, and Hoka. It was founded by Doug Otto and Karl F. Lopker.[2][3]",
        "subsidiaries": [
            "Hoka",
            "Koolaburra",
            "Teva",
            "UGG"
        ]
    },
    {
        "name": "Deere & Company",
        "description": "Deere & Company, doing business as John Deere[3] (/ˈdʒɒnˈdɪər/), is an American corporation that manufactures agricultural machinery, heavy equipment, forestry machinery, diesel engines, drivetrains (axles, transmissions, gearboxes) used in heavy equipment and lawn care equipment. It also provides financial services and other related activities.",
        "subsidiaries": []
    },
    {
        "name": "Dell Technologies",
        "description": "Dell Technologies Inc. is an American multinational technology company that has been headquartered in Round Rock, Texas since 1994.[3] It was formed as a result of the September 2016 merger of Dell and EMC Corporation.[4] Dell Technologies ranked 48th on the 2024 Fortune 500 rankings of the largest United States corporations based on its 2023 revenue;[5] its products include personal computers, servers, monitors, computer software, computer security and network security, as well as information security services.[4]",
        "subsidiaries": [
            "Alienware",
            "Virtustream"
        ]
    },
    {
        "name": "Delta Air Lines",
        "description": "Delta Air Lines, Inc. is a major airline in the United States headquartered in Atlanta, Georgia, operating nine hubs, with Hartsfield–Jackson Atlanta International Airport being its largest in terms of total passengers and number of departures. With its regional subsidiaries and contractors operating under the brand name Delta Connection, Delta has over 5,400 flights daily and serves 325 destinations in 52 countries on six continents.",
        "subsidiaries": [
            "Aeroméxico(20%)",
            "Air France–KLM(3%)",
            "China Eastern Airlines(3%)",
            "Endeavor Air",
            "Hanjin(15%)",
            "LATAM Airlines(10%)",
            "Republic Airways Holdings(14.4%)",
            "Virgin Atlantic(49%)",
            "WestJet(12.7%)[6]",
            "Wheels Up(21%)",
            "Clear Secure(5%)",
            "Delta TechOps",
            "Trainer Refinery",
            "Unifi Aviation(49%)"
        ]
    },
    {
        "name": "Devon Energy",
        "description": "Devon Energy Corporation is an American company engaged in hydrocarbon exploration. It is organized in Delaware with operational headquarters in the 50-story Devon Energy Center in Oklahoma City, Oklahoma. Its operations are in the Delaware Basin, Eagle Ford Group, and the Rocky Mountains (Williston Basin and Powder River Basin).[1]",
        "subsidiaries": []
    },
    {
        "name": "Dexcom",
        "description": "Dexcom, Inc.[2] is an American multinational healthcare company that develops, manufactures, produces and distributes a line of continuous glucose monitoring (CGM) systems for diabetes management. It operates internationally with global headquarters and R&D center in San Diego, California, U.S.A. and manufacturing facilities in Mesa, Arizona, U.S.A.; Batu Kawan, Malaysia and Athenry, County Galway, Ireland.",
        "subsidiaries": []
    },
    {
        "name": "Diamondback Energy",
        "description": "Diamondback Energy, headquartered in Midland, Texas, is an American company engaged in hydrocarbon exploration in the Permian Basin.[1]",
        "subsidiaries": []
    },
    {
        "name": "Digital Realty",
        "description": "Digital Realty is a real estate investment trust that owns, operates and invests in carrier-neutral data centers across the world. The company offers data center, colocation, and interconnection services.",
        "subsidiaries": []
    },
    {
        "name": "Dollar General",
        "description": "Dollar General Corporation is an American chain of discount stores headquartered in Goodlettsville, Tennessee. As of January 8, 2024, Dollar General operated 20,388 stores[1][2] in the contiguous United States and Mexico.[5][10][11]",
        "subsidiaries": []
    },
    {
        "name": "Dollar Tree",
        "description": "Dollar Tree, Inc., formerly known as Dollar Tree Stores, Inc., is an American multi-price-point chain of discount variety stores. Headquartered in Chesapeake, Virginia, it is a Fortune 500 (sometimes referred to as Fortune 200) company and operates 15,115 stores throughout the 48 contiguous U.S. states and Canada.[5] Its stores are supported by a nationwide logistics network of 24 distribution centers.",
        "subsidiaries": []
    },
    {
        "name": "Dominion Energy",
        "description": "Dominion Energy, Inc., commonly referred to as Dominion, is an American energy company headquartered in Richmond, Virginia that supplies electricity in parts of Virginia, North Carolina, and South Carolina and supplies natural gas to parts of Utah, Idaho and Wyoming, West Virginia, Ohio, Pennsylvania, North Carolina, South Carolina, and Georgia. Dominion also has generation facilities in Indiana, Illinois, Connecticut, and Rhode Island.[7]",
        "subsidiaries": []
    },
    {
        "name": "Domino's",
        "description": "Domino's Pizza, Inc., commonly referred to as Domino's, is an American multinational pizza restaurant chain founded in 1960.[2] The corporation is Delaware-domiciled[3] and headquartered at the Domino's Farms office park in Ann Arbor Township, near Ann Arbor, Michigan.[4][5] As of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,500 in India, and 1,249 in the United Kingdom.[6][7] Domino's has stores in more than 83 countries[8] and 5,701 cities worldwide.[9]",
        "subsidiaries": []
    },
    {
        "name": "DoorDash",
        "description": "DoorDash, Inc. is an American company operating online food ordering and food delivery. It trades under the symbol DASH.[4] With a 56% market share, DoorDash is the largest food delivery platform in the United States. It also has a 60% market share in the convenience delivery category.[5] As of December 31, 2020, the platform was used by 450,000 merchants, 20 million consumers, and had over one million delivery couriers.[6]",
        "subsidiaries": [
            "Deliveroo",
            "Wolt"
        ]
    },
    {
        "name": "Dover Corporation",
        "description": "Dover Corporation is an American conglomerate manufacturer of industrial products.[3] The Downers Grove, Illinois-based company was founded in 1955.[3][4] As of 2021, Dover's business was divided into five segments: Engineered Products, Clean Energy and Fueling, Imaging & Identification, Pumps & Process Solutions and Climate and Sustainability Technologies.[5] Dover is a constituent of the S&P 500 index[6] and trades on the New York Stock Exchange under the symbol DOV. Dover was ranked 448 in the 2024 Fortune 500.[7] The company relocated its headquarters to Illinois from New York in mid-2010.[8][9]",
        "subsidiaries": []
    },
    {
        "name": "Dow Inc.",
        "description": "The Dow Chemical Company is an American multinational corporation headquartered in Midland, Michigan, United States. The company was among the three largest chemical producers in the world in 2021.[2] It is the operating subsidiary of Dow Inc., a publicly traded holding company incorporated under Delaware law.[3]",
        "subsidiaries": [
            "The Dow Chemical Company",
            "Union Carbide",
            "Rohm and Haas"
        ]
    },
    {
        "name": "D. R. Horton",
        "description": "D.R. Horton, Inc. is an American home construction company based in Arlington, Texas. Since 2002, the company has been the largest homebuilder by volume in the United States.[2][3][4] The company ranked number 120 on the 2024 Fortune 500 list of the largest United States corporations by revenue.[5] The company operates in 125 markets across 36 states.[1]",
        "subsidiaries": []
    },
    {
        "name": "DTE Energy",
        "description": "DTE Energy (formerly Detroit Edison until 1996) is a Detroit-based diversified energy company involved in the development and management of energy-related businesses and services in the United States and Canada. Its operating units include an electric utility serving 2.2 million customers and a natural gas utility serving 1.3 million customers in Michigan.",
        "subsidiaries": []
    },
    {
        "name": "Duke Energy",
        "description": "Duke Energy Corporation is an American electric power and natural gas holding company headquartered in Charlotte, North Carolina. The company serves over 7 million customers in the eastern United States. In 2024 it ranked as the 141st largest company in the United States – its highest-ever placement on the Fortune 500 list.[2]",
        "subsidiaries": []
    },
    {
        "name": "DuPont",
        "description": "DuPont de Nemours, Inc., commonly shortened to DuPont, is an American multinational chemical company first formed in 1802 by French-American chemist and industrialist Éleuthère Irénée du Pont de Nemours. The company played a major role in the development of the U.S. state of Delaware and first arose as a major supplier of gunpowder. DuPont developed many polymers such as Vespel, neoprene, nylon, Corian, Teflon, Mylar, Kapton, Kevlar, Zemdrain, Nomex, Tyvek, Sorona, viton, Corfam and Lycra in the 20th century, and its scientists developed many chemicals, most notably Freon (chlorofluorocarbons), for the refrigerant industry. It also developed synthetic pigments and paints including ChromaFlair.",
        "subsidiaries": []
    },
    {
        "name": "Eaton Corporation",
        "description": "Eaton Corporation plc is an American-Irish[2] multinational power management company, with a primary administrative center in Beachwood, Ohio.[3] Eaton has more than 85,000 employees and sells products to customers in more than 175 countries.[4]",
        "subsidiaries": []
    },
    {
        "name": "eBay Inc.",
        "description": "eBay Inc. (/ˈiːbeɪ/ EE-bay, stylized as ebay) is an American multinational e-commerce company based in San Jose, California, that allows users to buy or view items via retail sales through online marketplaces and websites in 190 markets worldwide. Sales occur either via online auctions or \"buy it now\" instant sales, and the company charges commissions to sellers upon sales. eBay was founded by Pierre Omidyar in September 1995. In 2021, eBay had approximately 17 million global sellers[2];  in 2023, it reported 132 million yearly active buyers worldwide and handled $73 billion in transactions, 48% of which were in the United States. In 2023, the company had a take rate (revenue as a percentage of volume) of 13.81%.[1]",
        "subsidiaries": []
    },
    {
        "name": "Ecolab",
        "description": "Ecolab Inc. (formerly Economics Laboratory), headquartered in Saint Paul, Minnesota, provides products related to water treatment, sanitation, and hygiene, primarily to commercial and industrial customers.[1]",
        "subsidiaries": []
    },
    {
        "name": "Edison International",
        "description": "Edison International is a public utility holding company based in Rosemead, California. Its subsidiaries include Southern California Edison, and unregulated non-utility business assets Edison Energy. Edison's roots trace back to Holt & Knupps, a company founded in 1886 as a provider of street lights in Visalia, California.",
        "subsidiaries": []
    },
    {
        "name": "Edwards Lifesciences",
        "description": "Edwards Lifesciences Corporation is an American medical technology company headquartered in Irvine, California, specializing in artificial heart valves and hemodynamic monitoring. It developed the Sapien transcatheter aortic heart valve made of cow tissue within a balloon-expandable, cobalt-chromium frame, deployed via catheter.[3] The company has manufacturing facilities at the Irvine headquarters, as well as in Draper, Utah; Costa Rica; the Dominican Republic; Puerto Rico; and Singapore;[4] and is building a new facility completed in 2021 in Limerick, Ireland.[5]",
        "subsidiaries": []
    },
    {
        "name": "Electronic Arts",
        "description": "Electronic Arts Inc. (EA) is an American video game company headquartered in Redwood City, California. Founded in May 1982 by former Apple employee Trip Hawkins, the company was a pioneer of the early home computer game industry and promoted the designers and programmers responsible for its games as \"software artists\". EA published numerous games and some productivity software for personal computers, all of which were developed by external individuals or groups until 1987's Skate or Die! The company shifted toward internal game studios, often through acquisitions, such as Distinctive Software becoming EA Canada in 1991.[2]",
        "subsidiaries": []
    },
    {
        "name": "Elevance Health",
        "description": "Elevance Health, Inc. doing business as Elevance Health,[2] is an American health insurance company. Prior to June 2022, Elevance Health was named Anthem, Inc.[3] The company is the world's seventh largest healthcare company based on revenue. Its services include medical, pharmaceutical, dental, behavioral health, long-term care, and disability plans through affiliated companies such as Anthem Blue Cross and Blue Shield, Anthem Blue Cross in California,[4] Wellpoint, and Carelon.[5] It is the largest for-profit managed health care company in the Blue Cross Blue Shield Association. As of 2022, the company had 46.8 million members within its affiliated companies' health plans.[6]",
        "subsidiaries": [
            "Anthem Blue Cross and Blue Shield Affiliated Health Plans",
            "Wellpoint",
            "Carelon",
            "Carelon Global Solutions (BPO/Shared Services subsidiary)",
            "Amerigroup",
            "UniCare",
            "National Government Services"
        ]
    },
    {
        "name": "Emcor",
        "description": "EMCOR Group, Inc., is an engineering, construction, and property management company headquartered in Norwalk, Connecticut.[2]",
        "subsidiaries": []
    },
    {
        "name": "Emerson Electric",
        "description": "Emerson Electric Co. is an American multinational corporation headquartered in St. Louis, Missouri.[2][3][4] The Fortune 500 company delivers a range of engineering services, manufactures industrial automation equipment, climate control systems, and precision measurement instruments, and provides software engineering for industrial, commercial, and consumer markets.[5][6][7]",
        "subsidiaries": []
    },
    {
        "name": "Entergy",
        "description": "Entergy Corporation is an American energy company engaged in electric power production and retail distribution operations in the Deep South of the United States. Entergy is headquartered in New Orleans, Louisiana,[4] and generates and distributes electric power to three million customers in Arkansas, Louisiana, Mississippi and Texas. Entergy has approximately 24,000 megawatts of electric generating capacity, annual revenues of $11 billion and employs more than 12,000 people.[5]",
        "subsidiaries": []
    },
    {
        "name": "EOG Resources",
        "description": "EOG Resources, Inc. is an American energy company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in the Heritage Plaza building in Houston, Texas.",
        "subsidiaries": []
    },
    {
        "name": "EPAM Systems",
        "description": "EPAM Systems, Inc. is a U.S.-based global provider of information technology services and consulting.The company specializes in digital engineering, cloud transformation, artificial intelligence, and software development.[2] Headquartered in Newtown, Pennsylvania, EPAM has been listed on the New York Stock Exchange since 2012 (NYSE: EPAM).[3]\nIt is a member of the S&P 500 Index.[4]",
        "subsidiaries": []
    },
    {
        "name": "EQT Corporation",
        "description": "EQT Corporation is an American energy company engaged in hydrocarbon exploration and pipeline transport. It is headquartered in EQT Plaza in Pittsburgh, Pennsylvania.",
        "subsidiaries": []
    },
    {
        "name": "Equifax",
        "description": "Equifax Inc. is an American multinational consumer credit reporting agency headquartered in Atlanta, Georgia and is one of the three largest consumer credit reporting agencies, along with Experian and TransUnion (together known as the \"Big Three\").[4]   Equifax collects and aggregates information on more than 800 million individual consumers and more than 88 million businesses worldwide. In addition to credit and demographic data and services to business,[5] Equifax sells credit monitoring and fraud prevention services directly to consumers.[6]",
        "subsidiaries": []
    },
    {
        "name": "Equinix",
        "description": "Equinix Inc. is an American multinational company headquartered in Redwood City, California.[3] It specialized in internet connectivity and data center colocation centers, commonly known as carrier hotels until the company converted to a real estate investment trust (REIT) in January 2015.[4]",
        "subsidiaries": []
    },
    {
        "name": "Equity Residential",
        "description": "Equity Residential is a United States–based publicly traded real estate investment trust that invests in apartments.",
        "subsidiaries": []
    },
    {
        "name": "Erie Indemnity",
        "description": "Erie Insurance Group, based in Erie, Pennsylvania, is a property and casualty insurance company offering auto, home, business and life insurance through a network of independent insurance agents. As of 2021[update], Erie Insurance Group is ranked 347th on the 2021 Fortune 500 list of largest American corporations, based on total revenue for the 2020 fiscal year.[1]",
        "subsidiaries": []
    },
    {
        "name": "Essex Property Trust",
        "description": "Essex Property Trust is a publicly traded real estate investment trust that invests in apartments in California and in the Seattle metropolitan area.[1]",
        "subsidiaries": []
    },
    {
        "name": "Estée Lauder Companies (The)",
        "description": "The Estée Lauder Companies Inc. (/ˈɛsteɪ ˈlɔːdər/ EST-ay LAW-dər) is an American multinational cosmetics company, a manufacturer and marketer of makeup, skincare, perfume, and hair care products, based in Midtown Manhattan, New York City. It is the second largest cosmetics company in the world after L'Oréal. The company owns a diverse portfolio of brands, including La Mer, Jo Malone London, Clinique and Tom Ford Beauty, among many more, distributed internationally through both digital commerce and retail channels.",
        "subsidiaries": []
    },
    {
        "name": "Everest Group",
        "description": "Everest Group, Ltd. is a Delaware-based provider of reinsurance and insurance, operating for close to 50 years through subsidiaries in the U.S., Europe, Singapore, Canada, Bermuda and other territories. Everest offers property, casualty, and specialty insurance and reinsurance through its various operating affiliates located in key markets around the world.",
        "subsidiaries": []
    },
    {
        "name": "Evergy",
        "description": "Evergy, Inc. is an American investor-owned utility (IOU) with publicly traded stock with headquarters in Topeka, Kansas, and in Kansas City, Missouri. The company was formed from a merger of Westar Energy of Topeka and Great Plains Energy of Kansas City, parent company of Kansas City Power & Light. Evergy is the largest electric company in Kansas, serving more than 1.7 million residential, commercial and industrial customers in Kansas and Missouri.[2] Its more than 40 power plants have generating capacity of 16,000 megawatt electricity in Kansas and Missouri. Service territory covers 28,130 square miles (72,900 km2) in east Kansas and west Missouri. It owns more than 10,100 miles (16,300 km) of transmission lines and about 52,000 miles (84,000 km) of distribution lines.",
        "subsidiaries": []
    },
    {
        "name": "Eversource Energy",
        "description": "Eversource Energy is a publicly traded, Fortune 500 energy company headquartered in Springfield, Massachusetts with additional corporate offices in Hartford, Connecticut, and Boston, Massachusetts, with several regulated subsidiaries offering retail electricity, natural gas service and water service to approximately 4 million[7] customers in Connecticut, Massachusetts, and New Hampshire.",
        "subsidiaries": []
    },
    {
        "name": "Exelon",
        "description": "Exelon Corporation is an American public utility headquartered in Chicago, and incorporated in Pennsylvania.[1] Exelon is the largest electric parent company in the United States by revenue and is the largest regulated electric utility in the United States with approximately 10 million customers. The company is ranked 187th on the Fortune 500.[2]",
        "subsidiaries": [
            "Atlantic City Electric",
            "Baltimore Gas and Electric",
            "Commonwealth Edison",
            "Delmarva Power",
            "PECO Energy Company",
            "Pepco"
        ]
    },
    {
        "name": "Expand Energy",
        "description": "Expand Energy Corporation (formerly known as Chesapeake Energy) is the largest independent natural gas producer in the U.S., based on net daily production.[1] Headquartered in Oklahoma City, the company operates in the Appalachian Basin of the Marcellus Formation in Pennsylvania and West Virginia, as well as the Haynesville Shale in Northwestern Louisiana.[1]",
        "subsidiaries": []
    },
    {
        "name": "Expedia Group",
        "description": "Expedia Group, Inc. is an American travel technology company that owns and operates travel fare aggregators and travel metasearch engines, including Expedia, Hotels.com, Vrbo, Travelocity, Hotwire.com, Orbitz, Ebookers, CheapTickets, CarRentals.com, Expedia Cruises, Wotif, and Trivago.[1] Over 3.5 million lodging facilities and flights on over 500 airlines are bookable on the company's websites.[1] It has 16,500 employees, and its headquarters are located in Seattle, Washington.",
        "subsidiaries": []
    },
    {
        "name": "Expeditors International",
        "description": "Expeditors International of Washington, Inc. (commonly referred to as Expeditors) is an American Fortune 500 service-based logistics company with headquarters in Bellevue, Washington.[3] Expeditors generates highly optimized and customized supply chain solutions for clients with unified technology systems integrated through a global network of over 340+ locations in 100+ countries on six continents.",
        "subsidiaries": []
    },
    {
        "name": "Extra Space Storage",
        "description": "Extra Space Storage Inc. is an American real estate investment trust headquartered in Cottonwood Heights, Utah that invests in self storage facilities. The company rents storage units, including climate controlled units, drive-up units, lockers, boat storage, RV storage and business storage under the brands Extra Space Storage, Life Storage, and Storage Express. As of March 28, 2024 the company owned and/or operated 3,714 locations in 43 states, and Washington, D.C. comprising approximately 2.6 million units 283.4 million square feet of net rentable space.[2] It is the largest owner of self storage units in the United States[3] and the largest self storage property manager.[4]",
        "subsidiaries": []
    },
    {
        "name": "ExxonMobil",
        "description": "Exxon Mobil Corporation[a] (/ˌɛksɒn ˈmoʊbəl/ EK-son MOH-bəl)[4][5][6] is an American multinational oil and gas corporation headquartered in Spring, Texas, a suburb of Houston.[7][8]: 1  Founded as the largest direct successor of John D. Rockefeller's Standard Oil, the company was formed in 1999, with the merger of Exxon and Mobil. It is vertically integrated across the entire oil and gas industry, as well as within its chemicals division, which produces plastic, synthetic rubber, and other chemical products. As the largest U.S.-based oil and gas company, ExxonMobil is the eighth-largest company by revenue in the U.S. and 13th-largest in the world. It is also the largest investor-owned oil company in the world.[9][10][11] Approximately 55.56% of the company's shares are held by institutions, the largest of which, as of 2019, were The Vanguard Group (8.15%), BlackRock (6.61%), and State Street Corporation (4.83%).",
        "subsidiaries": [
            "Exxon Neftegas",
            "ExxonMobil Australia",
            "ExxonMobil Nigeria",
            "Imperial Oil",
            "SeaRiver Maritime",
            "XTO Energy"
        ]
    },
    {
        "name": "F5, Inc.",
        "description": "F5, Inc. is an American technology company specializing in application security, multi-cloud management, online fraud prevention, application delivery networking (ADN), application availability and performance, and network security, access, and authorization.",
        "subsidiaries": []
    },
    {
        "name": "FactSet",
        "description": "FactSet Research Systems Inc., trading as FactSet, is an American financial data and software company headquartered in Norwalk, Connecticut, United States. The company provides integrated data and software.[3] For fiscal year 2024, FactSet's total ASV and professional services revenues were $2.2 billion.[4] FactSet's total market value is approximately $17 billion.[5]",
        "subsidiaries": []
    },
    {
        "name": "Fair Isaac",
        "description": "FICO (legal name: Fair Isaac Corporation), originally Fair, Isaac and Company, is an American data analytics company based in Bozeman, Montana, focused on credit scoring services. It was founded by Bill Fair and Earl Isaac in 1956.[3] Its FICO score, a measure of consumer credit risk,[4] has become a fixture of consumer lending in the United States.",
        "subsidiaries": []
    },
    {
        "name": "Fastenal",
        "description": "Fastenal Company is an American publicly traded company based in Winona, Minnesota, founded in 1967. Fastenal is a major distributor of industrial and construction supplies, and the largest fastener distributor in North America. Fastenal provides supply chain solutions including bin stock, vending machines, inventory management, and logistics services. Fastenal placed 479 in the 2021 Fortune 500 based on its 2020 revenues,[3] and its stock is a component of the Nasdaq 100 and S&P 500 stock market indices. Fastenal had 3,334 in-market locations as of March 2023.[4]",
        "subsidiaries": []
    },
    {
        "name": "Federal Realty Investment Trust",
        "description": "Federal Realty Investment Trust is a real estate investment trust that invests in shopping centers in the Northeastern United States, the Mid-Atlantic states, California, and South Florida.[1]",
        "subsidiaries": []
    },
    {
        "name": "FedEx",
        "description": "FedEx Corporation, originally known as Federal Express Corporation, is an American multinational conglomerate holding company specializing in transportation, e-commerce, and business services.[3][4] The company is headquartered in Memphis, Tennessee. The name \"FedEx\" is a syllabic abbreviation of its original air division, Federal Express, which operated under this name from 1973 until 1994.[5]",
        "subsidiaries": [
            "FedEx Custom Critical",
            "FedEx Express",
            "FedEx Freight",
            "FedEx Ground",
            "FedEx Logistics",
            "FedEx Office",
            "FedEx Services",
            "FedEx Supply Chain",
            "FedEx Trade Networks"
        ]
    },
    {
        "name": "Fidelity National Information Services",
        "description": "Fidelity National Information Services, Inc. (FIS) is an American multinational corporation which offers a wide range of financial products and services. FIS is most known for its development of Financial Technology, or FinTech. Annually, FIS facilitates the movement of roughly US$9 trillion through the processing of approximately 75 billion transactions in service to more than 20,000 clients around the globe.[2]",
        "subsidiaries": []
    },
    {
        "name": "Fifth Third Bancorp",
        "description": "Fifth Third Bancorp is a bank holding company headquartered in Cincinnati, Ohio. It is the parent company of Fifth Third Bank (5/3 Bank), which operates 1,087 branches and 2,400 automated teller machines,[3] across 12 states: Ohio, Alabama, Florida, Georgia, Illinois, Indiana, Kentucky, Michigan, North Carolina, South Carolina, Tennessee, and West Virginia.[2] It is on the list of largest banks in the United States and is ranked 321st on the Fortune 500.[4] The name \"Fifth Third\" is derived from the names of the bank's two predecessor companies, Fifth National Bank and Third National Bank, which merged in 1908.",
        "subsidiaries": []
    },
    {
        "name": "First Solar",
        "description": "First Solar, Inc. is a publicly traded American manufacturer of solar panels. First Solar uses rigid thin-film modules for its solar panels, and produces CdTe panels using cadmium telluride (CdTe) as a semiconductor.[2] \nThe company was founded in 1990 by inventor Harold McMaster as Solar Cells, Inc. In 1999 it was purchased by True North Partners, LLC, which rebranded it as First Solar, Inc. It provides end-of-life panel recycling at each of its manufacturing facilities.",
        "subsidiaries": []
    },
    {
        "name": "FirstEnergy",
        "description": "FirstEnergy Corp. is an electric utility headquartered in Akron, Ohio. It was established when Ohio Edison merged with Centerior Energy in 1997.",
        "subsidiaries": []
    },
    {
        "name": "Fiserv",
        "description": "Fiserv, Inc. (/faɪˈsɜːrv/ fy-SURV) is an American multinational financial technology company headquartered in Milwaukee, Wisconsin. The company processes debit and credit card transactions, loyalty programs, loans, electronic bill pay, wires and ACH transfers, check deposits, and ATM transactions on behalf of banking institutions.[1] The company also produces debit and credit cards and point of sale terminals.[1]",
        "subsidiaries": []
    },
    {
        "name": "Ford Motor Company",
        "description": "The Ford Motor Company (commonly known as Ford, sometimes abbreviated as FoMoCo) is an American multinational automobile manufacturer headquartered in Dearborn, Michigan, United States. It was founded by Henry Ford and incorporated on June 16, 1903. The company sells automobiles and commercial vehicles under the Ford brand, and luxury cars under its Lincoln brand. The company is listed on the New York Stock Exchange under the single-letter ticker symbol F and is controlled by the Ford family. They have minority ownership but a plurality of the voting power.[3][5]",
        "subsidiaries": [
            "InternationalFord ArgentinaFord AustraliaFord BrazilFord CanadaFord EuropeBritainFranceGermanyIrelandItalyOtosan(41%)RomaniaSpainTrustFordFord IndiaFord New ZealandFord PhilippinesFord Southern AfricaFord Vietnam(75%)Ford Lio Ho(70%)AutoAlliance Thailand(50%)Changan Ford(35%)Jiangling Motors(32%)FinanceFord CreditOtherBlueOval SKFord DriveFord NextLatitude AI",
            "Ford Argentina",
            "Ford Australia",
            "Ford Brazil",
            "Ford Canada",
            "Ford EuropeBritainFranceGermanyIrelandItalyOtosan(41%)RomaniaSpainTrustFord",
            "Britain",
            "France",
            "Germany",
            "Ireland",
            "Italy",
            "Otosan(41%)",
            "Romania",
            "Spain",
            "TrustFord",
            "Ford India",
            "Ford New Zealand",
            "Ford Philippines",
            "Ford Southern Africa",
            "Ford Vietnam(75%)",
            "Ford Lio Ho(70%)",
            "AutoAlliance Thailand(50%)",
            "Changan Ford(35%)",
            "Jiangling Motors(32%)",
            "Ford Credit",
            "BlueOval SK",
            "Ford Drive",
            "Ford Next",
            "Latitude AI"
        ]
    },
    {
        "name": "Fortinet",
        "description": "Fortinet, Inc. is an American cybersecurity company headquartered in Sunnyvale, California. It develops and sells security products including firewalls, endpoint security and intrusion detection systems. Fortinet has offices in the US, Canada, and UK.[3]",
        "subsidiaries": []
    },
    {
        "name": "Fortive",
        "description": "Fortive Corporation is an American industrial technology conglomerate company headquartered in Everett, Washington. The company specializes in providing essential technologies for connected workflow solutions; designing, developing, manufacturing and distributing professional and engineered products, software and services.[2] Their products and services are split into three strategic segments; Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions.[3] As of December 2022[update], Fortive has over 18,000 employees in 60 countries worldwide.[4]",
        "subsidiaries": [
            "Fluke Corporation",
            "Accruent",
            "Gordian",
            "ServiceChannel",
            "Intelex",
            "Industrial Scientific Corporation",
            "Advanced Sterilization Products",
            "Censis"
        ]
    },
    {
        "name": "Fox Corporation(Class A)",
        "description": "Fox Corporation, commonly known as Fox Corp or simply Fox, is an American multinational mass media company headquartered at 1211 Avenue of the Americas in Midtown Manhattan with offices also in Burbank, California. Named after William Fox and incorporated in Delaware, it was formed as a spin-off of 21st Century Fox's television broadcasting, news, and sports assets on March 19, 2019.[7][8][9][10] 21CF went defunct the next day. The company is controlled by Lachlan Murdoch through a family trust with 36% voting shares.[11][12] Rupert Murdoch is chairman emeritus, while his son Lachlan Murdoch is chairman and CEO.",
        "subsidiaries": []
    },
    {
        "name": "Fox Corporation(Class B)",
        "description": "Fox Corporation, commonly known as Fox Corp or simply Fox, is an American multinational mass media company headquartered at 1211 Avenue of the Americas in Midtown Manhattan with offices also in Burbank, California. Named after William Fox and incorporated in Delaware, it was formed as a spin-off of 21st Century Fox's television broadcasting, news, and sports assets on March 19, 2019.[7][8][9][10] 21CF went defunct the next day. The company is controlled by Lachlan Murdoch through a family trust with 36% voting shares.[11][12] Rupert Murdoch is chairman emeritus, while his son Lachlan Murdoch is chairman and CEO.",
        "subsidiaries": []
    },
    {
        "name": "Franklin Resources",
        "description": "Franklin Resources, Inc. is an American multinational investment management holding company that, together with its subsidiaries, is referred to as Franklin Templeton; it is a global investment firm founded in New York City in 1947 as Franklin Distributors, Inc. It is listed on the New York Stock Exchange under the ticker symbol BEN, in honor of Benjamin Franklin, for whom the company is named, and who was admired by founder Rupert Johnson Sr. In 1973, the company's headquarters moved from New York to San Mateo, California.[2]",
        "subsidiaries": [
            "Clarion Partners",
            "ClearBridge Investments",
            "Fiduciary Trust Company International",
            "K2 Advisors",
            "Legg Mason",
            "Lexington Partners",
            "Putnam Investments",
            "Royce Investment Partners",
            "Western Asset Management Company"
        ]
    },
    {
        "name": "Freeport-McMoRan",
        "description": "Freeport-McMoRan Inc., often called Freeport, is an American mining company based in the Freeport-McMoRan Center, in Phoenix, Arizona. The company is the world's largest producer of molybdenum, a major copper producer and operates the world's largest gold mine, the Grasberg mine in Papua, Indonesia.",
        "subsidiaries": [
            "Atlantic Copper, S.A.",
            "PT Freeport Indonesia (49%)",
            "PT Irja Eastern Minerals"
        ]
    },
    {
        "name": "Garmin",
        "description": "Garmin Ltd. is an American multinational technology company based in Olathe, Kansas.[2][3] The company designs, develops, manufactures, markets, and distributes GPS-enabled products and other navigation, communication, sensor-based, and information products to the automotive, aviation, marine, outdoors, and sport markets.[4]",
        "subsidiaries": []
    },
    {
        "name": "Gartner",
        "description": "Gartner, Inc. is an American research and advisory firm focusing on business and technology topics. Gartner provides its products and services through research reports, conferences, and consulting. Its clients include large corporations, government agencies, technology companies, and investment firms.",
        "subsidiaries": []
    },
    {
        "name": "GE Aerospace",
        "description": "General Electric Company, doing business as GE Aerospace,[4] is an American aircraft engine supplier that is headquartered in Evendale, Ohio, outside Cincinnati. It is the legal successor to the original General Electric Company founded in 1892, which split into three separate companies between November 2021 and April 2024, adopting the trade name GE Aerospace after divesting its healthcare and energy divisions.[5][6]",
        "subsidiaries": [
            "Avio Aero",
            "CFM International(50%)",
            "Colibrium Additive",
            "Dowty Propellers",
            "Engine Alliance(50%)",
            "GE Aerospace Research",
            "GE Aviation Systems",
            "GE Honda Aero Engines(50%)",
            "Unison Industries",
            "Walter Aircraft Engines"
        ]
    },
    {
        "name": "GE HealthCare",
        "description": "GE Healthcare Technologies, Inc. is an American health technology company based in Chicago, Illinois. The company, which stylizes its own name as GE HealthCare, operates four divisions: Medical imaging, which includes molecular imaging, computed tomography, magnetic resonance, women’s health screening and X-ray systems; Ultrasound; Patient Care Solutions, which is focused on remote patient monitoring, anesthesia and respiratory care, diagnostic cardiology, and infant care; and Pharmaceutical Diagnostics, which manufactures contrast agents and radiopharmaceuticals.[2]",
        "subsidiaries": []
    },
    {
        "name": "GE Vernova",
        "description": "GE Vernova, Inc.[2] is an energy equipment manufacturing and services company headquartered in Cambridge, Massachusetts.[3] The company operates through three main segments: Power, which designs, manufactures, and services gas, nuclear, hydro, and steam technologies; Wind, which provides onshore and offshore wind turbines and blades; and Electrification, which offers grid solutions, power conversion, solar and storage solutions, and digital technologies for the transmission, distribution, and management of electricity.[4][5]",
        "subsidiaries": [
            "GE Vernova Hitachi Nuclear Energy",
            "GE Wind",
            "GE Offshore Wind",
            "LM Wind Power",
            "GE Power Conversion",
            "GE Energy Financial Services"
        ]
    },
    {
        "name": "Gen Digital",
        "description": "Gen Digital Inc. (formerly Symantec Corporation and NortonLifeLock Inc.) is a multinational software company co-headquartered in both Prague, Czech Republic (EU) and Tempe, Arizona (USA). The company provides cybersecurity software, financial technology, and services. Gen is a Fortune 500 company and a member of the S&P 500 stock-market index. It is listed at both NASDAQ and Prague Stock Exchange.[3] Its portfolio includes Norton, Avast, LifeLock, Avira, AVG, ReputationDefender, MoneyLion and CCleaner.[4]",
        "subsidiaries": []
    },
    {
        "name": "Generac",
        "description": "Generac Holdings Inc., commonly referred to as Generac (derived from a combination of generating and AC), is a Fortune 1000 American manufacturer of backup power generation products for residential, light commercial, and industrial markets.[6] Generac's power systems range in output from 800 watts to 9 megawatts[7] and are available through independent dealers, retailers, and wholesalers.[6] Generac has headquarters in Waukesha, Wisconsin,[3][4] and manufacturing facilities in Berlin, Oshkosh, Jefferson, Eagle, and Whitewater, all in Wisconsin.[7]",
        "subsidiaries": []
    },
    {
        "name": "General Dynamics",
        "description": "General Dynamics Corporation (GD) is an American industrial and technology company based in Reston, Virginia. It is primarily a developer and producer of advanced military equipment of a wide variety, such as nuclear submarines, main battle tanks, and armoured fighting vehicles. It is also the manufacturer of the civilian aviation Gulfstream business jets and a provider of information technology services. The company is the 3rd largest of the top 100 contractors of the U.S. federal government; it receives over 3% of total spending by the federal government of the United States on contractors.[3]",
        "subsidiaries": [
            "Bath Iron Works",
            "Electric Boat",
            "General Dynamics Information Technology",
            "General Dynamics Land Systems",
            "General Dynamics Mission Systems",
            "General Dynamics UK",
            "Gulfstream",
            "Jet Aviation",
            "MOWAG",
            "NASSCO"
        ]
    },
    {
        "name": "General Mills",
        "description": "General Mills, Inc. is an American multinational manufacturer and marketer of branded consumer foods sold through retail stores. Founded on the banks of the Mississippi River at Saint Anthony Falls in Minneapolis, the company originally gained fame for being a large flour miller. It is headquartered in Golden Valley, Minnesota, a suburb of Minneapolis.",
        "subsidiaries": []
    },
    {
        "name": "General Motors",
        "description": "General Motors Company (GM)[2] is an American multinational automotive manufacturing company headquartered in Detroit, Michigan, United States.[3] The company is most known for owning and manufacturing four automobile brands: Chevrolet, Buick, GMC, and Cadillac, each a separate division of GM. By total sales, it has continuously been the largest automaker in the United States, and was the largest in the world for 77 years before losing the title to Toyota in 2008.[4][5]",
        "subsidiaries": [
            "GM FinancialGM Insurance",
            "GM Financial",
            "GM Insurance",
            "GM Certified ServiceGM EnergyGM EnvolveOnStar",
            "GM Certified Service",
            "GM Energy",
            "GM Envolve",
            "OnStar",
            "ACDelcoDMAXGM Components HoldingsGM DefenseGM Performance Power UnitsGM Subsystems Manufacturing LLCUltium Cells LLC",
            "ACDelco",
            "DMAX",
            "GM Components Holdings",
            "GM Defense",
            "GM Performance Power Units",
            "GM Subsystems Manufacturing LLC",
            "Ultium Cells LLC",
            "Cadillac EuropeGM ArgentinaGM BrazilGM CanadaGM ChileGM ColombiaGM EgyptGM JapanGM KoreaGM MexicoGM New ZealandGM Specialty Vehicles(GMSV)GM Technical Center KoreaPan Asia Technical Automotive Center(50%)SAIC-GM(50%)SAIC-GM-Wuling(44%)SGMW Motor Indonesia",
            "Cadillac Europe",
            "GM Argentina",
            "GM Brazil",
            "GM Canada",
            "GM Chile",
            "GM Colombia",
            "GM Egypt",
            "GM Japan",
            "GM Korea",
            "GM Mexico",
            "GM New Zealand",
            "GM Specialty Vehicles(GMSV)",
            "GM Technical Center Korea",
            "Pan Asia Technical Automotive Center(50%)",
            "SAIC-GM(50%)",
            "SAIC-GM-Wuling(44%)SGMW Motor Indonesia",
            "SGMW Motor Indonesia"
        ]
    },
    {
        "name": "Genuine Parts Company",
        "description": "Genuine Parts Company (GPC) is an American automotive and industrial parts distributor based in Atlanta, Georgia.[1] Established by brothers Carlyle and Malcolm Fraser in 1928, the company has approximately 60,000 employees.[2] In addition to the United States, GPC has operated in Australasia, Belgium, Canada, France, Germany, Mexico, the Netherlands, Poland, and the United Kingdom. GPC's subsidiaries include industrial parts distributor Motion as well as NAPA Auto Parts, which primarily sells parts in North America.[3]",
        "subsidiaries": []
    },
    {
        "name": "Gilead Sciences",
        "description": "Gilead Sciences, Inc. (/ˈɡɪliəd/) is an American biopharmaceutical company headquartered in Foster City, California, that focuses on researching and developing antiviral drugs used in the treatment of HIV/AIDS, hepatitis B, hepatitis C, influenza, and COVID-19, including ledipasvir/sofosbuvir and sofosbuvir. Gilead is a member of the Nasdaq-100 and the S&P 100.",
        "subsidiaries": []
    },
    {
        "name": "Global Payments",
        "description": "Global Payments Inc. is an American multinational financial technology company that provides payment technology and services to merchants, issuers and consumers.[2] In June 2021, the company was named to the Fortune 500.[3] The company processes payments made through credit cards, debit cards,[4] and digital and contactless payments.[5]",
        "subsidiaries": [
            "TSYS",
            "Heartland Payment Systems"
        ]
    },
    {
        "name": "Globe Life",
        "description": "Globe Life Inc. (GL) is an American financial services holding company listed on the New York Stock Exchange which operates through its wholly owned subsidiaries providing life insurance, annuity, and supplemental health insurance products. The company is based in McKinney, Texas.",
        "subsidiaries": []
    },
    {
        "name": "GoDaddy",
        "description": "GoDaddy Inc. is an American publicly traded Internet domain registry, domain registrar and web hosting company[3] headquartered in Tempe, Arizona, and incorporated under the Delaware General Corporation Law.[4] As of 2023,[update] GoDaddy is the world's fifth largest web host by market share,[5][6] with over 62 million registered domains.[7] The company primarily serves small and micro companies, which make up most of its 20 million customers.[8]",
        "subsidiaries": []
    },
    {
        "name": "Goldman Sachs",
        "description": "The Goldman Sachs Group, Inc. (/sæks/ SAKS) is an American multinational investment bank and financial services company. Founded in 1869, Goldman Sachs is headquartered in Lower Manhattan in New York City, with regional headquarters in many international financial centers.[1] Goldman Sachs is one of the largest investment banks in the world by revenue[2][3] and is ranked 55th on the Fortune 500 list of the largest United States corporations by total revenue.[4] In the Forbes Global 2000 of 2024, Goldman Sachs ranked 23rd.[5] It is considered a systemically important financial institution by the Financial Stability Board.",
        "subsidiaries": [
            "Goldman Sachs Alternatives"
        ]
    },
    {
        "name": "Halliburton",
        "description": "Halliburton Company is an American multinational corporation and the world's second-largest oil service company, responsible for most of the world's fracking operations.[6] The company, incorporated in the United States, has dual headquarters located in Houston and in Dubai.[7][8][9]",
        "subsidiaries": []
    },
    {
        "name": "Hartford (The)",
        "description": "The Hartford Insurance Group, Inc., known as The Hartford, is a U.S.-based insurance company. The Hartford is a Fortune 500 company headquartered in its namesake city of Hartford, Connecticut.[3] It was ranked 162nd in Fortune 500 in 2024.[4] The Hartford is a leader in property and casualty insurance, employee benefits and mutual funds. With more than 200 years of expertise, The Hartford is widely recognized for its service excellence, sustainability practices, trust and integrity. It sells products primarily through a network of agents and brokers, and has also been the auto and home insurance writer for AARP members for more than 40 years.[5][6]",
        "subsidiaries": []
    },
    {
        "name": "Hasbro",
        "description": "Hasbro, Inc. (/ˈhæzbroʊ/; a syllabic abbreviation of its original name, Hassenfeld Brothers) is an American multinational toy manufacturing and entertainment holding company founded on December 6, 1923 by Henry, Hillel and Herman Hassenfeld and is incorporated and headquartered in Pawtucket, Rhode Island.[5] Hasbro owns the trademarks and products of Kenner, Milton Bradley, Parker Brothers, and Wizards of the Coast, among others. As of August 2020, over 81.5% of its shares were held by large financial institutions.[6]",
        "subsidiaries": [
            "Avalon Hill(label)",
            "Wizards of the Coast[4]"
        ]
    },
    {
        "name": "HCA Healthcare",
        "description": "HCA Healthcare, Inc. (historically known as Hospital Corporation of America) is an American global for-profit operator of health care facilities that was founded in 1968. It is based in Nashville, Tennessee, and, as of May 2020, owned and operated 186 hospitals and approximately 2,400 sites of care, including surgery centers, freestanding emergency rooms, urgent care centers and physician clinics in 20 states and the United Kingdom.[5] As of 2024, HCA Healthcare is ranked #61 on the Fortune 500 rankings of the largest United States corporations by total revenue.[6] In the 1990s, the company engaged in illegal accounting and other crimes that resulted in the payment of more than $2 billion in federal fines and other penalties, and the dismissal of the CEO Rick Scott by the board of directors.[7] [dead link]",
        "subsidiaries": []
    },
    {
        "name": "Healthpeak Properties",
        "description": "Healthpeak Properties, Inc. is an American real estate investment trust that invests in real estate related to the healthcare industry including senior housing, life science, and medical offices. It was organized in 2007 in Maryland and headquartered in Denver, Colorado with offices in Irvine, Nashville and San Francisco. As of December 31, 2019, the company owned interests in 617 properties.[2]",
        "subsidiaries": []
    },
    {
        "name": "Henry Schein",
        "description": "Henry Schein, Inc. is an American distributor of health care products and services, with operations in 33 countries and territories.[4][5] It is the world’s largest provider of health care solutions to office-based dental and medical practitioners.[6] For 14 consecutive years, the company has been named as one of the World's Most Ethical Companies by  Ethisphere, most recently in 2025.[7]",
        "subsidiaries": []
    },
    {
        "name": "Hershey Company (The)",
        "description": "The Hershey Company, often called just Hershey or Hershey's, is an American multinational confectionery company headquartered in Hershey, Pennsylvania, which is also home to Hersheypark and Hershey's Chocolate World. The Hershey Company is one of the largest chocolate manufacturers in the world; it also manufactures baked products, such as cookies and cakes, and sells beverages like milkshakes, as well as other products (through mergers and acquisitions). The Hershey Company was founded by Milton S. Hershey in 1894 as the Hershey Chocolate Company, originally established as a subsidiary of his Lancaster Caramel Company. The Hershey Trust Company owns a minority stake but retains a majority of the voting power within the company.[6]",
        "subsidiaries": []
    },
    {
        "name": "Hewlett Packard Enterprise",
        "description": "The Hewlett Packard Enterprise Company (HPE) is an American multinational information technology company based in Spring, Texas. It is a business-focused organization which works in servers, storage, networking, containerization software and consulting and support. HPE was ranked No. 107 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.[2]",
        "subsidiaries": [
            "Aruba Networks",
            "Cray",
            "Juniper Networks",
            "Zerto",
            "Silver Peak Systems",
            "Axis Security",
            "Athonet"
        ]
    },
    {
        "name": "Hilton Worldwide",
        "description": "Hilton Worldwide Holdings Inc. is an American multinational hospitality company that manages and franchises a broad portfolio of hotels, resorts, and timeshare properties. Founded by Conrad Hilton in May 1919, the company is now led by Christopher J. Nassetta. Hilton is headquartered in Tysons, Virginia, United States.",
        "subsidiaries": []
    },
    {
        "name": "Hologic",
        "description": "Hologic, Inc. is an American medical technology company primarily focused on women's health; it sells medical devices for diagnostics, surgery, and medical imaging.[2]",
        "subsidiaries": []
    },
    {
        "name": "Home Depot (The)",
        "description": "The Home Depot, Inc., often referred to as Home Depot, is an American multinational home improvement retail corporation which sells tools, construction products, appliances, and services including fuel and transportation rentals. Home Depot is the largest home improvement retailer in the United States.[4] In 2021, the company had 490,600 employees and more than $151 billion in revenue. The company is headquartered in Cobb County, Georgia,[5] with an Atlanta mailing address.[6]",
        "subsidiaries": [
            "The Home Depot Pro",
            "HD Supply",
            "SRS Distribution[1]"
        ]
    },
    {
        "name": "Honeywell",
        "description": "Honeywell International Inc. is an American publicly traded, multinational conglomerate corporation headquartered in Charlotte, North Carolina. It primarily operates in four areas of business: aerospace, building automation, industrial automation, and energy and sustainability solutions (ESS).[2] Honeywell also owns and operates Sandia National Laboratories under contract with the U.S. Department of Energy. Honeywell is a Fortune 500 company, ranked 115th in 2023.[3] In 2024, the corporation had a global workforce of approximately 102,000 employees.[1][4] As of 2025, its chairman and chief executive officer was Vimal Kapur.[5]",
        "subsidiaries": [
            "Honeywell Aerospace",
            "Honeywell Automation India",
            "Intermec",
            "RAE Systems",
            "Honeywell UOP",
            "Tridium"
        ]
    },
    {
        "name": "Hormel Foods",
        "description": "Hormel Foods Corporation, doing business as Hormel Foods or simply Hormel, is an American multinational food processing company founded in 1891 in Austin, Minnesota, by George A. Hormel as George A. Hormel & Company. The company originally focused on the packaging and selling of ham, sausage and other pork, chicken, beef and lamb products to consumers, adding Spam in 1937. By the 1980s, Hormel began offering a wider range of packaged and refrigerated foods. The company changed its name to Hormel Foods Corporation in 1993 and uses the Hormel brand on many of its products; the company's other brands include Planters, Columbus Craft Meats, Dinty Moore, Jennie-O, and Skippy. The company's products are available in over 80 countries.",
        "subsidiaries": [
            "Applegate Farms, LLC",
            "Beijing Hormel Co. Ltd.",
            "Bruke Marketing Corporation",
            "Cidade do Sol",
            "Columbus Manufacturing Inc.",
            "Dan's Prize Inc.",
            "Fontanini Foods",
            "Hormel Foods Australia Pty. Ltd.",
            "Hormel Foods Canada",
            "Jennie-O",
            "Justin's, LLC",
            "Megamex Foods, LLC[a]",
            "Okinawa Hormel Ltd.",
            "The Purefoods-Hormel Company Inc.[b]",
            "Sadler's Smokehouse"
        ]
    },
    {
        "name": "Host Hotels & Resorts",
        "description": "Host Hotels & Resorts, Inc., based in Bethesda, Maryland, is an American real estate investment trust that invests in hotels. As of December 31, 2024, the company owned 81 upscale hotels containing about 43,400 rooms in the United States, Brazil, and Canada.[1]",
        "subsidiaries": []
    },
    {
        "name": "Howmet Aerospace",
        "description": "Howmet Aerospace Inc. is an American aerospace company based in Pittsburgh, Pennsylvania. The company manufactures components for jet engines, fasteners, titanium structures for aerospace applications, and forged aluminum wheels for heavy trucks.[2]",
        "subsidiaries": []
    },
    {
        "name": "HP Inc.",
        "description": "HP Inc. is an American multinational information technology company with its headquarters in Palo Alto, California, that develops personal computers (PCs), printers and related supplies, as well as 3D printing services. It is the world's second-largest personal computer vendor by unit sales after Lenovo and ahead of Dell as of 2024[update].[2]",
        "subsidiaries": []
    },
    {
        "name": "Hubbell Incorporated",
        "description": "Hubbell Incorporated, headquartered in Shelton, Connecticut, is an American company that designs, manufactures, and sells electrical and electronic products for non-residential and residential construction, industrial, and utility applications. Hubbell was founded by Harvey Hubbell as a proprietorship in 1888, and was incorporated in Connecticut in 1905.",
        "subsidiaries": []
    },
    {
        "name": "Humana",
        "description": "Humana Inc. doing business as Humana,[2] is an American for-profit health insurance company based in Louisville, Kentucky. In 2024, the company ranked 92 on the Fortune 500 list,[3] which made it the highest ranked (by revenues) company based in Kentucky.[citation needed] It is the fourth largest health insurance provider in the U.S.[4]",
        "subsidiaries": []
    },
    {
        "name": "Huntington Bancshares",
        "description": "Huntington Bancshares Incorporated is an American bank holding company headquartered in Columbus, Ohio. Its banking subsidiary, The Huntington National Bank, operates 1,047 banking offices, primarily in the Midwest: 459 in Ohio, 290 in Michigan, 80 in Minnesota, 51 in Pennsylvania, 45 in Indiana, 35 in Illinois, 32 in Colorado, 29 in West Virginia, 16 in Wisconsin, 10 in Kentucky, and one in North Carolina.[4][5][6][7]",
        "subsidiaries": []
    },
    {
        "name": "Huntington Ingalls Industries",
        "description": "Huntington Ingalls Industries, Inc. (HII) is the largest military shipbuilding company in the United States as well as a provider of professional services to partners in government and industry. HII was formed on 31 March 2011, as a divestiture from  Northrop Grumman.[5][6]",
        "subsidiaries": []
    },
    {
        "name": "IBM",
        "description": "International Business Machines Corporation, doing business as IBM (nicknamed Big Blue),[6] is an American multinational technology company headquartered in Armonk, New York, and present in over 175 countries.[7][8] It is a publicly traded company and one of the 30 companies in the Dow Jones Industrial Average.[a][9][10] IBM is the largest industrial research organization in the world, with 19 research facilities across a dozen countries; for 29 consecutive years, from 1993 to 2021, it held the record for most annual U.S. patents generated by a business.",
        "subsidiaries": []
    },
    {
        "name": "IDEX Corporation",
        "description": "IDEX Corporation is a global industrial company based in Northbrook, Illinois. IDEX develops, designs, and manufactures fluidics systems, optics systems, fire and rescue equipment, and other specialty engineered products. As of February 2025, IDEX operated in approximately 20 countries and had approximately employed 9,000 employees. The company is publicly traded and a component of the S&P 500 index.",
        "subsidiaries": [
            "Airtech Group",
            "Upchurch Scientific",
            "Akron Brass",
            "Hale Products Inc",
            "Godiva Fire Pumps",
            "Viking Pump",
            "Quadro Engineering",
            "Semrock",
            "Liquid Controls",
            "Warren Rupp",
            "Microfluidics International Corporation (MFIC)",
            "Advanced Thin Films",
            "Rheodyne",
            "Band It",
            "Pulsafeeder",
            "Banjo Corporation",
            "Material Processing Technologies (MPT)",
            "Abel Pumps",
            "Precision Polymer Engineering (PPE)",
            "Faure Herman",
            "Gast Manufacturing",
            "ADS Environment",
            "Toptech Systems",
            "Trebor International",
            "CIDRA Precision",
            "Knight",
            "Phantom Controls",
            "Wright Flow Technologies",
            "Pumper Parts",
            "Versa-Matic Pump",
            "Flow Management Devices LLC.",
            "Signfix",
            "Richter",
            "LouwersHanique",
            "Veco",
            "Millux",
            "Wincan",
            "Tecan",
            "Atul"
        ]
    },
    {
        "name": "Idexx Laboratories",
        "description": "IDEXX Laboratories, Inc. is an American multinational corporation[3][4] engaged in the development, manufacture, and distribution of products and services for the companion animal veterinary, livestock and poultry, water testing, and dairy markets. Incorporated in 1983 by David Evans Shaw, the company is headquartered in Westbrook, Maine, and in Hoofddorp, Netherlands for its EMEA divisions.[5]",
        "subsidiaries": []
    },
    {
        "name": "Illinois Tool Works",
        "description": "Illinois Tool Works Inc. (ITW) is an American Fortune 500[2] company that produces engineered fasteners and components, equipment and consumable systems, and specialty products. It was founded in 1912 by Byron L. Smith and has built its growth on a \"small-wins strategy\" based on decentralization, simplicity, customer-focused innovation, and acquisitions.[3]",
        "subsidiaries": []
    },
    {
        "name": "Incyte",
        "description": "Incyte Corporation is an American multinational pharmaceutical company with headquarters in Wilmington, Delaware.[2] The company currently operates manufacturing and R&D locations in North America, Europe, and Asia.[3]",
        "subsidiaries": []
    },
    {
        "name": "Ingersoll Rand",
        "description": "Ingersoll Rand Inc. is an American multinational company that provides flow creation and industrial products. The company was formed in February 2020 through the spinoff of the industrial segment of Ingersoll-Rand plc (now known as Trane Technologies) and its merger with Gardner Denver. Its products are sold under more than 40 brands across all major global markets.",
        "subsidiaries": []
    },
    {
        "name": "Insulet Corporation",
        "description": "",
        "subsidiaries": []
    },
    {
        "name": "Intel",
        "description": "Intel Corporation is an American multinational technology company headquartered in Santa Clara, California. It designs, manufactures, and sells computer components such as central processing units (CPUs) and related products for business and consumer markets. Intel was the world's third-largest semiconductor chip manufacturer by revenue in 2024 and has been included in the Fortune 500 list of the largest United States corporations by revenue since 2007. It was one of the first companies listed on Nasdaq.",
        "subsidiaries": [
            "Mobileye(94.2%)",
            "Intel Ireland"
        ]
    },
    {
        "name": "Interactive Brokers",
        "description": "Interactive Brokers, Inc. (abbreviated as IB or IBKR) is an American multinational brokerage firm headquartered in Greenwich, Connecticut. It operates the largest electronic trading platform in the United States by number of daily average revenue trades. In 2024, the platform processed an average of 2.6 million trades per trading day.[1] Interactive Brokers is the largest foreign exchange market broker[2] and is one of the largest prime brokers servicing commodity brokers. The company brokers stocks, options, futures contracts, exchange of futures for physicals, options on futures, bonds, mutual funds, currency, cryptocurrency, contracts for difference, derivatives, and trading in prediction markets. Interactive Brokers offers direct market access, omnibus and non-disclosed broker accounts, and provides clearing services. The firm has operations in 36 countries and 28 currencies. As of December 31, 2024, it had 3.337 million institutional and individual brokerage customers, with total customer equity of US$568.2 billion.[1] In addition to its headquarters in Greenwich, on the Gold Coast of Connecticut, the company has offices in major financial centers worldwide. More than half of the company's customers reside outside the United States, in approximately 200 countries.[1]: 15",
        "subsidiaries": []
    },
    {
        "name": "Intercontinental Exchange",
        "description": "Intercontinental Exchange, Inc. (ICE) is an American multinational financial services company formed in 2000 that operates global financial exchanges and clearing houses and provides mortgage technology, data and listing services. Listed on the Fortune 500, S&P 500, and Russell 1000, the company owns exchanges for financial and commodity markets, and operates 12 regulated exchanges and marketplaces.  This includes ICE futures exchanges in the United States, Canada, and Europe; the Liffe futures exchanges in Europe; the New York Stock Exchange, the world's largest stock exchange in terms of total market capitalization of its listed companies; equity options exchanges; and OTC energy, credit, and equity markets.",
        "subsidiaries": []
    },
    {
        "name": "International Flavors & Fragrances",
        "description": "International Flavors & Fragrances Inc. (IFF) is an American corporation that creates products across taste, texture, scent, nutrition, enzymes, cultures, soy proteins, and probiotics categories, which it markets globally. It is headquartered in New York City and has creative, sales, and manufacturing facilities in 44 countries. The company is a member of the S&P 500 index.",
        "subsidiaries": []
    },
    {
        "name": "International Paper",
        "description": "The International Paper Company is an American pulp and paper company, the largest such company in the world.[2] It has approximately 39,000 employees,[3] and is headquartered in Memphis, Tennessee.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Intuit",
        "description": "Intuit Inc. is an American multinational business software company that specializes in financial software. Headquartered in Mountain View, California, the company is led by CEO Sasan Goodarzi. Intuit's products include the tax preparation application TurboTax, the small business accounting software QuickBooks, the credit monitoring and personal finance service Credit Karma,[2] and the email marketing platform Mailchimp.[3] As of 2019,[update] more than 95% of its revenue and earnings originated from its operations within the United States.[4] Intuit is listed on the Nasdaq stock exchange and is a component of the Nasdaq-100, S&P 100, and S&P 500 stock market indices.",
        "subsidiaries": []
    },
    {
        "name": "Intuitive Surgical",
        "description": "Intuitive Surgical, Inc. is an American biotechnology company that develops, manufactures, and markets robotic products designed to improve clinical outcomes of patients through minimally invasive surgery, most notably with the da Vinci Surgical System.  The company is part of the Nasdaq-100, S&P 100 and S&P 500. As of 31 December 2021[update], Intuitive Surgical had an installed base of 6,730 da Vinci Surgical Systems, including 4,139 in the U.S., 1,199 in Europe, 1,050 in Asia, and 342 in the rest of the world.[2]",
        "subsidiaries": []
    },
    {
        "name": "Invesco",
        "description": "Invesco Ltd. is an American (formerly British) independent investment management company headquartered in Atlanta, Georgia, with branch offices in 20 countries. Its common stock is a constituent of the S&P 500 and trades on the New York Stock Exchange.[3] Invesco operates under the Invesco, Invesco Perpetual, and Powershares brand names.",
        "subsidiaries": [
            "Invesco Perpetual",
            "Invesco PowerShares"
        ]
    },
    {
        "name": "Invitation Homes",
        "description": "Invitation Homes Inc. is a public company traded on the New York Stock Exchange. It is headquartered in the Lincoln Center building in Dallas, Texas.[2] Dallas B. Tanner is chief executive officer. As of 2017, the company was reportedly the largest owner of single-family rental homes in the United States.[2] As of July 2024, the company owned about 84,000 rental homes in 16 markets.[3] Seventeen percent of their rental income is from California.[4]",
        "subsidiaries": []
    },
    {
        "name": "IQVIA",
        "description": "IQVIA Holdings, Inc., headquartered in Durham, North Carolina, is an American company focused on health information technology and clinical research.",
        "subsidiaries": []
    },
    {
        "name": "Iron Mountain",
        "description": "Iron Mountain Inc. is an American enterprise information management services company founded in 1951 and headquartered in Portsmouth, New Hampshire. Its records management, information destruction, and data backup and recovery services are supplied to more than 220,000 customers[2] in 58 countries throughout North America, Europe, Latin America, Africa, Asia, and Oceania.",
        "subsidiaries": []
    },
    {
        "name": "J.B. Hunt",
        "description": "J.B. Hunt Transport Services, Inc. is an American transportation and logistics company based in Lowell, Arkansas. It was founded by Johnnie Bryan Hunt and Johnelle Hunt in Arkansas on August 10, 1961. By 1983, J.B. Hunt had grown into the 80th largest trucking firm in the US, with $623.47 million in revenue. At that time J.B. Hunt operated 550 tractors, 1,049 trailers, and had roughly 1,050 employees.[3] J.B. Hunt primarily operates semi-trailer trucks and provides transportation services throughout the continental US, Canada and Mexico. The company's fleet consists of over 12,000 trucks and 145,000 trailers and containers.[4]",
        "subsidiaries": []
    },
    {
        "name": "Jabil",
        "description": "Jabil Inc. is an American multinational manufacturing company involved in the design, engineering, and manufacturing of electronic circuit board assemblies and systems, along with supply chain services, primarily serving original equipment manufacturers.[5][6] It is headquartered in the Gateway area of St. Petersburg, Florida. It is one of the largest companies in the Tampa Bay area.[7][8]",
        "subsidiaries": []
    },
    {
        "name": "Jack Henry & Associates",
        "description": "Jack Henry and Associates, also known as Jack Henry is an American company founded in 1976 and devoted to financial technology and payment processing services, mostly for community banks and credit unions.[2]  They assist regional banks and credit unions to control risk, make regulatory filings and add or improve their online banking services.[3] Jack Henry stock trades on the NASDAQ exchange under the symbol JKHY, and is also part of the S&P 400 for mid-size American companies.",
        "subsidiaries": []
    },
    {
        "name": "Jacobs Solutions",
        "description": "Jacobs Solutions Inc. is an American international technical professional services firm based in Dallas.[2][3] The company provides engineering, technical, professional, and construction services as well as scientific and specialty consulting for a broad range of clients globally, including companies, organizations, and government agencies.[4] Jacobs has consistently ranked No. 1 on both Engineering News-Record (ENR)'s 2018, 2019, 2020, 2021, 2022, and 2023 Top 500 Design Firms[5] and Trenchless Technology’s 2018, 2019, 2020, and 2021 Top 50 Trenchless Engineering Firms.[6] Its worldwide annual revenue were over $12 billion in the 2025 fiscal year, and earnings dropped to $289 million.[1]: F-4",
        "subsidiaries": [
            "CH2M",
            "The KeyW Corporation",
            "Sverdrup Corporation",
            "The Buffalo Group",
            "Gibb",
            "Halcrow Group",
            "Babtie, Shaw and Morton",
            "Leighfisher",
            "KlingStubbins",
            "Simetrica",
            "Federal Network Systems",
            "Edwards & Kelcey",
            "Aquenta Consulting",
            "Bechtel Jacobs",
            "FMHC Corporation"
        ]
    },
    {
        "name": "Johnson & Johnson",
        "description": "Johnson & Johnson (J&J) is an American multinational pharmaceutical, biotechnology, and medical technologies corporation headquartered in New Brunswick, New Jersey, and publicly traded on the New York Stock Exchange. Its common stock is a component of the Dow Jones Industrial Average, and the company is ranked No. 48 on the 2025 Fortune 500 list of the largest United States corporations.[2] In 2025, the company was ranked 42th in the Forbes Global 2000.[3] Johnson & Johnson has a global workforce of approximately 138,000 employees who are led by the company's current chairman and chief executive officer, Joaquin Duato. Johnson & Johnson is one of the world's most valuable companies and is one of only two U.S.-based companies that has a prime credit rating of AAA.[4]",
        "subsidiaries": [
            "Johnson & Johnson Pharmaceutical Research and DevelopmentActelion PharmaceuticalsCilagJanssen BiologicsJanssen Global ServicesJanssen TherapeuticsJanssen Vaccines & PreventionMomenta Pharmaceuticals",
            "Actelion Pharmaceuticals",
            "Cilag",
            "Janssen Biologics",
            "Janssen Global Services",
            "Janssen Therapeutics",
            "Janssen Vaccines & Prevention",
            "Momenta Pharmaceuticals",
            "Johnson & Johnson MedTechAbiomedAcclarentBiosense WebsterCerenovusDePuy SynthesEthiconJohnson & Johnson VisionMentorSynthesV-WaveShockwave Medical",
            "Abiomed",
            "Acclarent",
            "Biosense Webster",
            "Cerenovus",
            "DePuy Synthes",
            "Ethicon",
            "Johnson & Johnson Vision",
            "Mentor",
            "Synthes",
            "V-Wave",
            "Shockwave Medical",
            "Johnson & Johnson Services"
        ]
    },
    {
        "name": "Johnson Controls",
        "description": "Johnson Controls International plc is an American-Irish multinational conglomerate headquartered in Cork, Ireland,[3] that produces fire, HVAC, and security equipment for buildings. As of mid-2019, it employed 105,000 people in around 2,000 locations across six continents.[4] In 2017 it was listed as 389th in the Fortune Global 500.[5] It became ineligible for the Fortune 500 in subsequent years since it relocated its headquarters outside the U.S.[6]",
        "subsidiaries": []
    },
    {
        "name": "JPMorgan Chase",
        "description": "JPMorgan Chase & Co. (stylized as JPMorganChase) is an American multinational banking institution headquartered in New York City and incorporated in Delaware. It is the largest bank in the United States, and the world's largest bank by market capitalization as of 2025.[3][4] As the largest of the Big Four banks in America, the firm is considered systemically important by the Financial Stability Board. Its size and scale have often led to enhanced regulatory oversight as well as the development of an internal \"Fortress Balance Sheet\".[5][6] The firm has had its global headquarters on 270 Park Avenue in Midtown Manhattan since 2025.[7]",
        "subsidiaries": [
            "Chase Bank",
            "Chase UK",
            "J.P. Morgan & Co.",
            "One Equity Partners"
        ]
    },
    {
        "name": "Kenvue",
        "description": "Kenvue Inc. is an American consumer health company. Formerly the Consumer Healthcare division of Johnson & Johnson,[3] Kenvue owns well-known brands such as Aveeno,[4] Band-Aid,[5] Benadryl, Combantrin, Zyrtec,[6] Johnson's,[7] Listerine, Lactaid,[8] Mylanta, Neutrogena,[4] Trosyd, Calpol, Tylenol,[8] and Visine. Kenvue is incorporated in Delaware[1] and was originally headquartered in the Skillman section of Montgomery Township, New Jersey, before relocating to Summit, New Jersey.[9]",
        "subsidiaries": []
    },
    {
        "name": "Keurig Dr Pepper",
        "description": "Keurig Dr Pepper Inc.[a] is a publicly traded American beverage and coffeemaker conglomerate with headquarters located in Burlington, Massachusetts, and Frisco, Texas.[6] Formed in July 2018, with the merger of Keurig Green Mountain and Dr Pepper Snapple Group (formerly Dr Pepper/7up Inc.), Keurig Dr Pepper produces and distributes more than 125 hot and cold beverages. The company's Canadian business unit subsidiary operates as Keurig Dr Pepper Canada (formerly Canada Dry Motts).",
        "subsidiaries": []
    },
    {
        "name": "KeyCorp",
        "description": "KeyBank is an American regional bank headquartered in Cleveland, Ohio, and the 27th largest bank in the United States. Organized under the publicly traded KeyCorp, KeyBank was formed from the 1994 merger of the Cleveland-based Society Corporation, which operated Society National Bank, and the Albany-headquartered KeyCorp. The company today operates nearly 1,000 branches and over 1,200 ATMs, mostly concentrated in the Midwest and Northeast United States, though also operates in the Pacific Northwest as well as in Alaska, Colorado, Texas and Utah.[1][3]",
        "subsidiaries": []
    },
    {
        "name": "Keysight Technologies",
        "description": "Keysight Technologies, Inc. is an American company that manufactures electronics test and measurement equipment and software. The company was formed as a spin-off of Agilent Technologies, which inherited and rebranded the test and measurement product lines developed and produced, from the late 1960s to the turn of the millennium, by Hewlett-Packard's Test and Measurement division. Its name is a portmanteau of key and insight.[2][4]",
        "subsidiaries": []
    },
    {
        "name": "Kimberly-Clark",
        "description": "Kimberly-Clark Corporation is an American multinational consumer goods and personal care corporation that produces mostly paper-based consumer products. The company manufactures sanitary paper products and surgical & medical instruments. Kimberly-Clark brand name products include Kleenex facial tissue, Kotex feminine hygiene products, Cottonelle, Scott and Andrex toilet paper, Wypall utility wipes, KimWipes scientific cleaning wipes and Huggies disposable diapers and baby wipes.",
        "subsidiaries": []
    },
    {
        "name": "Kimco Realty",
        "description": "Kimco Realty Corporation, headquartered in Jericho, New York, is a real estate investment trust that invests in shopping centers.",
        "subsidiaries": []
    },
    {
        "name": "Kinder Morgan",
        "description": "Kinder Morgan, Inc. is one of the largest energy infrastructure companies in North America.[2]  The company specializes in owning and controlling oil and gas pipelines and terminals.[3]",
        "subsidiaries": []
    },
    {
        "name": "KKR & Co.",
        "description": "KKR & Co. Inc., also known as Kohlberg Kravis Roberts & Co., is an American global private equity and investment company. As of December 31, 2024[update], the firm had completed 770 private-equity investments with approximately $790 billion of total enterprise value.[1] Its assets under management (AUM) and fee paying assets under management (FPAUM) were $553 billion and $446 billion, respectively.[1]: 167",
        "subsidiaries": []
    },
    {
        "name": "KLA Corporation",
        "description": "KLA Corporation is an American company based in Milpitas, California that makes wafer fab equipment. It supplies process control and yield management systems for the semiconductor industry and other related nanoelectronics industries. The company's products and services are intended for all phases of wafer, reticle, integrated circuit (IC) and packaging production, from research and development to final volume manufacturing.[2]",
        "subsidiaries": []
    },
    {
        "name": "Kraft Heinz",
        "description": "The Kraft Heinz Company (KHC), commonly known as Kraft Heinz (/ˈkræft ˈhaɪnz/), is an American multinational food company formed by the merger of Kraft Foods Group, Inc. and the H.J. Heinz Company co-headquartered in Chicago and Pittsburgh.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Kroger",
        "description": "The Kroger Co., or simply Kroger, is an American retail corporation headquartered in Cincinnati, Ohio.[5] It operates (either directly or through its subsidiaries[6]) supermarkets and multi-department stores throughout the United States.[1][7]",
        "subsidiaries": []
    },
    {
        "name": "L3Harris",
        "description": "L3Harris Technologies, Inc. is an American technology company, defense contractor, and information technology services provider that produces products for command and control systems, wireless equipment, tactical radios, avionics and electronic systems, night vision equipment, intelligence, surveillance and reconnaissance (C3ISR) systems and products, ocean systems, instrumentation, navigation products, training devices and services, and both terrestrial/spaceborne antennas for use in the government, defense, and commercial sectors.",
        "subsidiaries": []
    },
    {
        "name": "Labcorp",
        "description": "Labcorp Holdings Inc., operating under the brand name Labcorp, headquartered in Burlington, North Carolina, provides laboratory services used for diagnosis and healthcare decisions.[1] It operates one of the largest clinical laboratory networks in the world and has operations in over 100 countries; although its operations are primarily in the U.S.[1]",
        "subsidiaries": []
    },
    {
        "name": "Lam Research",
        "description": "Lam Research Corporation is an American supplier of wafer-fabrication equipment and related services to the semiconductor industry.[2] Its products are used primarily in front-end wafer processing, which involves the steps that create the active components of semiconductor devices (transistors, capacitors) and their wiring (interconnects). The company also builds equipment for back-end wafer-level packaging (WLP) and for related manufacturing markets such as for microelectromechanical systems (MEMS).",
        "subsidiaries": []
    },
    {
        "name": "Lamb Weston",
        "description": "Lamb Weston Holdings, Inc. is an American food processing company that is one of the world's largest producers and processors of frozen french fries, waffle fries, and other frozen potato products.[2][3][4]  It is headquartered in Eagle, Idaho, a suburb of Boise.[5]",
        "subsidiaries": []
    },
    {
        "name": "Las Vegas Sands",
        "description": "Las Vegas Sands Corp. is an American casino and resort company with corporate headquarters in Las Vegas, Nevada. It was founded by Sheldon G. Adelson and his partners out of the Sands Hotel and Casino on the Las Vegas Strip. The Sands was demolished and redeveloped as The Venetian, opening in 1999. An adjacent resort, The Palazzo, opened in 2007. Both resorts were sold in 2022.",
        "subsidiaries": []
    },
    {
        "name": "Leidos",
        "description": "Leidos Holdings, Inc. is an American defense, aviation, information technology, and biomedical research company headquartered in Reston, Virginia, that provides scientific, engineering, systems integration, and technical services. Founded as Science Applications International Corporation (SAIC),[6] Leidos merged with Lockheed Martin's IT sector, Information Systems & Global Solutions (Lockheed Martin IS&GS), in August 2016 to create the defense industry’s largest IT services provider. The Leidos-Lockheed Martin merger is one of the biggest transactions thus far in the consolidation of the defense sector. Leidos contracts extensively with the Department of Defense, the Department of Homeland Security, and the Intelligence Community, as well as other U.S. government agencies and select commercial markets.",
        "subsidiaries": []
    },
    {
        "name": "Lennar",
        "description": "Lennar Corporation is an American home construction company based in Miami-Dade County, Florida.[1] As of 2025, it is the second-largest home construction company in the United States based on the number of homes sold.[2] Lennar has investments in multifamily and single-family residential rental properties, luxury development, property technology with LenX, and mortgage lending from Lennar Mortgage.",
        "subsidiaries": []
    },
    {
        "name": "Lennox International",
        "description": "Lennox International Inc. is an American provider of climate control products for the heating, ventilation, and air conditioning (HVAC) and refrigeration markets.[1] Based in Richardson, Texas, the company is 9.8% owned by John W. Norris, III, a descendant of DW Norris, who acquired the company in 1904. The company's largest production facilities are in Saltillo, Mexico, Marshalltown, Iowa, and Orangeburg, South Carolina.[1]",
        "subsidiaries": []
    },
    {
        "name": "Lilly (Eli)",
        "description": "Eli Lilly and Company, doing business as Lilly, is an American multinational pharmaceutical company headquartered in Indianapolis, Indiana, with offices in 18 countries. Its products are sold in approximately 125 countries. The company was founded in 1876 by Eli Lilly, a pharmaceutical chemist and Union army veteran during the American Civil War for whom the company was later named.",
        "subsidiaries": []
    },
    {
        "name": "Linde plc",
        "description": "Linde is a global multinational chemical company and the world's largest industrial gas supplier by market share and revenue. Founded by German scientist and engineer Carl von Linde in 1879 in Wiesbaden, Germany,[3] the company is now headquartered in Woking, United Kingdom, and registered in Ireland as Linde plc.[4] Linde plc was formed in 2018 through the merger of Linde AG and Praxair, which was founded in 1907 in the United States as Linde Air Products Company.",
        "subsidiaries": []
    },
    {
        "name": "Live Nation Entertainment",
        "description": "Live Nation Entertainment, Inc. is an American multinational entertainment company that was founded in 2010 following the merger of Live Nation and Ticketmaster. It continues to operate both brands as subsidiary companies, promoting and managing ticket sales for live entertainment internationally. It also owns and operates entertainment venues and manages the careers of music artists.",
        "subsidiaries": [
            "Ticketmaster",
            "Live Nation Concerts",
            "Front Line Management Group",
            "Live Nation Network",
            "C3 Presents",
            "AC Entertainment",
            "Live Nation Merchandise",
            "Live Nation Tero"
        ]
    },
    {
        "name": "Lockheed Martin",
        "description": "The Lockheed Martin Corporation is an American defense and aerospace manufacturer. It is headquartered in North Bethesda, Maryland, United States. The company was formed by the merger of Lockheed Corporation with Martin Marietta on March 15, 1995.",
        "subsidiaries": []
    },
    {
        "name": "Loews Corporation",
        "description": "Loews Corporation is an American conglomerate headquartered in New York City. The company's majority-stake holdings include CNA Financial Corporation, Boardwalk Pipeline Partners, Loews Hotels and Altium Packaging.",
        "subsidiaries": [
            "Altium Packaging (99%)",
            "Boardwalk Pipelines",
            "CNA Financial(89%)",
            "Loews Hotels"
        ]
    },
    {
        "name": "Lowe's",
        "description": "Lowe's Companies, Inc. (/loʊz/ LOHZ) is an American retail company specializing in home improvement.[4] Headquartered in Mooresville, North Carolina, the company operates a chain of retail stores in the United States. As of October 28, 2022, Lowe's and its related businesses operated 2,181 home improvement and hardware stores in North America.[5]",
        "subsidiaries": [
            "Lowe’s Pro Supply",
            "Artisan Design Group",
            "Foundation Building Materials"
        ]
    },
    {
        "name": "Lululemon Athletica",
        "description": "Lululemon, commonly styled as lululemon (/ˌluːluˈlɛmən/ ⓘ loo-loo-LEM-ən; all lowercase[2]), is an American-Canadian[4][5] multinational athletic apparel retailer headquartered in Vancouver, British Columbia, and incorporated in Delaware, United States, as Lululemon Athletica Inc. It was founded in 1998 as a retailer of yoga pants and other yoga wear, and has expanded to also sell sportswear, lifestyle apparel, accessories and personal care products. The company has 767 stores (as of fiscal year 2024[update]) and also processes sales online through its website.[6]",
        "subsidiaries": []
    },
    {
        "name": "LyondellBasell",
        "description": "LyondellBasell Industries N.V. is an American multinational chemical company, incorporated in the Netherlands with U.S. operations headquartered in Houston, Texas and offices in London, UK.  The company is the largest licensor of polyethylene and polypropylene technologies.[3] It also produces ethylene, propylene, polyolefins, and oxyfuels.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "M&T Bank",
        "description": "M&T Bank Corporation (Manufacturers and Traders Trust Company) is an American bank holding company headquartered in Buffalo, New York.[3] It operates 950+ branches in 12 states and Washington D.C. across the Eastern United States, from Maine to Virginia.[2][4] Until May 1998, the bank's holding company was named First Empire State Corporation.[5]",
        "subsidiaries": [
            "Wilmington Trust"
        ]
    },
    {
        "name": "Marathon Petroleum",
        "description": "Marathon Petroleum Corporation is an American petroleum refining, marketing, and transportation company headquartered in Findlay, Ohio. The company was a wholly owned subsidiary of Marathon Oil until a corporate spin-off in 2011.",
        "subsidiaries": []
    },
    {
        "name": "Marriott International",
        "description": "Marriott International, Inc. is an American multinational company that operates, franchises, and licenses lodging brands that include hotel, residential, and timeshare properties.[1][2] Marriott International owns over 37 hotel and timeshare brands with 9,000 locations and 1,597,380 rooms across its network (as of 2023).[3] Marriott International is headquartered in Bethesda, Maryland. The company is the successor to the hospitality division of the Marriott Corporation, founded by J. Willard Marriott (1900–1985) and his wife Alice Marriott (1907–2000).",
        "subsidiaries": [
            "Marriott Hotels & Resorts",
            "The Ritz-Carlton Hotel Company",
            "Le Méridien",
            "Sheraton Hotels and Resorts",
            "Westin Hotels & Resorts"
        ]
    },
    {
        "name": "Marsh McLennan",
        "description": "Marsh & McLennan Companies, Inc., doing business as Marsh McLennan and Marsh, is a global professional services firm, headquartered in New York City with businesses in insurance brokerage, risk management, reinsurance services, talent management, investment advisory, and management consulting. Its four main operating companies are Marsh (53% of 2024 revenues), which offers risk management, insurance broking, insurance program management, risk consulting, analytical modeling and alternative risk financing services; Marsh Re (formerly Guy Carpenter; 10% of 2024 revenues), a reinsurance intermediary and advisor; Mercer (23% of 2024 revenues), which provides consulting to employers for health insurance, retirement plans, and pension plans; and  Oliver Wyman; 14% of 2024 revenues, including Lippincott and NERA Economic Consulting, which provides consulting services.[1] In 2024, Risk and Insurance Services contributed a total of 63% of revenues and 71% of operating profit, while Consulting contributed 37% of revenues and 29% of operating profit.[1]",
        "subsidiaries": [
            "Marsh",
            "Guy Carpenter",
            "Mercer",
            "Oliver Wyman"
        ]
    },
    {
        "name": "Martin Marietta Materials",
        "description": "Martin Marietta Materials, Inc. is an American company and a supplier of aggregates and heavy building materials, with operations spanning 26 states, Canada, and the Caribbean. In particular, Martin Marietta Materials supplies resources for the construction of roads, sidewalks, and foundations.",
        "subsidiaries": []
    },
    {
        "name": "Masco",
        "description": "Masco Corporation is an American manufacturer of products for the home improvement and new home construction markets. Comprising more than 20 companies, the Masco conglomerate operates nearly 60 manufacturing facilities in the United States and over 20 in other parts of the world. Since 1969 it trades on the NYSE.[3] Under the leadership of Richard Manoogian, the company grew exponentially and subsequently joined the Fortune 500 list of largest U.S. corporations.[3]",
        "subsidiaries": []
    },
    {
        "name": "Mastercard",
        "description": "Mastercard Inc. (stylized as MasterCard from 1979 to 2016 and as mastercard from 2016 to 2019) is an American multinational payment card services corporation headquartered in Purchase, New York.[5] It offers a range of payment transaction processing and other related-payment services (such as travel-related payments and bookings). Throughout the world, its principal business is to process payments between the banks of merchants and the card-issuing banks or credit unions of the purchasers who use the Mastercard-brand debit, credit and prepaid cards to make purchases. Mastercard has been publicly traded since 2006.",
        "subsidiaries": []
    },
    {
        "name": "Match Group",
        "description": "Match Group, Inc. is an American internet and technology company headquartered in Dallas, Texas.[2] It owns and operates the largest global portfolio of popular online dating services including Tinder, Match.com, Meetic, OkCupid, Hinge, Plenty of Fish, Azar, and other dating global brands.[3][4] The company was owned by IAC until July 2020 when Match Group was spun off as a separate, public company. As of 2019[update], the company had 9.3 million subscribers, of which 4.6 million were in North America.[5] Japan is the company's second largest market, after the United States.[6]",
        "subsidiaries": []
    },
    {
        "name": "McCormick & Company",
        "description": "McCormick & Company, Incorporated is an American food company that manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavoring products to retail outlets, food manufacturers, and food service businesses.",
        "subsidiaries": []
    },
    {
        "name": "McDonald's",
        "description": "McDonald's Corporation, doing business as McDonald's, is an American multinational fast food restaurant chain. As of 2024, it is the second-largest by number of locations in the world, behind the Chinese chain Mixue Ice Cream & Tea.[9]",
        "subsidiaries": []
    },
    {
        "name": "McKesson Corporation",
        "description": "McKesson Corporation is an American publicly traded company that distributes pharmaceuticals and provides health information technology, medical supplies, and health management tools. The company delivers a third of all pharmaceutical products used or consumed in North America and employs over 80,000 employees.[2][3] With $308.9 billion in 2024 revenue, it is the ninth-largest company by revenue in the United States and the nation's largest health care company. The company is headquartered in Irving, Texas. It is a component of the S&P 500 and is listed on the New York Stock Exchange, where it is traded under the ticker symbol \"MCK\".",
        "subsidiaries": [
            "Health Mart",
            "Uniprix"
        ]
    },
    {
        "name": "Medtronic",
        "description": "Medtronic plc is an American-Irish medical device company. The company's legal and executive headquarters are in Ireland, while its operational headquarters are in Minneapolis, Minnesota. Medtronic rebased to Ireland following its acquisition of Irish-based Covidien in 2015.[3][4] While it primarily operates in the United States,[5][6] it operates in more than 150 countries and employs over 90,000 people.[7] It develops and manufactures healthcare technologies and therapies. It is one of the biggest medical tech companies in the world and is currently the largest medical device company in the world by revenue.",
        "subsidiaries": []
    },
    {
        "name": "Merck & Co.",
        "description": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey. The company does business as Merck Sharp & Dohme or MSD outside the United States and Canada. The company is ranked fourth on the list of largest biomedical companies by revenue.",
        "subsidiaries": []
    },
    {
        "name": "Meta Platforms",
        "description": "Meta Platforms, Inc. (doing business as Meta) is an American multinational technology company headquartered in Menlo Park, California. Meta owns and operates several prominent social media platforms and communication services, including Facebook, Instagram, WhatsApp, Messenger, Threads and Manus. The company also operates an advertising network for its own sites and third parties; as of 2023[update], advertising accounted for 97.8 percent of its total revenue.[9] Meta has been described as a part of Big Tech, which refers to the largest six tech companies in the United States, Alphabet (Google), Amazon, Apple, Meta (Facebook), Microsoft, and Nvidia, which are also the largest companies in the world by market capitalization.[10][11][12]",
        "subsidiaries": []
    },
    {
        "name": "MetLife",
        "description": "MetLife, Inc. is the holding corporation for the Metropolitan Life Insurance Company (MLIC),[3] better known as MetLife, and its affiliates. MetLife is among the largest global providers of insurance, annuities, and employee benefit programs, with around 90 million customers in over 60 countries.[4][5] The firm was founded on March 24, 1868.[6] MetLife ranked No. 43 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.[7]",
        "subsidiaries": []
    },
    {
        "name": "Mettler Toledo",
        "description": "Mettler Toledo,[3] stylized in all caps, is a multinational supplier of precision instruments and services. The company focuses on laboratory, industrial, product inspection, and food retailing applications. Its products are used in research, quality control, and manufacturing processes in life sciences, food, chemical, and many other industries. The company's business is geographically diversified, with sales in 2023 derived 41% from North and South America, 27% from Europe, and 32% from Asia and other countries.[4] The company’s global workforce consists of 17,300 employees as of December 31, 2023.[5]",
        "subsidiaries": []
    },
    {
        "name": "MGM Resorts",
        "description": "MGM Resorts International is an American  multinational hospitality, sports and entertainment company. It operates resorts in Las Vegas, Massachusetts, Michigan, Mississippi, Maryland, Ohio, New Jersey, Macau, Shanghai, Chengdu, Hangzhou and Sanya, including the Bellagio, Mandalay Bay, MGM Grand and Park MGM.",
        "subsidiaries": []
    },
    {
        "name": "Microchip Technology",
        "description": "Microchip Technology Incorporated is an American publicly traded semiconductor corporation that manufactures microcontroller, mixed-signal, analog, and Flash-IP integrated circuits.",
        "subsidiaries": []
    },
    {
        "name": "Micron Technology",
        "description": "Micron Technology, Inc. is an American semiconductor company that manufactures computer memory and computer data storage products, including dynamic random-access memory (DRAM), flash memory, and solid-state drives (SSDs). Founded in 1978 in Boise, Idaho, Micron is the only major American computer memory manufacturer.[3] It is one of the “Big Three” computer memory manufacturers, together with the South Korean companies Samsung Electronics and SK Hynix.[4]",
        "subsidiaries": []
    },
    {
        "name": "Microsoft",
        "description": "Microsoft Corporation is an American multinational technology conglomerate headquartered in Redmond, Washington. Founded in 1975, the company became influential in the rise of personal computers through software like Windows, and has since expanded to Internet services, cloud computing, artificial intelligence, video gaming, and other fields. Often described as a Big Tech company, Microsoft is the largest software company by revenue, one of the most valuable public companies,[a] and one of the most valuable brands globally. It is a part of Big Tech along with five other tech companies in the United States, Alphabet (Google), Amazon, Apple, Meta (Facebook), and Nvidia, which are also the largest companies in the world by market capitalization.[2][3][4]",
        "subsidiaries": [
            "GitHub",
            "LinkedIn"
        ]
    },
    {
        "name": "Mid-America Apartment Communities",
        "description": "Mid-America Apartment Communities, Inc. (MAA) is a publicly traded real estate investment trust based in Memphis, Tennessee that invests in apartments in the Southeastern United States and the Southwestern United States.[1]",
        "subsidiaries": []
    },
    {
        "name": "Moderna",
        "description": "Moderna, Inc. (/məˈdɜːrnə/ mə-DUR-nə)[4] is an American pharmaceutical and biotechnology company based in Cambridge, Massachusetts, that focuses on RNA therapeutics, primarily mRNA vaccines. These vaccines use a copy of a molecule called messenger RNA (mRNA) to carry instructions for proteins to produce an immune response.[5][1] The company's name is derived from the  terms \"modified\", \"RNA\", and \"modern\".[6][7][8]",
        "subsidiaries": []
    },
    {
        "name": "Molina Healthcare",
        "description": "Molina Healthcare, Inc. is a managed care company headquartered in Long Beach, California, United States. The company provides health insurance to individuals through government programs such as Medicaid and Medicare.",
        "subsidiaries": []
    },
    {
        "name": "Molson Coors Beverage Company",
        "description": "Molson Coors Beverage Company is a Canadian-American multinational drink and brewing company headquartered in Chicago, Illinois and Montreal, Quebec.[4]",
        "subsidiaries": [
            "Molson Brewery",
            "Coors Brewing Company",
            "Miller Brewing Company",
            "The Beer Store(49%)"
        ]
    },
    {
        "name": "Mondelez International",
        "description": "Mondelēz International, Inc. (/ˌmɒndəˈliːz/ MON-də-LEEZ)[3] is an American multinational confectionery, food, holding, beverage and snack food company based in Chicago.[4] Mondelez has an annual revenue of about $26.5 billion and operates in approximately 160 countries.[5] It ranked No. 108 in the 2021 Fortune 500 list of the largest United States corporations by total revenue.[6]",
        "subsidiaries": [
            "Cadbury",
            "Clif Bar & Company",
            "Nabisco"
        ]
    },
    {
        "name": "Monolithic Power Systems",
        "description": "Monolithic Power Systems, Inc. is an American, publicly traded company headquartered in Kirkland, Washington. It operates in more than 15 locations worldwide.[2]",
        "subsidiaries": []
    },
    {
        "name": "Monster Beverage",
        "description": "Monster Beverage Corporation[2] is an American beverage company that manufactures energy drinks including Monster Energy, Relentless, Reign and Burn. The company was originally founded as Hansen's in 1935 in Southern California, originally selling juice products. The company renamed itself as Monster Beverage in 2012.",
        "subsidiaries": []
    },
    {
        "name": "Moody's Corporation",
        "description": "Moody's Corporation is an American business and financial services company. It is the holding company for Moody's Ratings (previously known as Moody's Investors Service), an American credit rating agency, and Moody's (previously known as Moody's Analytics), an American provider of financial analysis software and services.",
        "subsidiaries": [
            "Moody's",
            "Moody's Ratings"
        ]
    },
    {
        "name": "Morgan Stanley",
        "description": "Morgan Stanley[4] is an American multinational investment bank and financial services company headquartered at 1585 Broadway in Midtown Manhattan, New York City. With offices in 42 countries and more than 80,000 employees, the firm's clients include corporations, governments, institutions, and individuals.[2][4] Morgan Stanley ranked No. 61 in the 2023 Fortune 500 list of the largest United States corporations by total revenue[5] and in the same year ranked No. 30 in the Forbes Global 2000.[6]",
        "subsidiaries": [
            "Morgan Stanley Wealth Management",
            "E-Trade",
            "Eaton Vance",
            "Solium"
        ]
    },
    {
        "name": "Mosaic Company (The)",
        "description": "The Mosaic Company is an American chemical company based in Tampa, Florida, which mines phosphate, potash, and collects urea for fertilizer, through various international distribution networks,[2] and Mosaic Fertilizantes.[3] It is the largest U.S. producer of potash and phosphate fertilizer.[4]",
        "subsidiaries": []
    },
    {
        "name": "Motorola Solutions",
        "description": "Motorola Solutions, Inc., is an American technology company that provides safety and security products and services. Headquartered in Chicago, Illinois,[2] the company provides critical communications, video security, and command center technologies, used by public safety agencies and enterprises. It was formed in 2011 by the division of Motorola, Inc., and is its legal successor; the former company's mobile phone division was spun off as Motorola Mobility, now part of Chinese technology company Lenovo.",
        "subsidiaries": [
            "Airwave Solutions",
            "Avigilon",
            "Pelco"
        ]
    },
    {
        "name": "MSCI Inc.",
        "description": "MSCI Inc. (formerly Morgan Stanley Capital International) is an American finance company headquartered in New York City. MSCI is a global provider of equity, fixed income, real estate indices, multi-asset portfolio analysis tools, ESG and climate finance products. It operates the MSCI World, MSCI Emerging Markets, and MSCI All Country World (ACWI) indices, among others.",
        "subsidiaries": []
    },
    {
        "name": "Nasdaq, Inc.",
        "description": "Nasdaq, Inc. is an American multinational financial services corporation providing data, analytics, software, exchange capabilities, and advisory services to corporate clients, investment managers, banks, brokers, and exchange operators across the global financial system. Nasdaq was founded in 1971 as the world's first electronic stock market, and became publicly traded in 2000. It is headquartered in New York City, and its chair and chief executive officer is Adena Friedman.",
        "subsidiaries": [
            "International Securities Exchange",
            "Nasdaq",
            "Nasdaq Nordic",
            "Adenza",
            "Verafin"
        ]
    },
    {
        "name": "NetApp",
        "description": "NetApp, Inc. is an American data infrastructure company that provides unified data storage, integrated data services, and cloud operations (CloudOps) solutions to enterprise customers. The company is based in San Jose, California. It has ranked in the Fortune 500 from 2012 to 2021.[2] Founded in 1992[3] with an initial public offering in 1995,[4] NetApp offers cloud data services for management of applications and data both online and physically.",
        "subsidiaries": []
    },
    {
        "name": "Netflix",
        "description": "Netflix, Inc. is an American media company founded on August 29, 1997 by Reed Hastings and Marc Randolph in Scotts Valley, California, and currently based in Los Gatos, California, with production offices and stages at the Los Angeles-based Hollywood studios (formerly old Warner Brothers studios) and the Albuquerque Studios (formerly ABQ studios). It operates an eponymous over-the-top subscription video on-demand service, which showcases acquired and original programming as well as third-party content licensed from other production companies and distributors. Netflix is also the first streaming media company to be a member of the Motion Picture Association.",
        "subsidiaries": [
            "Hollywood Studios",
            "Albuquerque Studios",
            "London Shepperton Studios",
            "Madrid Tres Cantos Studios",
            "Vancouver Martini Studios",
            "Toronto Pinewood/Cinespace Studios",
            "Netflix Pictures",
            "Netflix Studios",
            "Netflix Animation Studios",
            "Netflix Music",
            "Fast.com",
            "Millarworld",
            "StoryBots, Inc.",
            "Grauman's Egyptian Theatre",
            "Broke and Bones (stake)",
            "Roald DahlStory Company",
            "Night School Studio",
            "Netflix Pty Ltd",
            "Eyeline",
            "Next Games",
            "Fort Monmouth Studios"
        ]
    },
    {
        "name": "Newmont",
        "description": "Newmont Corporation is an American gold mining company based in Denver, Colorado. \nIt is the world's largest gold mining corporation.[2] Incorporated in 1921, it holds ownership of gold mines in the United States, Canada, Mexico, the Dominican Republic, Australia, Ghana, Argentina, Peru, and Suriname.  Newmont is also a partial owner of Nevada Gold Mines in Nevada with Barrick Mining being the majority owner and operator.[3] In addition to gold, Newmont mines copper, silver, zinc and lead.[4]",
        "subsidiaries": [
            "Goldcorp",
            "Oroplata S.A.",
            "South Kalgoorlie Gold Mine"
        ]
    },
    {
        "name": "News Corp(Class A)",
        "description": "The second and current incarnation of News Corporation, doing business as News Corp,[3] is an American mass media and publishing company headquartered at 1211 Avenue of the Americas in Midtown Manhattan, New York City. The company was formed on June 28, 2013, as a spin-off of the first News Corporation, whose legal successor was 21st Century Fox, which held its media and entertainment assets. Operating across digital real estate information, news media, book publishing, and cable television, News Corp's notable assets include: Dow Jones & Company, which is the publisher of The Wall Street Journal; News UK, publisher of The Sun and The Times; News Corp Australia; REA Group, operator of realestate.com.au and realtor.com; and book publisher HarperCollins.",
        "subsidiaries": []
    },
    {
        "name": "News Corp(Class B)",
        "description": "The second and current incarnation of News Corporation, doing business as News Corp,[3] is an American mass media and publishing company headquartered at 1211 Avenue of the Americas in Midtown Manhattan, New York City. The company was formed on June 28, 2013, as a spin-off of the first News Corporation, whose legal successor was 21st Century Fox, which held its media and entertainment assets. Operating across digital real estate information, news media, book publishing, and cable television, News Corp's notable assets include: Dow Jones & Company, which is the publisher of The Wall Street Journal; News UK, publisher of The Sun and The Times; News Corp Australia; REA Group, operator of realestate.com.au and realtor.com; and book publisher HarperCollins.",
        "subsidiaries": []
    },
    {
        "name": "NextEra Energy",
        "description": "NextEra Energy, Inc. is an American energy company that is the world's largest electric utility holding company by market capitalization, with a valuation of over $170 billion as of Oct 2024.[5] NextEra Energy had revenues of $24.8 billion and 16,700 employees throughout the US and Canada in 2024.[6][7] It has a current generating capacity of 73 gigawatts.[8] Its subsidiaries include Florida Power & Light (FPL), NextEra Energy Resources (NEER), XPLR Energy Partners, and NextEra Energy Services.",
        "subsidiaries": [
            "Florida Power & Light",
            "NextEra Energy Resources"
        ]
    },
    {
        "name": "Nike, Inc.",
        "description": "Nike, Inc.[a] is an American athletic footwear and apparel corporation headquartered near Beaverton, Oregon.[6] It is the world's largest supplier of athletic shoes and apparel and a major manufacturer of sports equipment, with revenue in excess of US$46 billion in its fiscal year 2022.[7][8]",
        "subsidiaries": []
    },
    {
        "name": "NiSource",
        "description": "NiSource Inc. is one of the largest fully regulated utility companies in the United States, serving approximately 3.5 million natural gas customers and 500,000 electric customers across six states through its local Columbia Gas and NIPSCO brands. The company, based in Merrillville, Indiana, has more than 8,000 employees. As of 2018, NiSource is the sole Indiana-based utility company.",
        "subsidiaries": []
    },
    {
        "name": "Nordson Corporation",
        "description": "Nordson Corporation is an American multinational corporation that designs and manufactures dispensing equipment for consumer and industrial adhesives, sealants and coatings. The company also manufactures equipment used in the testing and inspection of electronic components, technology-based systems \nfor curing and surface treatment processes as well as medical devices and component technologies. The company is headquartered in Westlake, Ohio,[3] and has direct operations and sales-support offices in approximately 30 countries.",
        "subsidiaries": []
    },
    {
        "name": "Norfolk Southern",
        "description": "The Norfolk Southern Railway (reporting mark NS) is a Class I freight railroad operating in the Eastern United States. Headquartered in Atlanta, the company was formed in 1982 with the merger of the Norfolk and Western Railway and Southern Railway.[4] The company operates 19,420 route miles (31,250 km) in 22 eastern states and the District of Columbia,[5] and has rights in Canada over the Albany to Montreal route of the Canadian Pacific Kansas City.[6][7] Norfolk Southern Railway is the leading subsidiary of the Norfolk Southern Corporation.",
        "subsidiaries": []
    },
    {
        "name": "Northern Trust",
        "description": "Northern Trust Corporation is an American financial services company headquartered in Chicago, Illinois, that caters to corporations, institutional investors, and ultra high net worth individuals. Northern Trust is one of the largest banking institutions in the United States and one of the oldest banks in continuous operation. As of December 31, 2025, it had $1.8 trillion in assets under management and $14.9 trillion in assets under custody. Northern Trust Corporation is incorporated in Delaware.[3]",
        "subsidiaries": []
    },
    {
        "name": "Northrop Grumman",
        "description": "Northrop Grumman Corporation, headquartered in West Falls Church, Virginia, is an American aerospace and defense company that designs and manufactures systems for aeronautics, defense, missions, and space. The company is the 5th largest contractor of the U.S. federal government; it receives over 2% of total spending by the federal government of the United States on contractors.[2][3][4]",
        "subsidiaries": []
    },
    {
        "name": "Norwegian Cruise Line Holdings",
        "description": "Norwegian Cruise Line Holdings (NCLH) is a holding company that is based in the United States and domiciled in Bermuda.[3][4] It operates three cruise lines as wholly owned subsidiaries: Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises. With its subsidiaries combined, it is the third-largest cruise operator in the world. It is a publicly traded company listed on the New York Stock Exchange.",
        "subsidiaries": [
            "Norwegian Cruise Line",
            "Oceania Cruises",
            "Regent Seven Seas Cruises"
        ]
    },
    {
        "name": "NRG Energy",
        "description": "NRG Energy, Inc. is an American energy company, headquartered in Houston, Texas.[2][3] It was formerly the wholesale arm of Northern States Power Company (NSP), which became Xcel Energy, but became independent in 2000. NRG Energy is involved in energy generation and retail electricity.[4] Their portfolio includes natural gas generation, coal generation, oil generation, nuclear generation, wind generation, utility-scale generation, and distributed solar generation.[5][6] NRG serves over 7 million retail customers in 24 US states including Texas, Connecticut, Delaware, Illinois, Maryland, Massachusetts, New Jersey, New York, Pennsylvania, Ohio; the District of Columbia, and eight provinces in Canada.[7][8]",
        "subsidiaries": [
            "Reliant Energy",
            "Direct Energy",
            "Stream Energy",
            "Green Mountain Energy"
        ]
    },
    {
        "name": "Nucor",
        "description": "Nucor Corporation is an American company based in Charlotte, North Carolina, that produces steel and related products. It is the largest steel producer in the United States and the largest recycler of scrap in North America.[1]  Nucor is the 16th-largest steel producer in the world.[2] Along with Commercial Metals Company, it is one of two primary suppliers of rebar used to reinforce concrete in buildings, bridges, roads, and infrastructure in the U.S.",
        "subsidiaries": []
    },
    {
        "name": "Nvidia",
        "description": "Nvidia Corporation[a] (/ɛnˈvɪdiə/ en-VID-ee-ə) is an American technology company headquartered in Santa Clara, California. Founded in 1993 by Jensen Huang, Chris Malachowsky, and Curtis Priem, it develops graphics processing units (GPUs), systems on chips (SoCs), and application programming interfaces (APIs) for data science, high-performance computing, video games, and mobile and automotive applications.[5][6] Nvidia has been described as a Big Tech company.",
        "subsidiaries": [
            "Bright Computing",
            "Cumulus Networks",
            "DeepMap",
            "Mellanox Technologies",
            "Mental Images"
        ]
    },
    {
        "name": "NVR, Inc.",
        "description": "NVR, Inc. is an American company engaged in home construction headquartered in Reston, Virginia. It also operates a mortgage banking and title services business. The company primarily operates on the East Coast of the United States, but its operations encompass 14 states as well as Washington, D.C. In 2021, 22% of the company's revenue was from the Washington metropolitan area.[1]",
        "subsidiaries": []
    },
    {
        "name": "NXP Semiconductors",
        "description": "NXP Semiconductors N.V. is a Dutch semiconductor manufacturing and design company with headquarters in Eindhoven, Netherlands.[2] It is the third largest European semiconductor company by market capitalization as of 2024.[3] The company employs approximately 34,000 people in more than 30 countries and it reported revenues of $12.61 billion in 2024.[4] The company's origins date back to the 1950s as part of Philips and it became one of the world's largest semiconductor companies by the end of the 20th century. Philips spun off the company in 2006 and it has since operated independently.",
        "subsidiaries": []
    },
    {
        "name": "O’Reilly Automotive",
        "description": "O'Reilly Automotive, Inc., doing business as O'Reilly Auto Parts, is an American automotive part retailer that provides automotive parts, tools, supplies, equipment, and accessories to professional service providers and do-it-yourself customers. Founded in 1957 by the O’Reilly family, O'Reilly Auto Parts operates more than 6,400 stores in 48 states, Puerto Rico, Mexico, and Canada.[2]",
        "subsidiaries": []
    },
    {
        "name": "Occidental Petroleum",
        "description": "Occidental Petroleum Corporation (often abbreviated Oxy in reference to its ticker symbol and logo) is an American company engaged in hydrocarbon exploration in the United States and the Middle East as well as petrochemical manufacturing in the United States, Canada, and Chile. It is incorporated under the Delaware General Corporation Law and headquartered in Houston. The company ranked 183rd on the 2021 Fortune 500 based on its 2020 revenues[3] and 670th on the 2021 Forbes Global 2000.[4]",
        "subsidiaries": []
    },
    {
        "name": "Old Dominion",
        "description": "Old Dominion Freight Line, Inc. (ODFL) is an American regional, inter-regional and national less than truckload shipping (LTL) company. In addition to its core LTL services, the company offers expedited, logistics and household moving services.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Omnicom Group",
        "description": "Omnicom Group Inc. is an American global media, marketing, and corporate communications holding company, headquartered in New York City.",
        "subsidiaries": [
            "BBDO Worldwide",
            "Wolff Olins",
            "DDB Worldwide",
            "DAS Group of Companies",
            "Omnicom Media Group",
            "TBWA Worldwide"
        ]
    },
    {
        "name": "ON Semiconductor",
        "description": "ON Semiconductor Corporation (stylized and doing business as onsemi) is an American semiconductor supplier company, based in Scottsdale, Arizona. Products include power and signal management, logic, discrete, and custom devices for automotive, communications, computing, consumer, industrial, LED lighting, medical, military/aerospace and power applications. onsemi runs a network of manufacturing facilities, sales offices and design centers in North America, Europe, and the Asia Pacific regions. Based on its 2016 revenues of $3.907 billion,[2] onsemi ranked among the worldwide top 20 semiconductor sales leaders,[3] and was ranked No. 483 on the 2022 Fortune 500 based on its 2021 sales.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Oneok",
        "description": "Oneok, Inc. (/ˈwʌnˌoʊk/) ONE-oak, stylized as ONEOK, is an American oil and gas midstream operator headquartered in Tulsa, Oklahoma. It provides the oil and gas industry with gathering, processing, fractionation, transportation, and storage services. The company is part of the Fortune 500 and S&P 500.[2] Oneok was founded as Oklahoma Natural Gas Company in 1906, but it changed its corporate name to Oneok in 1980.",
        "subsidiaries": [
            "Magellan Midstream Partners"
        ]
    },
    {
        "name": "Oracle Corporation",
        "description": "Oracle Corporation is an American multinational technology company headquartered in Austin, Texas.[5] Co-founded in Santa Clara, California by Bob Miner, Ed Oates, and current CEO Larry Ellison in 1977,[6][7] Oracle is among the 20 largest companies in the world[8] by market cap, and ranked 66th[9] on the Forbes Global 2000 as of 2025.",
        "subsidiaries": []
    },
    {
        "name": "Otis Worldwide",
        "description": "Otis Worldwide Corporation (branded as the Otis Elevator Company, its former legal name) styled as OTIS   is an American company that develops, manufactures and markets \nelevators, escalators, moving walkways, and related equipment.",
        "subsidiaries": []
    },
    {
        "name": "Paccar",
        "description": "Paccar Inc. (stylized as PACCAR) is an American company that manufactures heavy-duty trucks. It operates subsidiaries including Kenworth, Peterbilt, and DAF Trucks. Headquartered in Bellevue, Washington, PACCAR also provides financial services and industrial parts. Its stock is listed on the Nasdaq and is part of the S&P 500 index.",
        "subsidiaries": [
            "TransportationKenworthPeterbiltDAF TrucksTatra(19%)[1][2]Leyland TrucksFinancial servicesPaccar Financial Corp.PacLeaseEquipmentWinchBradenCarcoGermaticAftermarket partsPaccar PartsPaccar Parts EuropePaccar Parts South AmericaInternational salesPaccar Global SalesInformation technologyPaccar ITDTruck componentsDynacraftResearch and developmentPaccar Technical CenterDAF Central LabEngine manufacturingPaccar Engine CompanyInternationalPaccar AustraliaKenworth AustraliaDAF Trucks AustraliaPaccar New ZealandSouthpac TrucksALL RIG PartsPaccar MexicanaKenworth MexicanaPeterbilt MexicanaPaccar CanadaKenworth CanadaPeterbilt CanadaPaccar IndiaPaccar ChinaPaccar BrazilDAF Trucks Brazil",
            "Kenworth",
            "Peterbilt",
            "DAF TrucksTatra(19%)[1][2]",
            "Tatra(19%)[1][2]",
            "Leyland Trucks",
            "Paccar Financial Corp.",
            "PacLease",
            "WinchBradenCarcoGermatic",
            "Braden",
            "Carco",
            "Germatic",
            "Paccar PartsPaccar Parts EuropePaccar Parts South America",
            "Paccar Parts Europe",
            "Paccar Parts South America",
            "Paccar Global Sales",
            "Paccar ITD",
            "Dynacraft",
            "Paccar Technical Center",
            "DAF Central Lab",
            "Paccar Engine Company",
            "Paccar AustraliaKenworth AustraliaDAF Trucks Australia",
            "Kenworth Australia",
            "DAF Trucks Australia",
            "Paccar New ZealandSouthpac TrucksALL RIG Parts",
            "Southpac Trucks",
            "ALL RIG Parts",
            "Paccar MexicanaKenworth MexicanaPeterbilt Mexicana",
            "Kenworth Mexicana",
            "Peterbilt Mexicana",
            "Paccar CanadaKenworth CanadaPeterbilt Canada",
            "Kenworth Canada",
            "Peterbilt Canada",
            "Paccar India",
            "Paccar China",
            "Paccar BrazilDAF Trucks Brazil",
            "DAF Trucks Brazil"
        ]
    },
    {
        "name": "Packaging Corporation of America",
        "description": "Packaging Corporation of America is an American manufacturing company based in Lake Forest, Illinois.[2] The company has about 15,500 employees, with operations primarily in the United States. The CEO is Mark W. Kowlzan.[3]",
        "subsidiaries": []
    },
    {
        "name": "Palantir Technologies",
        "description": "Palantir Technologies Inc. is an American publicly traded company that develops data integration and analytics platforms enabling government agencies, militaries, and corporations to combine and analyze data from multiple sources. Its flagship products—Gotham (for intelligence and defense) and Foundry (for commercial and civil use)—connect previously siloed databases to support intelligence operations, counterterrorism analysis, law enforcement, and enterprise analytics.[3] Headquartered in Miami, Florida, it was founded in 2003 by Peter Thiel,[4] Stephen Cohen,[5] Joe Lonsdale,[6] Alex Karp,[7] and Nathan Gettings.[8][9]",
        "subsidiaries": []
    },
    {
        "name": "Palo Alto Networks",
        "description": "Palo Alto Networks, Inc. is an American multinational cybersecurity company with headquarters in Santa Clara, California. The core product is a platform that includes advanced firewalls and cloud-based offerings that extend those firewalls to cover other aspects of security. The company serves over 70,000 organizations in over 150 countries, including 85 of the Fortune 100.[6] It is home to the Unit 42 threat research team[7] and hosts the Ignite cybersecurity conference.[8] It is a partner organization of the World Economic Forum.[9]",
        "subsidiaries": []
    },
    {
        "name": "Paramount Skydance Corporation",
        "description": "Paramount Skydance Corporation (doing business as Paramount)[discuss] is an American multinational mass media and entertainment conglomerate. The company is headquartered at the Paramount Pictures lot in the Hollywood neighborhood of Los Angeles, California,[1] with multiple of Paramount's divisions and subsidiaries, as well as one of Paramount's major offices and meeting places, being headquartered at the previous Paramount Global headquarters at One Astor Plaza in New York City. CBS is also headquartered in New York City, but at the CBS Building and the CBS Broadcast Center both in Midtown Manhattan. Paramount Skydance also houses major offices at the previous Skydance Media headquarters in Santa Monica, California.",
        "subsidiaries": []
    },
    {
        "name": "Parker Hannifin",
        "description": "Parker-Hannifin Corporation, originally Parker Appliance Company, usually referred to as just Parker, is an American corporation specializing in motion and control technologies. Its corporate headquarters are in Mayfield Heights, Ohio, in Greater Cleveland (with a Cleveland mailing address).[3][4]",
        "subsidiaries": []
    },
    {
        "name": "Paychex",
        "description": "Paychex, Inc. is an American company that provides human resources, payroll, and employee benefits outsourcing services for small- to medium-sized businesses.[1] Founded in 1971 and headquartered in Rochester, New York,[2] the company has more than 100 offices serving approximately 800,000 payroll clients in the U.S. and Europe.[1] Paychex is ranked 681st on the Fortune 500 list of largest corporations by revenue.[3]",
        "subsidiaries": []
    },
    {
        "name": "Paycom",
        "description": "Paycom Software, Inc., known simply as Paycom, is an online payroll and human resource software provider based in Oklahoma City, Oklahoma with offices throughout the United States.[3][4] It is attributed with being one of the first fully online payroll providers.[5] Founded in 1998, it reported annual revenue of $2.052 billion for 2025, up from $1.883 billion for 2024.[6][7]",
        "subsidiaries": []
    },
    {
        "name": "PayPal",
        "description": "PayPal Holdings, Inc. is an American multinational financial technology company operating an online payments system in the majority of countries that support online money transfers; it serves as an electronic alternative to traditional paper methods such as checks and money orders. The company operates as a payment processor for online vendors, auction sites and many other commercial and company users.",
        "subsidiaries": [
            "Braintree",
            "PayPal Honey",
            "Paydiant",
            "PayPal Credit",
            "Venmo",
            "Xoom",
            "Zettle"
        ]
    },
    {
        "name": "Pentair",
        "description": "Pentair plc (PNR) is an American water treatment company incorporated in Ireland with tax residency in UK, with its main U.S. office in Golden Valley, Minnesota.[5] Pentair was founded in the US, with 65% of company's revenue coming from the US and Canada as of 2017. PNR was reorganized in 2014, shifting the corporate domicile from Switzerland to Ireland.[6]",
        "subsidiaries": []
    },
    {
        "name": "PepsiCo",
        "description": "PepsiCo, Inc. is an American multinational food and beverage corporation headquartered in Harrison, New York, in the hamlet of Purchase. PepsiCo's business encompasses all aspects of the food and beverage market. It oversees the manufacturing, distribution, and marketing of its products. PepsiCo was formed in 1965 with the merger of the Pepsi-Cola Company and Frito-Lay, Inc., PepsiCo has since expanded from its namesake product Pepsi to an immensely diversified range of food and beverage brands. Significant acquisitions include Tropicana Products in 1998, the Quaker Oats Company in 2001, which added the Gatorade brand to the Pepsi portfolio, and Pioneer Foods in 2020 for US$1.7 billion.[2]",
        "subsidiaries": []
    },
    {
        "name": "Pfizer",
        "description": "Pfizer Inc. (/ˈfaɪzər/ FY-zər)[2] is an American multinational pharmaceutical and biotechnology corporation headquartered at The Spiral in Manhattan, New York City. Founded in 1849 in New York by German entrepreneurs Charles Pfizer (1824–1906) and Charles F. Erhart (1821–1891), Pfizer is one of the oldest pharmaceutical companies in North America.",
        "subsidiaries": []
    },
    {
        "name": "PG&E Corporation",
        "description": "Pacific Gas and Electric Company (PG&E) is an American investor-owned utility (IOU).[2] The company is headquartered at Kaiser Center, in Oakland, California. PG&E provides natural gas and electricity to 5.2 million households in the northern two-thirds of California, from Bakersfield and northern Santa Barbara County, almost to the Oregon and Nevada state lines.[3]: 27 [4]",
        "subsidiaries": []
    },
    {
        "name": "Philip Morris International",
        "description": "Philip Morris International Inc. (PMI) is a tobacco company, with products sold in over 180 countries. Marlboro is PMI’s most recognized brand, but in the last quarter of 2023, Iqos generated the greatest revenue.[2] Philip Morris International is often referred to as one of the companies comprising Big Tobacco. The company ranked No. 121 in the 2025 Fortune 500 list of the largest US corporations by total revenue.[3]",
        "subsidiaries": [
            "Papastratos",
            "PMFTC, Inc.",
            "Rothmans, Benson & Hedges",
            "Sampoerna",
            "Swedish Match"
        ]
    },
    {
        "name": "Phillips 66",
        "description": "The Phillips 66 Company is an American multinational energy company headquartered in Westchase, Houston, Texas. Its name, dating back to 1927 as a trademark of the Phillips Petroleum Company, assisted in establishing the newly reconfigured Phillips 66. The company today was formed ten years after Phillips merged with Conoco to form ConocoPhillips. The merged company spun off its refining, chemical, and retail assets – known in the oil industry as downstream operations – into a new company bearing the Phillips 66 name. It began trading on the New York Stock Exchange on May 1, 2012, under the ticker PSX.",
        "subsidiaries": []
    },
    {
        "name": "Pinnacle West Capital",
        "description": "Pinnacle West Capital Corporation is an American utility holding company that owns Arizona Public Service (APS). It is publicly traded on the New York Stock exchange and a component of the S&P 500 stock market index. APS is the largest utility company in Arizona and is regulated by the Arizona Corporation Commission (ACC).",
        "subsidiaries": []
    },
    {
        "name": "PNC Financial Services",
        "description": "The PNC Financial Services Group, Inc. is an American bank holding company and financial services corporation based in Pittsburgh, Pennsylvania. Its banking  subsidiary, PNC Bank, operates in 27 states and the District of Columbia, with 2,629 branches and 9,523 ATMs. PNC Bank is one of the largest banks in the US by assets and by number of branches, deposits, and ATMs.",
        "subsidiaries": []
    },
    {
        "name": "Pool Corporation",
        "description": "Pool Corporation, doing business as POOLCORP, is the largest distributor of supplies, equipment, and machinery for swimming pools worldwide. The company is organized in Delaware and headquartered in Covington, Louisiana. It serves approximately 125,000 customers and operates 439 sales centers in North America, Europe and Australia. The company receives over half of its revenue from the California, Texas, Florida, and Arizona markets and has benefited from population shifts to warmer climates. In 2023, the company received 62% of its revenue from maintenance and minor repair products, 24% of its revenue from products used in pool renovations, and 14% of its revenue from products used in pool construction.[1]",
        "subsidiaries": []
    },
    {
        "name": "PPG Industries",
        "description": "PPG Industries, Inc. is an American supplier of paints, coatings, and specialty materials based in Pittsburgh, Pennsylvania. It operates in more than 70 countries globally. A member of the Fortune 500, PPG is the second largest coatings company in the world by revenue, behind Sherwin-Williams.[2] It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson.",
        "subsidiaries": []
    },
    {
        "name": "PPL Corporation",
        "description": "PPL Corporation is an energy company headquartered in Allentown, Pennsylvania in the Lehigh Valley region of eastern Pennsylvania. The company is publicly traded on the New York Stock Exchange as NYSE: PPL and is part of the S&P 500. As of 2022, the company had $7.9 billion in revenue, 6,500 employees, over $37 billion in assets, and serves 3.6 million customers.[1]",
        "subsidiaries": []
    },
    {
        "name": "Principal Financial Group",
        "description": "Principal Financial Group, Inc. (PFG) is an American global financial investment management and insurance company headquartered in Des Moines, Iowa, United States.",
        "subsidiaries": []
    },
    {
        "name": "Procter & Gamble",
        "description": "The Procter & Gamble Company (P&G) is an American multinational consumer goods corporation incorporated and headquartered in Cincinnati, Ohio.[1]",
        "subsidiaries": [
            "Procter & Gamble Korea",
            "Procter & Gamble Pakistan",
            "Procter & Gamble Philippines",
            "Procter & Gamble Australia Pty. Ltd.",
            "Braun"
        ]
    },
    {
        "name": "Progressive Corporation",
        "description": "The Progressive Corporation is an American insurance company. Progressive is currently the #2 auto insurer in the United States behind State Farm.[2] The company was co-founded in 1937 by Jack Green and Joseph M. Lewis, and is headquartered in Mayfield, Ohio.[3] The company insures passenger vehicles, motorcycles, recreational vehicles (RVs), trailers, boats, personal water craft (PWC), and commercial vehicles. Progressive also provides home, life, pet, and other types of insurance through select companies.",
        "subsidiaries": []
    },
    {
        "name": "Prologis",
        "description": "Prologis, Inc. is a real estate investment trust headquartered in San Francisco, California that invests in logistics facilities.[6] The company was formed through the merger of AMB Property Corporation and Prologis in June 2011, which made Prologis the largest industrial real estate company in the world.[7][8] As of 2025, the company operates more than 15,000 land acres and over 6,000 buildings[9] comprising about 1.3 billion square feet in 20 countries[10][11] across North America, Latin America, Europe, and Asia.[12] According to The Economist, its business strategy is focused on warehouses that are located close to huge urban areas where land is scarce.[13] It serves about 6,600 tenants.[14] Prologis began to expand its non-real estate business, Essentials, in 2018, offering customers solar power, racking systems, forklifts, generators,[15] EV charging infrastructure,[16] and other logistics tech equipment for purchase.",
        "subsidiaries": []
    },
    {
        "name": "Prudential Financial",
        "description": "Prudential Financial, Inc. is an American financial services company whose subsidiaries provide insurance, retirement planning, investment management, and other products and services to both retail and institutional customers throughout the United States and in over 40 other countries. In 2019, Prudential was the largest insurance provider in the United States with $815.1 billion in total assets. The company is included in the  Fortune Global 500 and Fortune 500 rankings.",
        "subsidiaries": []
    },
    {
        "name": "Public Service Enterprise Group",
        "description": "The Public Service Enterprise Group, Inc. (PSEG) is a publicly traded energy company based in Newark, New Jersey, where it has been based since its founding.[4] It was founded in 1985, with its roots tracing back to 1903.",
        "subsidiaries": [
            "PSE&G, PSEG Power",
            "PSEG Long Island"
        ]
    },
    {
        "name": "PTC Inc.",
        "description": "PTC Inc. (formerly Parametric Technology Corporation) is an American computer software and services company founded in 1985 and headquartered in Boston, Massachusetts. The company was a pioneer in parametric, associative feature-based, solid computer-aided design (CAD) modeling software in 1988, including an Internet-based product for Product Lifecycle Management (PLM) in 1998. PTC (NASDAQ: PTC) markets products and services and an Internet of Things (IoT) and augmented reality (AR) platform for partners and developers.",
        "subsidiaries": []
    },
    {
        "name": "Public Storage",
        "description": "Public Storage, headquartered in Glendale, California, is a real estate investment trust that invests in self storage. It is the largest brand of self-storage services in the US and owns approximately 9% of the self storage square footage in the U.S.[1] As of December 31, 2024, the company operated 3,073 self-storage facilities containing an aggregate of 221 million net rentable square feet of space.[1] The company also provides insurance services for tenants and manages 307 self storage facilities for other owners.[1]",
        "subsidiaries": []
    },
    {
        "name": "PulteGroup",
        "description": "PulteGroup, Inc. is an American residential home-construction company based in Atlanta, Georgia, United States. As of 2023, the company is the third-largest home-construction company in the United States based on the number of homes closed.[4][5] In total, the company has built over 775,000 homes.[2]",
        "subsidiaries": []
    },
    {
        "name": "Quanta Services",
        "description": "Quanta Services is a U.S. corporation that provides infrastructure services for the electric power, pipeline, industrial and communications industries. Its capabilities include planning, design, installation, program management, maintenance and repair of most types of network infrastructure. The company has grown organically since its founding, but it has also acquired over 150 companies in the electrical contracting industry. It has provided its services and expertise to many major electrical transmission construction  projects,",
        "subsidiaries": []
    },
    {
        "name": "Qualcomm",
        "description": "Qualcomm Incorporated (/ˈkwɒlkɒm/)[2] is an American multinational corporation headquartered in San Diego, California, and incorporated in Delaware.[3] It creates semiconductors, software and services related to wireless technology. It owns patents critical to the 5G, 4G,[4] CDMA2000, TD-SCDMA and WCDMA mobile communications standards.",
        "subsidiaries": [
            "Airgo Networks",
            "CSR plc",
            "Ikanos Communications",
            "Nuvia",
            "Qualcomm Atheros",
            "SiRF",
            "Arduino"
        ]
    },
    {
        "name": "Quest Diagnostics",
        "description": "Quest Diagnostics Incorporated is an American clinical laboratory. A Fortune 500 company, Quest operates in the United States, Puerto Rico, Mexico, and Brazil.[3] Quest also maintains collaborative agreements with various hospitals and clinics across the globe.[4]",
        "subsidiaries": []
    },
    {
        "name": "Qnity Electronics",
        "description": "",
        "subsidiaries": []
    },
    {
        "name": "Ralph Lauren Corporation",
        "description": "Ralph Lauren Corporation is a publicly traded American fashion and lifestyle brand founded in 1967 by Ralph Lauren in New York City. The company markets products in apparel, home, accessories, and fragrances, and is most known for its flagship brand, Polo Ralph Lauren. The company's brands include mid-range, sub-premium, and premium labels up to its highest priced luxury Ralph Lauren Purple Label apparel.",
        "subsidiaries": [
            "Polo Jeans Company, LLC",
            "Ralph Lauren Home Collections, Inc.",
            "Ralph Lauren Media, LLC",
            "Ralph Lauren Watch and Jewelry Company SÀRL (50%)",
            "RL Fragrances, LLC"
        ]
    },
    {
        "name": "Raymond James Financial",
        "description": "Raymond James Financial, Inc. is an American multinational independent investment bank and financial services company providing financial services to individuals, corporations, and municipalities through its subsidiary companies that engage primarily in investment and financial planning, in addition to investment banking and asset management. The company is headquartered in St. Petersburg, Florida.",
        "subsidiaries": []
    },
    {
        "name": "RTX Corporation",
        "description": "RTX Corporation, formerly Raytheon Technologies Corporation,[3][4] is an American multinational aerospace and defense conglomerate headquartered in Arlington, Virginia. It is one of the largest aerospace and defense manufacturers in the world by revenue and market capitalization, as well as one of the largest providers of intelligence services.[note 1] In 2023, the company's seat in the Forbes Global 2000 was 79. RTX manufactures aircraft engines, avionics, aerostructures, cybersecurity solutions, guided missiles, air defense systems, satellites, and drones. The company is a large military contractor, getting much of its revenue from the U.S. government.",
        "subsidiaries": [
            "Collins Aerospace",
            "Pratt & Whitney",
            "Raytheon"
        ]
    },
    {
        "name": "Realty Income",
        "description": "Realty Income Corporation is a real estate investment trust that invests in free-standing, single-tenant commercial properties in the United States, the United Kingdom, and six other countries in Europe. These properties are subject to NNN Leases. The company is organized in Maryland with its headquarters in San Diego, California.",
        "subsidiaries": []
    },
    {
        "name": "Regency Centers",
        "description": "Regency Centers Corporation is a real estate investment trust based in Jacksonville, Florida, and is one of the largest operators of shopping centers with grocery stores as anchor tenants. As of October 21, 2020, the company owned 415 properties comprising 56-million-square feet of space. Notable properties owned by the company include Serramonte Center and a 30% interest in Village District.[1]",
        "subsidiaries": []
    },
    {
        "name": "Regeneron Pharmaceuticals",
        "description": "Regeneron Pharmaceuticals, Inc. is an American biotechnology company headquartered in Westchester County, New York. The company was founded in 1988.[2]  Originally focused on neurotrophic factors and their regenerative capabilities, giving rise to its present name; the company has since expanded operations into the study of both cytokine and tyrosine kinase receptors, which gave rise to their first product, which is a VEGF-trap.",
        "subsidiaries": []
    },
    {
        "name": "Regions Financial Corporation",
        "description": "Regions Financial Corporation is an American bank holding company headquartered in the Regions Center in Birmingham, Alabama.[3] The company provides retail and commercial banking, trust, stock brokerage, and mortgage services. Its banking subsidiary, Regions Bank, operates about 2,000 automated teller machines and 1,300 branches in 15 states in the Southern and Midwestern United States.[4]",
        "subsidiaries": [
            "Sabal Capital Partners",
            "Ascentium Capital",
            "Highland Associates",
            "FMLS",
            "BlackArch Partners",
            "Clearsight Advisors",
            "Regions Equipment Finance Corporation (REFCO)"
        ]
    },
    {
        "name": "Republic Services",
        "description": "Republic Services, Inc. is a North American waste disposal company whose services include non-hazardous solid waste collection, waste transfer, waste disposal, recycling, and energy services. It is the second largest provider of waste disposal in the United States (as measured by revenue) after Waste Management. Its operations primarily consist of providing collection, transfer, and disposal of non-hazardous solid waste, recovering and recycling of certain materials, and energy services.[2] The company is 35.1% owned by Bill Gates's Cascade Investment.[3]",
        "subsidiaries": []
    },
    {
        "name": "ResMed",
        "description": "ResMed Inc. is a medical equipment company based in San Diego, California, and founded in Australia. It primarily provides cloud-connectable medical devices for the treatment of sleep apnea (such as CPAP devices and masks), chronic obstructive pulmonary disease (COPD), and other respiratory conditions. Resmed produced hundreds of thousands of ventilators and bilevel devices to help treat the respiratory symptoms of patients with COVID-19. Resmed also provides software to out-of-hospital care agencies to streamline transitions of care into and between these care settings for seniors and their care providers (i.e. home health, hospice, skilled nursing facilities, life plan communities, senior living centers, and private duty).",
        "subsidiaries": []
    },
    {
        "name": "Revvity",
        "description": "Revvity, Inc. is an American company in the life sciences and diagnostics business that is focused on selling to the pharmaceutical and biotechnology industries,[2] especially in relation to approaches making use of new cell therapy or gene therapy developments.[3] Its origins lie with the long-existing company PerkinElmer, which has been in a variety of business lines.[4]",
        "subsidiaries": [
            "BioLegend",
            "EUROIMMUN",
            "Tulip Diagnostics",
            "ViaCord"
        ]
    },
    {
        "name": "Robinhood Markets",
        "description": "Robinhood Markets, Inc. is an American financial services company based in Menlo Park, California. It provides an electronic trading platform that facilitates trades of stocks, exchange-traded funds, options, index options, futures contracts, event contracts on prediction markets, and cryptocurrency. It also offers cryptocurrency wallets, wealth management, credit cards and other banking services, some in partnership with banks insured by the FDIC, as well as a news website, Sherwood.News.[2] The company's revenue comes from payment for order flow and commissions on options (25% of Q4 2025 revenues), cryptocurrency (17% of Q4 2025 revenues), equities (7% of Q4 2025 revenues), and other products such as futures and event contracts (11% of Q4 2025 revenues); net interest income  from margin lending, interest earned on corporate and customer cash balances, securities lending, and credit cards (32% of Q4 2025 revenues); subscription fees on its Robinhood Gold product (4% of Q4 2025 revenues); and other sources, primarily advertising revenue from Sherwood.News (4% of Q4 2025 revenues).[3][2] The company has 27.0 million funded customers with 28.4 million investment accounts and $324 billion in assets under custody.[3] Its platform is available in the U.S., the UK, and, for trading cryptocurrency and tokenized stocks and ETFs only, in the European Union.[2] Over 200 million option contracts and 3 billion event contracts are traded monthly on the Robinhood platform.[3]",
        "subsidiaries": []
    },
    {
        "name": "Rockwell Automation",
        "description": "Rockwell Automation, Inc. is an American provider of industrial automation and digital transformation technologies headquartered in Milwaukee, Wisconsin. Its brands include Allen-Bradley, FactoryTalk software and LifecycleIQ Services. Rockwell Automation employs approximately 27,000 people and has customers in more than 100 countries worldwide.[1]",
        "subsidiaries": []
    },
    {
        "name": "Rollins, Inc.",
        "description": "Rollins, Inc. is a North American pest control company serving residential and commercial clients. Operating globally through its wholly owned subsidiaries, Orkin, Inc., PCO Services (now Orkin Canada),[2] HomeTeam Pest Defense, Western Pest Services, Industrial Fumigant Company, TruTech, Critter Control, Crane, Waltham, OPC Services, PermaTreat, Northwest Exterminating, McCall Service and Clark Pest Control,[3] as well UK subsidiaries Integrated Pest Management Limited, Safeguard Pest Control, NBC Environment, Europest Environmental Services, Guardian Pest Control, Ames, Kestrel and Beaver Pest Control, with Australian subsidiaries Allpest, Scientific Pest Control, Murray Pest Control and Statewide Pest Control, and Singapore subsidiary Aardwolf Pestkare, the company provides pest control services and protection against termite damage, rodents and insects to over 2.8 million customers in the US, Canada, United Kingdom, Mexico, Central America, the Caribbean, the Middle East and Asia from over 800 locations.",
        "subsidiaries": [
            "Orkin",
            "Western Pest Services"
        ]
    },
    {
        "name": "Roper Technologies",
        "description": "The company operates three divisions: Application Software (55% of 2024 revenues), which includes Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, and Vertafore; Network Software (21% of 2024 revenues), which includes ConstructConnect, DAT Solutions, The Foundry Visionmongers, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, and SoftWriters; and Technology Enabled Products (24% of 2024 revenues), which includes CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, and Verathon.[1]",
        "subsidiaries": []
    },
    {
        "name": "Ross Stores",
        "description": "Ross Stores, Inc., operating under the brand name Ross Dress for Less, is an American chain of discount department stores headquartered in Dublin, California.[6] It is the largest off-price retailer in the U.S.; as of July 2024, Ross operates 1,795 stores in 43 U.S. states, Washington, D.C. Puerto Rico and Guam,[7] covering much of the country, but with no presence in New England and Alaska.[8] The company also operates DD's Discounts, a discount department store chain with over 353 locations across the United States, most of which are located in Sun Belt states.[9][why?]",
        "subsidiaries": []
    },
    {
        "name": "Royal Caribbean Group",
        "description": "Royal Caribbean Group, formerly known as Royal Caribbean Cruises Ltd., is a cruise holding company headquartered in Miami, Florida, United States and incorporated in Liberia. It is the world's second-largest cruise line operator, after Carnival Corporation & plc. As of September 2025, Royal Caribbean Group fully owns three cruise lines: Royal Caribbean International, Celebrity Cruises, and Silversea Cruises.[3] It also holds a 50% stake in TUI Cruises, which operates Mein Schiff and Hapag-Lloyd Cruises, with the Group's global fleet consisting of 69 ships.[4][5]",
        "subsidiaries": [
            "Royal Caribbean International",
            "Celebrity Cruises",
            "Silversea Cruises",
            "TUI Cruises(50%)",
            "Hapag-Lloyd cruises(50%)",
            "Holistica (50%)\nGrand Bahama Shipyard (40%)"
        ]
    },
    {
        "name": "S&P Global",
        "description": "S&P Global Inc. (prior to 2016, McGraw Hill Financial, Inc., and prior to 2013, The McGraw–Hill Companies, Inc.) is an American publicly traded corporation headquartered in Manhattan, New York. Its primary areas of business are financial information, analytics, and energy and commodities intelligence. It is the parent company of S&P Global Ratings, S&P Global Energy, S&P Global Market Intelligence, S&P Global Mobility, and the Indian credit rating agency CRISIL. It is also the majority owner of the S&P Dow Jones Indices joint venture. \"S&P\" is a shortening of \"Standard and Poor's\".",
        "subsidiaries": [
            "S&P Global Ratings",
            "S&P Global Energy",
            "CRISIL",
            "S&P Dow Jones Indices",
            "S&P Global Market Intelligence",
            "S&P Global Mobility",
            "S&P Global Sustainable1",
            "Kensho Technologies"
        ]
    },
    {
        "name": "Salesforce",
        "description": "Salesforce, Inc., is an American cloud-based software company headquartered in San Francisco, California. It provides applications focused on sales, customer service, marketing automation, e-commerce, analytics, artificial intelligence, agentic AI, and application development.",
        "subsidiaries": [
            "Quip",
            "Heroku",
            "MuleSoft",
            "Tableau Software",
            "Acumen Solutions",
            "Slack Technologies",
            "Informatica"
        ]
    },
    {
        "name": "Sandisk",
        "description": "Sandisk Corporation (sometimes stylized as SanDisk, with the D capitalized in camelCase) is an American multinational computer technology company based in Milpitas, California, that designs and manufactures flash memory products, including memory cards, USB flash drives, and solid-state drives. It was founded in 1988 as SunDisk by Eli Harari, Sanjay Mehrotra, and Jack Yuan. The name is a portmanteau of the founder’s name Sanjay and disk.",
        "subsidiaries": []
    },
    {
        "name": "SBA Communications",
        "description": "SBA Communications Corporation is a real estate investment trust which owns and operates wireless infrastructure in the United States, Canada, Central America, South America, and South Africa.[1] It was founded in 1989 as Steven Bernstein and Associates by Steven Bernstein.",
        "subsidiaries": []
    },
    {
        "name": "Schlumberger",
        "description": "SLB,[2] formerly known as Schlumberger (French: [ʃlumbɛʁʒe, ʃlœ̃b-]),[3] is an American multinational oilfield services company.[4][5] Founded in France in 1926,[6][7] the company is now incorporated as SLB N.V. in Willemstad, Curaçao,[2] with principal executive offices in four cities: Paris, France; Houston, Texas, United States; London, UK; and The Hague, Netherlands.[8][9][10] As of 2022, it is both the world's largest offshore drilling company and the world's largest offshore drilling contractor by revenue.[11]",
        "subsidiaries": []
    },
    {
        "name": "Seagate Technology",
        "description": "Seagate Technology Holdings plc is an American data storage company. It was incorporated in 1978 as Shugart Technology and commenced business in 1979.[2] Since 2010, the company has been incorporated in Dublin, Ireland, with operational headquarters in Fremont, California, United States.",
        "subsidiaries": []
    },
    {
        "name": "Sempra",
        "description": "Sempra is a North American public utility holding company based in San Diego, California. The company is one of the largest utility holding companies in the United States with nearly 40 million consumers. Sempra's focus is on electric and natural gas infrastructure and its operating companies include: Southern California Gas Company (SoCalGas) and San Diego Gas & Electric (SDGE) in Southern California; Oncor Electric Delivery Company in Texas; and Sempra Infrastructure, with offices in California and Texas.",
        "subsidiaries": [
            "SDG&E",
            "SoCalGas",
            "Oncor",
            "Sempra Infrastructure"
        ]
    },
    {
        "name": "ServiceNow",
        "description": "ServiceNow, Inc. is an American software company that supplies a cloud computing platform for the creation and management of automated business workflows. The company was founded in Santa Clara, California, United States, in 2003 by Fred Luddy. It is listed on the New York Stock Exchange and is a constituent of the S&P 100 and S&P 500 indices.[2]",
        "subsidiaries": []
    },
    {
        "name": "Sherwin-Williams",
        "description": "Sherwin-Williams is an American paints and coatings company based in Cleveland, Ohio. It is primarily engaged in the manufacture, distribution, and sale of paints, coatings, floorcoverings, and related products with operations in over 120 countries.[2] As of 2024, it is the largest coatings company in the world by revenue.[3]",
        "subsidiaries": []
    },
    {
        "name": "Simon Property Group",
        "description": "Simon Media Properties, LLC, doing business as Simon Property Group, Inc., is an American real estate investment trust that invests in shopping malls, outlet centers, and community/lifestyle centers. It is the largest owner of shopping malls in the United States[4][5] and is headquartered in Indianapolis, Indiana. As of December 31, 2024, it owned  interests in 232 properties.[2]",
        "subsidiaries": [
            "Simon Malls",
            "Premium Outlets",
            "The Mills Corporation",
            "The Kravco Company",
            "Klépierre",
            "Taubman Realty Group",
            "JCPenney[1]",
            "Jamestown L.P."
        ]
    },
    {
        "name": "Skyworks Solutions",
        "description": "Skyworks Solutions, Inc. is an American semiconductor company headquartered in Irvine, California, United States. The company's shares are listed on the Nasdaq Global Select Market under the ticker symbol SWKS and is a constituent of the S&P 500.",
        "subsidiaries": []
    },
    {
        "name": "J.M. Smucker Company (The)",
        "description": "The J.M. Smucker Company, also known as Smucker's, is an American manufacturer of food and beverage products. Headquartered in Orrville, Ohio,[3] the company was founded in 1897 as a maker of apple butter.[4] J.M. Smucker currently has three major business units: consumer foods, pet foods, and coffee.[5] Its flagship brand, Smucker's, produces fruit preserves, peanut butter, syrups, frozen crustless sandwiches, and ice cream toppings.[6]",
        "subsidiaries": [
            "Big Heart Pet Brands",
            "Hostess Brands"
        ]
    },
    {
        "name": "Smurfit Westrock",
        "description": "Smurfit Westrock plc is an Irish company based in Dublin, Ireland that manufactures corrugated and paper-based packaging. Its stock is listed on the New York Stock Exchange and the London Stock Exchange.",
        "subsidiaries": []
    },
    {
        "name": "Snap-on",
        "description": "Snap-on Incorporated is an American designer, manufacturer, and marketer of high-end tools and equipment for professional use in the transportation industry, including the automotive, heavy duty, equipment, marine, aviation, and railroad industries. Headquartered in Kenosha, Wisconsin, since 1930, Snap-on also distributes lower-end tools under the brand name Blue-Point. Their primary competitors include Matco, Mac Tools, and Cornwell Tools.",
        "subsidiaries": []
    },
    {
        "name": "Solventum",
        "description": "On July 26, 2022, 3M announced that it would spin off its healthcare division as a separate company to streamline operations. The new company would assume 3M's business in wound and oral care, health informatics, and biopharmaceutical filtration.[2] The sales of products in these fields accounted for about a quarter of 3M's total sales in 2021.[3] CEO Mike Roman said that the split would \"position 3M for the future, to create more opportunity and greater certainty\".[4]",
        "subsidiaries": []
    },
    {
        "name": "Southern Company",
        "description": "Southern Company is an American gas and electric utility holding company based in the Southern United States. It is headquartered in Atlanta, Georgia, with executive offices located in Birmingham, Alabama. As of 2021 it is the second largest utility company in the U.S. in terms of customer base. Through its subsidiaries it serves 9 million gas and electric utility customers in 6 states. Southern Company's regulated regional electric utilities serve a 120,000-square-mile (310,000 km2) territory with 27,000 miles (43,000 km) of distribution lines.[4]",
        "subsidiaries": []
    },
    {
        "name": "Southwest Airlines",
        "description": "Southwest Airlines is a major airline in the United States.[4] It is headquartered in the Love Field neighborhood of Dallas, Texas. It is the fourth-largest airline in North America when measured by passengers carried, as of 2024. With its all-Boeing 737 fleet, Southwest serves over 100 destinations in 42 states, Washington, D.C., Puerto Rico, and ten other countries and territories near the southern United States in the Gulf of Mexico and Caribbean Sea regions: Aruba, the Bahamas, Belize, the Cayman Islands, Costa Rica, Cuba, the Dominican Republic, Mexico, Jamaica, and Turks and Caicos.",
        "subsidiaries": []
    },
    {
        "name": "Stanley Black & Decker",
        "description": "Stanley Black & Decker, Inc., formerly known as The Stanley Works, is an American manufacturer of industrial tools and household hardware, and a provider of security products. Headquartered in the Greater Hartford city of New Britain, Connecticut,[3] Stanley Black & Decker is the result of the merger of The Stanley Works and Black & Decker on March 12, 2010.[4]",
        "subsidiaries": []
    },
    {
        "name": "Starbucks",
        "description": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market initially as a coffee bean wholesaler. Starbucks was converted into a coffee shop serving espresso-based drinks under the ownership of Howard Schultz, who was chief executive officer from 1986 to 2000 and led the aggressive expansion of the franchise across the West Coast of the United States.",
        "subsidiaries": [
            "Starbucks Coffee Company",
            "Ethos Water",
            "Hear Music",
            "La Boulange Bakery",
            "Teavana",
            "Torrefazione Italia",
            "Tata Starbucks (India)"
        ]
    },
    {
        "name": "State Street Corporation",
        "description": "State Street Corporation is an American multinational[2] financial services and bank holding company headquartered at One Congress Street in Boston. It is the second-oldest continuously operating U.S. bank, tracing its roots to Union Bank, chartered in 1792. As of the third quarter of 2025, State Street is one of the world's largest asset managers and custodians, with approximately US$5.4 trillion in assets under management and US$51.7 trillion under custody and administration.[3]",
        "subsidiaries": [
            "State Street Bank and Trust Company"
        ]
    },
    {
        "name": "Steel Dynamics",
        "description": "Steel Dynamics, Inc. (SDI) is an American steel producer based in Fort Wayne, Indiana. With a production capacity of 13 million tons of steel, the company is the third largest producer of carbon steel products in the United States. It is among the most profitable American steel companies in terms of profit margins and operating margin per ton.[1] Based on its 2021 revenue, the company ranked 196th on the 2022 edition of the Fortune 500.[2]",
        "subsidiaries": []
    },
    {
        "name": "Steris",
        "description": "Steris plc is an American-Irish-based medical equipment company specializing in sterilization and surgical products for the US healthcare system.[3] Steris is operationally headquartered in Mentor, Ohio,[1] and has been legally registered in Dublin, Ireland, for tax purposes since 2018. Previously the company was registered in the United Kingdom from 2014 to 2018.",
        "subsidiaries": []
    },
    {
        "name": "Stryker Corporation",
        "description": "Stryker Corporation is an American multinational medical technologies corporation based in Kalamazoo, Michigan. The company's products are used for medical surgery and neurotechnology (60% of 2024 revenues), which include surgical equipment, patient and caregiver safety technologies, endoscopy systems, and patient handling, emergency medical equipment, and intensive care disposable products, as well as neurosurgical, neurovascular and oral and maxillofacial surgery implant products; and orthopedic surgery (40% of 2024 revenues), which includes implants used in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries.[1] Stryker's products are sold in over 75 countries and are used by 150 million patients annually.[1] In 2024, 75% of the company's revenues came from the United States.[1]",
        "subsidiaries": []
    },
    {
        "name": "Supermicro",
        "description": "Super Micro Computer, Inc., doing business as Supermicro, is an American information technology company based in San Jose, California. The company is one of the largest producers of high-performance and high-efficiency servers,[2] while also providing server management software, and storage systems for various markets, including enterprise data centers, cloud computing, artificial intelligence, 5G, and edge computing.[3][4][5][6][7][8] Supermicro was founded on November 1, 1993, and has manufacturing operations in Silicon Valley, the Netherlands, and in Taiwan at its Science and Technology Park.",
        "subsidiaries": []
    },
    {
        "name": "Synchrony Financial",
        "description": "Synchrony Financial is an American consumer financial services company with its headquarters in Stamford, Connecticut, United States.[2]  The company offers consumer financing products, including credit, promotional financing and loyalty programs, installment lending to industries and consumers through Synchrony Bank, its wholly owned online bank subsidiary.[4][5]",
        "subsidiaries": []
    },
    {
        "name": "Synopsys",
        "description": "Synopsys, Inc. is an American multinational electronic design automation (EDA) company headquartered in Sunnyvale, California, that focuses on design and verification of silicon chips, electronic system-level design and verification, and reusable components (intellectual property). Synopsys supplies tools and services to the semiconductor design and manufacturing industry. Products include tools for implementation of digital and analog circuits, simulators, and debugging environments that assist in the design of chips and computer systems. In 2024, Synopsys was listed as the 12th largest software company in the world.[2]",
        "subsidiaries": []
    },
    {
        "name": "Sysco",
        "description": "Sysco is an American multinational corporation that sells, markets, and distributes food products to restaurants, healthcare and educational facilities, sports stadiums, and other venues that serve food. It also sells foodservice supplies and equipment. The company is headquartered in the Energy Corridor district of Houston, Texas.[2]",
        "subsidiaries": []
    },
    {
        "name": "T-Mobile US",
        "description": "T-Mobile US, Inc. is an American wireless network operator headquartered in Bellevue, Washington. Its majority shareholder and namesake is the German telecommunications company Deutsche Telekom. T-Mobile is the second largest wireless carrier in the United States, with 140 million subscribers as of September 30, 2025.[5]",
        "subsidiaries": []
    },
    {
        "name": "T. Rowe Price",
        "description": "T. Rowe Price Group, Inc. is an American publicly owned global investment management firm that offers funds, subadvisory services, separate account management, and retirement plans and services for individuals, institutions, and financial intermediaries.[3] The firm has assets under management of more than $1.51 trillion and annual revenues of $6.48 billion as of 2023, placing it 537 on the Fortune 1000 list of the largest U.S. companies.[4] Headquartered at 100 East Pratt Street in Baltimore, Maryland, it has 7,868 employees[4] across 17 international offices serving clients in 55 countries.[5]",
        "subsidiaries": []
    },
    {
        "name": "Take-Two Interactive",
        "description": "Take-Two Interactive Software, Inc. is an American video game holding company based in New York City founded by Ryan Brant in September 1993.",
        "subsidiaries": [
            "2K",
            "Dynamixyz",
            "GameClub",
            "Ghost Story Games",
            "NBA Take-Two Media(50%)",
            "Rockstar Games",
            "Zynga"
        ]
    },
    {
        "name": "Tapestry, Inc.",
        "description": "Tapestry, Inc. is an American holding company based in New York City which is the parent company of  Coach New York and Kate Spade New York. Originally named Coach, Inc., the business changed its name to Tapestry on October 31, 2017.[4]",
        "subsidiaries": []
    },
    {
        "name": "Targa Resources",
        "description": "Targa Resources Corp. is a Fortune 500[1] company based in Houston, Texas. Targa, a midstream energy infrastructure corporation, is one of the largest infrastructure companies delivering natural gas and natural gas liquids in the United States. Their operations are based largely, though not entirely, on the Gulf Coast, particularly in Texas and Louisiana.[2] Matthew J. Meloy has been Chief Executive Officer since 2020.[3]",
        "subsidiaries": []
    },
    {
        "name": "Target Corporation",
        "description": "Target Corporation, doing business as Target, is an American retail corporation headquartered in Minneapolis, Minnesota, United States. Target operates retail stores. It is the eighth-largest retailer in the United States[4] and is a component of the S&P 500 Index.",
        "subsidiaries": []
    },
    {
        "name": "TE Connectivity",
        "description": "TE Connectivity plc[2] is an American-Irish domiciled technology company that designs and manufactures electrical and electronic components. It serves several industries, including automotive, aerospace, defense, medical, and energy.",
        "subsidiaries": []
    },
    {
        "name": "Teledyne Technologies",
        "description": "Teledyne Technologies Incorporated is an American industrial conglomerate. It was founded in 1960, as Teledyne, Inc. by Henry Singleton and George Kozmetsky.",
        "subsidiaries": [
            "Teledyne FLIR",
            "Teledyne LeCroy",
            "Teledyne e2v",
            "(list...)"
        ]
    },
    {
        "name": "Teradyne",
        "description": "Teradyne, Inc. is an American automatic test equipment (ATE) designer and manufacturer based in North Reading, Massachusetts. Its high-profile customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM.[2]",
        "subsidiaries": []
    },
    {
        "name": "Tesla, Inc.",
        "description": "Tesla, Inc. (/ˈtɛzlə/ TEZ-lə or /ˈtɛslə/ ⓘ TESS-lə[a]) is an American multinational automotive and clean energy company. Headquartered in Austin, Texas, it designs, manufactures, and sells battery electric vehicles (BEVs), stationary battery energy storage devices from home to grid-scale, solar panels and solar shingles, and related products and services.",
        "subsidiaries": [
            "Tesla Automation",
            "Tesla Energy"
        ]
    },
    {
        "name": "Texas Instruments",
        "description": "Texas Instruments Incorporated (TI) is an American multinational semiconductor company headquartered in Dallas, Texas.[5]  It is one of the top 10 semiconductor companies worldwide based on sales volume.[6] The company's focus is on developing analog chips and embedded processors, which account for more than 80% of its revenue.[7] TI also produces digital light processing (DLP) technology and education technology[7] products including calculators, microcontrollers, and multi-core processors.[8]",
        "subsidiaries": []
    },
    {
        "name": "Texas Pacific Land Corporation",
        "description": "The Texas Pacific Land Corporation is a publicly traded real estate operating company with its administrative office in Dallas, Texas. Owning over 880,000 acres (3,600 km2) in 20 West Texas counties, TPL is among the largest private landowners in the state of Texas. It was previously organized as a publicly traded trust taxed as a corporation, and operated under the name Texas Pacific Land Trust.",
        "subsidiaries": []
    },
    {
        "name": "Textron",
        "description": "Textron Inc. is an American industrial  conglomerate based in Providence, Rhode Island. Textron's subsidiaries include Bell Textron, Kautex, Textron Aviation (which itself includes the Beechcraft and Cessna brands), and Lycoming Engines. It was founded by Royal Little in 1923 as the Special Yarns Company. In 2020, Textron employed over 33,000 people in 25 countries.[2]\nThe company ranked 265th on the 2021 Fortune 500 of the largest United States corporations by revenue.[3]",
        "subsidiaries": [
            "AAI Corporation",
            "Able Aerospace Services",
            "Advanced Information Solutions",
            "Arctic Cat",
            "Avco",
            "Beechcraft",
            "Bell Textron",
            "Cessna Aircraft",
            "E-Z-GO",
            "Geospatial Solutions",
            "Jacobsen Manufacturing",
            "Kautex",
            "Lycoming Engines",
            "Pipistrel",
            "Textron AirLand",
            "Textron Marine & Land Systems",
            "Textron Weapon & Sensor Systems",
            "TRU Simulation & Training"
        ]
    },
    {
        "name": "Thermo Fisher Scientific",
        "description": "Thermo Fisher Scientific Inc. is an American life science and clinical research company. It is a global supplier of analytical instruments, clinical development solutions, specialty diagnostics, laboratory, pharmaceutical and biotechnology services. Based in Waltham, Massachusetts, Thermo Fisher was formed through the merger of Thermo Electron and Fisher Scientific in 2006. Thermo Fisher Scientific has acquired other reagent, consumable, instrumentation, and service providers, including Life Technologies Corporation (2013),[2] Alfa Aesar (2015),[3] Affymetrix (2016),[4] FEI Company (2016),[5] BD Advanced Bioprocessing (2018),[6] and PPD (2021).[7]",
        "subsidiaries": []
    },
    {
        "name": "TJX Companies",
        "description": "The TJX Companies, Inc. (abbreviated TJX) is an American multinational off-price department store corporation, headquartered in Framingham, Massachusetts.[4] It was formed as a subsidiary of Zayre Corp. in 1987, and became the legal successor to Zayre Corp. following a company reorganization in 1989.",
        "subsidiaries": []
    },
    {
        "name": "TKO Group Holdings",
        "description": "TKO Group Holdings, Inc. (TKO) is an American sports and sports entertainment company. Established on September 12, 2023, the public company was formed by a merger between Endeavor subsidiary Zuffa—the parent company of the Ultimate Fighting Championship (UFC), a mixed martial arts promotion—and the professional wrestling promotion World Wrestling Entertainment (WWE).",
        "subsidiaries": [
            "IMG",
            "On Location[a]",
            "PBR",
            "UFC",
            "WWE",
            "Zuffa Boxing(40%)[2]"
        ]
    },
    {
        "name": "Trade Desk (The)",
        "description": "The Trade Desk, Inc. (stylized as theTradeDesk) is an American multinational technology company that specializes in real-time programmatic marketing automation technologies, products, and services, designed to personalize digital content delivery to users.",
        "subsidiaries": []
    },
    {
        "name": "Tractor Supply",
        "description": "Tractor Supply Company (also known as TSCO or TSC), founded in 1938, is an American chain store that sells home improvement, agriculture, lawn and garden maintenance, livestock, equine and pet care equipment and supplies. It caters to farmers, ranchers, pet owners, and landowners. As of 2024, the company had 2,250 stores. It is based in Brentwood, Tennessee. It is publicly traded on the Nasdaq under the symbol TSCO and is a Fortune 500 company.",
        "subsidiaries": []
    },
    {
        "name": "Trane Technologies",
        "description": "Trane Technologies plc is an American-Irish domiciled company focused on heating, ventilation, and air conditioning (HVAC) and refrigeration systems. The company traces its corporate history back more than 150 years and was created after a series of mergers and spin-offs. In 2008, HVAC manufacturer Trane was acquired by Ingersoll Rand, a US industrial tools manufacturer. In 2020, the tools business was spun off as Ingersoll Rand and the remaining company was renamed Trane Technologies.",
        "subsidiaries": []
    },
    {
        "name": "TransDigm Group",
        "description": "TransDigm Group Incorporated is an American publicly traded aerospace manufacturing company headquartered in Cleveland, Ohio. TransDigm develops and manufactures engineered aerospace components. It was founded in 1993, when four industrial aerospace companies were combined by a private equity firm in a leveraged buyout. TransDigm expanded the range of aerospace components it manufactures through acquisitions over the years. It filed an  initial public offering on the New York Stock Exchange in 2006.",
        "subsidiaries": []
    },
    {
        "name": "Travelers Companies (The)",
        "description": "The Travelers Companies, Inc., commonly known as Travelers, is an American multinational insurance company. It is the second-largest writer of U.S. commercial property casualty insurance, and the sixth-largest writer of U.S. personal insurance through independent agents.[3][4][citation needed] Travelers is incorporated in Minnesota, with headquarters in New York City, and its largest office in Hartford, Connecticut.[2] It has been a component of the Dow Jones Industrial Average since June 8, 2009.[5]",
        "subsidiaries": []
    },
    {
        "name": "Trimble Inc.",
        "description": "Trimble Inc. is an American software, hardware, and services technology company. Trimble develops hardware for vehicle tracking systems including global navigation satellite system (GNSS) receivers, scanners, total stations, laser rangefinders, unmanned aerial vehicles (UAVs), inertial navigation systems, as well as software processing tools.",
        "subsidiaries": []
    },
    {
        "name": "Truist Financial",
        "description": "Truist Financial Corporation (/ˈtruːɪst/[6]) is an American bank holding company headquartered in Charlotte, North Carolina.[7] The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust.[1][8][9] Its bank operates 1,928 branches in 15 states and Washington, D.C., offering consumer, commercial, and investment banking, securities brokerage, asset management, mortgage, and insurance products and services.[3] It is on the list of largest banks in the United States by assets; as of May 2025, it is the tenth-largest bank, with $523 billion in assets.[10][11]",
        "subsidiaries": []
    },
    {
        "name": "Tyler Technologies",
        "description": "Tyler Technologies, Inc., based in Plano, Texas, is a provider of proprietary software to the United States public sector. Tyler Technologies has offices in 17 states and one in Toronto, Ontario, Canada.[2]",
        "subsidiaries": []
    },
    {
        "name": "Tyson Foods",
        "description": "Tyson Foods, Inc. is an American multinational corporation based in Springdale, Arkansas that operates in the food industry. The company is the world's second-largest processor and marketer of chicken, beef, and pork after JBS S.A. It is the largest meat company in America.[2] It annually exports the largest percentage of beef out of the United States. Together with its subsidiaries, it operates major food brands, including Tyson, Jimmy Dean, Hillshire Farm, Ball Park, Wright Brand, Aidells, and State Fair.[3]",
        "subsidiaries": []
    },
    {
        "name": "U.S. Bancorp",
        "description": "U.S. Bancorp (stylized as us bancorp) is an American multinational banking institution headquartered in Minneapolis, Minnesota and incorporated in Delaware. It is the 5th-largest bank in the United States as of 2025. As the largest bank in the Midwestern United States, it is considered systemically important by the Financial Stability Board. It is the parent company of its primary operating entity, U.S. Bank National Association, which does business as U.S. Bank (stylized as us bank). The company provides banking, investment, mortgage, trust, and payment services products to individuals, businesses, governmental entities, and other financial institutions.",
        "subsidiaries": [
            "Elavon",
            "Talech",
            "Syncada"
        ]
    },
    {
        "name": "Uber",
        "description": "Uber Technologies, Inc. is an American multinational transportation company that provides ride-hailing services, courier services, food delivery, and freight transport.[1] It is headquartered in San Francisco, California, and operates in approximately 70 countries and 15,000 cities worldwide.[1] It is the largest ridesharing company worldwide with over 180 million monthly active users and 6 million active drivers and couriers. It coordinates an average of 36 million trips and delivery orders per day, and has coordinated 64 billion trips and delivery orders since its inception in 2010.[2] In the second quarter of 2025, the company had a take rate (revenue as a percentage of gross bookings) of 30.6% for mobility services and 18.8% for food delivery.[2]",
        "subsidiaries": [
            "Careem(2020–2023)",
            "Cornershop",
            "Drizly(2021–2024)",
            "Postmates",
            "Uber Carshare(2022–2024)",
            "Uber Eats"
        ]
    },
    {
        "name": "UDR, Inc.",
        "description": "UDR Inc. (formerly United Dominion Realty) is a publicly traded real estate investment trust that invests in apartments. The company is organized in Maryland with its headquarters in Highlands Ranch, Colorado. As of December 31, 2024, the company owned interests in 169 apartment communities containing 55.696 apartment units in 21 markets in the United States.[1]",
        "subsidiaries": []
    },
    {
        "name": "Ulta Beauty",
        "description": "Ulta Beauty, Inc., formerly known as Ulta Salon, Cosmetics & Fragrance Inc. and before 2000 as Ulta3, is an American chain of cosmetic stores headquartered in Bolingbrook, Illinois.[2] Ulta Beauty carries both high- and low-end cosmetics, fragrances, nail products, bath and body products, beauty tools and haircare products. Each location has a beauty salon available to the public.",
        "subsidiaries": []
    },
    {
        "name": "Union Pacific Corporation",
        "description": "The Union Pacific Corporation is a publicly traded railroad holding company serving as the holding company for the Union Pacific Railroad.[1]",
        "subsidiaries": []
    },
    {
        "name": "United Airlines Holdings",
        "description": "United Airlines, Inc. is a major airline in the United States headquartered in Chicago, Illinois. It operates an extensive domestic and international route network across the United States and to destinations on six continents. Regional service is provided by independent carriers operating under the United Express brand, and the Star Alliance, of which United was one of the five founding airlines, extends its network throughout the world.",
        "subsidiaries": [
            "United Express",
            "Republic Airways Holdings(18.2%)"
        ]
    },
    {
        "name": "United Parcel Service",
        "description": "United Parcel Service, Inc. (UPS) is an American multinational shipping & receiving and supply chain management company founded in 1907.[1] Originally known as the American Messenger Company specializing in telegraphs, UPS has expanded to become a Fortune 500 company[6] and one of the world's largest shipping couriers. UPS today is primarily known for its ground shipping services as well as the UPS Store, a retail chain which assists UPS shipments and provides tools for small businesses. UPS offers air shipping on an overnight or two-day basis and delivers to post office boxes through UPS Mail Innovations and UPS SurePost.",
        "subsidiaries": [
            "UPS Airlines",
            "Nightline Group",
            "Marken",
            "UPS Logistics",
            "UPS Mail Innovations",
            "UPS Professional Solutions",
            "Roadie",
            "UPS i-parcel"
        ]
    },
    {
        "name": "United Rentals",
        "description": "United Rentals, Inc. is an American equipment rental company, with about 16 percent of the North American market share as of 2022.[4] It owns the largest rental fleet in the world with approximately 4,800[5] classes of equipment totaling about $20.59 billion[5] in original equipment cost (OEC) as of 2025.[5] The company has a combined total of 1,625 locations, including an integrated network of 1,504 rental locations in North America, 38 in Europe, 23 in Australia and 19 in New Zealand.[6] In North America, the company operates in 49 U.S. states and Puerto Rico and in every Canadian province.[7] In 2017, United Rentals' revenue totaled more than $6.64 billion, with over $1.35 billion in profit.[8]",
        "subsidiaries": []
    },
    {
        "name": "UnitedHealth Group",
        "description": "UnitedHealth Group Incorporated is an American multinational for-profit company specializing in health insurance and health care services based in Eden Prairie, Minnesota. Selling insurance products under UnitedHealthcare, and health care services under the Optum brand, it is the world's seventh-largest company by revenue and the largest health care company by revenue. The company is ranked seventh on the 2025 Fortune Global 500.[5]",
        "subsidiaries": [
            "Optum",
            "UnitedHealthcare"
        ]
    },
    {
        "name": "Universal Health Services",
        "description": "Universal Health Services, Inc. (UHS) is an American Fortune 500 company [1] that provides hospital and healthcare services, based in King of Prussia, Pennsylvania. In 2024, UHS reported total revenues of $15.8 billion.[2]",
        "subsidiaries": [
            "Alpha Hospital Group",
            "Ascend Health Corporation",
            "Cygnet Health Care",
            "Foundations Recovery Network",
            "Palo Verde Behavioral Health",
            "Psychiatric Institute of Washington",
            "Psychiatric Solutions, Inc."
        ]
    },
    {
        "name": "Valero Energy",
        "description": "Valero Energy Corporation is an American-based fuels producer mostly involved in manufacturing and marketing transportation fuels and other related products. It is headquartered in San Antonio, Texas, United States.[2] Throughout the United States, Canada, and the United Kingdom, the company owns and operates 15 refineries with a combined throughput capacity of approximately 3.2 million barrels per day, two renewable diesel plants that produce approximately 1.2 billion gallons per year, and 12 ethanol plants with a combined production capacity of 1.6 billion gallons as its subsidiaries.[3][4][5]",
        "subsidiaries": []
    },
    {
        "name": "Ventas",
        "description": "Ventas, Inc. is a real estate investment trust specializing in the ownership and management of research, medicine and healthcare facilities in the United States, Canada and the United Kingdom.",
        "subsidiaries": []
    },
    {
        "name": "Veralto",
        "description": "Veralto Corporation is an American technology company headquartered in Waltham, Massachusetts. It produces products related to water analytics, water treatment, marking and coding, and packaging and color.[1]",
        "subsidiaries": []
    },
    {
        "name": "Verisign",
        "description": "Verisign, Inc. is an American company based in Reston, Virginia, that operates a diverse array of network infrastructure, including two of the Internet's thirteen root nameservers, the authoritative registry for the .com, .net, and .name generic top-level domains and the .cc country-code top-level domains, and the back-end systems for the .jobs and .edu sponsored top-level domains.[3]",
        "subsidiaries": []
    },
    {
        "name": "Verisk Analytics",
        "description": "Verisk Analytics, Inc. is an American multinational data analytics and risk assessment firm based in Jersey City, New Jersey, with clients in insurance, government, and risk management sectors. The company uses proprietary data sets and industry expertise to provide predictive analytics and decision support consultations in areas including fraud prevention, actuarial science, insurance coverage, fire protection, catastrophe and weather risk, and data management.",
        "subsidiaries": [
            "AIR Worldwide",
            "Insurance Services Office",
            "Maplecroft",
            "Xactware"
        ]
    },
    {
        "name": "Verizon",
        "description": "Verizon Communications Inc. (/vəˈraɪzən/ ⓘ və-RY-zən), is an American telecommunications company headquartered in New York City.[3] It is the world's second-largest telecommunications company by revenue and its mobile network is the largest wireless carrier in the United States, with 146.1 million subscribers as of June 30, 2025.[10]",
        "subsidiaries": [
            "Verizon Fios",
            "Visible by Verizon",
            "TracFone Wireless",
            "Yahoo(10%)"
        ]
    },
    {
        "name": "Vertex Pharmaceuticals",
        "description": "Vertex Pharmaceuticals Incorporated is an American biopharmaceutical company based in Boston, Massachusetts. It was one of the first biotech firms to use an explicit strategy of rational drug design rather than combinatorial chemistry. It maintains headquarters in Boston, Massachusetts, and three research facilities, in San Diego, California, and Milton Park, Oxfordshire, England.",
        "subsidiaries": []
    },
    {
        "name": "Viatris",
        "description": "Viatris Inc. is an American global pharmaceutical and healthcare corporation headquartered in Canonsburg, Pennsylvania. The corporation was formed through the merger of Mylan and Upjohn, a legacy division of Pfizer, on November 16, 2020.[2]",
        "subsidiaries": [
            "Oyster Point Pharma",
            "Famy Life Sciences"
        ]
    },
    {
        "name": "Vici Properties",
        "description": "Vici Properties Inc. is an American real estate investment trust (REIT) specializing in casino and entertainment properties, based in New York City. It was formed in 2017 as a spin-off from Caesars Entertainment Corporation as part of its bankruptcy reorganization. It owns 54 casinos, hotels, and racetracks, four golf courses, and 38 bowling alleys around the United States and Canada.",
        "subsidiaries": []
    },
    {
        "name": "Visa Inc.",
        "description": "Visa Inc. (/ˈviːzə, ˈviːsə/) is an American multinational payment card services corporation headquartered in San Francisco, California.[2][5] It facilitates electronic funds transfers throughout the world, most commonly through Visa-branded credit cards, debit cards and prepaid cards.[6]",
        "subsidiaries": []
    },
    {
        "name": "Vistra Corp.",
        "description": "Vistra Corp. is an integrated retail electricity and power generation company based in Irving, Texas. The company is the largest competitive power generator in the U.S. with a capacity of approximately 39GW powered by a diverse portfolio, including natural gas, coal, nuclear, solar, and battery energy storage facilities.[2]",
        "subsidiaries": [
            "TXU Energy",
            "Luminant",
            "Dynegy",
            "Homefield Energy",
            "Ambit Energy",
            "Crius Energy",
            "Energy Harbor"
        ]
    },
    {
        "name": "Vulcan Materials Company",
        "description": "Vulcan Materials Company (NYSE: VMC) is an American company based in Birmingham, Alabama. It is principally engaged in the production, distribution and sale of construction materials. Vulcan is the largest producer of construction materials, primarily gravel, crushed stone, and sand, and employs approximately 12,000 people at over 400 facilities. Vulcan serves 22 states, the District of Columbia, Mexico, Canada, Bahamas and the U.S. Virgin Islands. Vulcan's Crescent Market project led to construction of a large quarry and deep water seaport on the Yucatán Peninsula of Mexico, just south of Cancún. This quarry supplies Tampa, New Orleans, Houston, and Brownsville, Texas, as well as other Gulf coast seaports, with crushed limestone via large 62,000-ton self-discharging ships.",
        "subsidiaries": []
    },
    {
        "name": "W. R. Berkley Corporation",
        "description": "W. R. Berkley Corporation is an American commercial lines property and casualty insurance holding company organized in Delaware and based in Greenwich, Connecticut.[2]",
        "subsidiaries": []
    },
    {
        "name": "W. W. Grainger",
        "description": "W. W. Grainger, Inc. is an American Fortune 500[5] industrial supply company founded in 1927 in Chicago by the company's namesake William W. (Bill) Grainger. He founded the company to provide consumers with access to a consistent supply of motors.[6]  The company now serves more than 4.5 million customers worldwide[4] with offerings such as motors, lighting, material handling, fasteners, plumbing, tools, and safety supplies, along with inventory management services and technical support.  Revenue is generally from business-to-business sales rather than retail sales. Grainger serves its customers through a network of approximately 331 branches, online channels (such as Grainger.com, KeepStock and eProcurement), and 34 distribution facilities.[7] Their motto is \"for the ones who get it done\".",
        "subsidiaries": []
    },
    {
        "name": "Wabtec",
        "description": "Westinghouse Air Brake Technologies Corporation, commonly known as Wabtec, is an American company formed by the merger of the Westinghouse Air Brake Company (WABCO) and MotivePower in 1999.[6][7]  It is headquartered in Pittsburgh, Pennsylvania.",
        "subsidiaries": []
    },
    {
        "name": "Walmart",
        "description": "Walmart Inc.[a] is an American multinational retail corporation that operates a chain of hypermarkets (also called supercenters), discount department stores, and grocery stores in the United States and 19 other countries.[7] It is headquartered in Bentonville, Arkansas.[8] The company was founded in 1962 by brothers Sam Walton and James \"Bud\" Walton in nearby Rogers, Arkansas.[9] It also owns and operates Sam's Club retail warehouses.[10][11]",
        "subsidiaries": []
    },
    {
        "name": "Walt Disney Company (The)",
        "description": "The Walt Disney Company, commonly known as simply Disney, is an American multinational mass media and entertainment conglomerate headquartered at the Walt Disney Studios complex in Burbank, California. Founded on October 16, 1923, as an animation studio by brothers Walt Disney and Roy Oliver Disney as Disney Brothers Cartoon Studio, Disney operated under the names Walt Disney Studio and Walt Disney Productions before adopting its current name in 1986. In 1928, Disney established itself as a leader in the animation industry with the short film Steamboat Willie. The film used synchronized sound to become the first post-produced sound cartoon, and popularized Mickey Mouse,[3] who became Disney's mascot and corporate icon.[4]",
        "subsidiaries": []
    },
    {
        "name": "Warner Bros. Discovery",
        "description": "Warner Bros. Discovery, Inc. (WBD) is an American multinational mass media and entertainment conglomerate headquartered in New York City. It was formed from WarnerMedia's spin-off by AT&T and merger with Discovery, Inc. on April 8, 2022.",
        "subsidiaries": []
    },
    {
        "name": "Waste Management",
        "description": "Waste Management, Inc., doing business as WM, is a waste management company operating in North America. Founded in 1968, the company is headquartered in the Bank of America Tower in Houston, Texas.",
        "subsidiaries": []
    },
    {
        "name": "Waters Corporation",
        "description": "Waters Corporation is an American company headquartered in Milford, Massachusetts that provides analytical instruments and software used for chromatography, mass spectrometry, laboratory informatics, and rheometry by the life sciences, materials, and food industries.[1]",
        "subsidiaries": []
    },
    {
        "name": "WEC Energy Group",
        "description": "WEC Energy Group is an American energy company based in Milwaukee, Wisconsin. It provides electricity and natural gas to 4.4 million customers across four states.[2]",
        "subsidiaries": []
    },
    {
        "name": "Wells Fargo",
        "description": "Wells Fargo & Company is an American multinational financial services company.[5][8] The company operates in 35 countries and serves more than 70 million customers worldwide.[5] It is a systemically important financial institution according to the Financial Stability Board, and is considered one of the \"Big Four Banks\" in the United States, alongside JPMorgan Chase, Bank of America, and Citigroup.[9]",
        "subsidiaries": [
            "Wells Fargo Advisors",
            "Wells Fargo Bank, N.A.",
            "Wells Fargo Rail",
            "Wells Fargo Securities",
            "Wachovia",
            "First Union",
            "CoreStates Financial"
        ]
    },
    {
        "name": "Welltower",
        "description": "Welltower Inc. is a real estate investment trust that invests in healthcare infrastructure. As of December 31, 2022, the company had investments in approximately 3,000 properties, all of which were in the United States, Canada, and the United Kingdom.[3]",
        "subsidiaries": []
    },
    {
        "name": "West Pharmaceutical Services",
        "description": "West Pharmaceutical Services, Inc. is a designer and manufacturer of injectable pharmaceutical packaging and delivery systems. Founded in 1923 by Herman O. West and J.R. Wike of Philadelphia, the company is headquartered in Exton, Pennsylvania. In its early years of development, West produced rubber components for packaging injectable drugs, providing a sterile environment for the producers of penicillin and insulin.",
        "subsidiaries": []
    },
    {
        "name": "Western Digital",
        "description": "Western Digital Corporation, doing business as WD, is an American data storage company headquartered in San Jose, California. Established in 1970, the company is one of the world's largest manufacturers of hard disk drives (HDDs).",
        "subsidiaries": []
    },
    {
        "name": "Weyerhaeuser",
        "description": "The Weyerhaeuser Company (/ˈwɛərhaʊzər/ WAIR-how-zər) is an American timberland company which owns approximately 10,400,000 acres (16,200 sq mi; 42,000 km2) of timberlands in the U.S., and manages an additional 14,000,000 acres (22,000 sq mi; 57,000 km2) of timberlands under long-term licenses in Canada.[4] The company has manufactured wood products for over a century.[5] It operates as a real estate investment trust (REIT).[4]",
        "subsidiaries": []
    },
    {
        "name": "Williams-Sonoma, Inc.",
        "description": "Williams-Sonoma, Inc., is an American publicly traded consumer retail company that sells kitchenware and home furnishings.[5] It is headquartered in San Francisco, California, United States.[6] The company has 625 brick and mortar stores and distributes to more than 60 countries, with brands including Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Mark and Graham, and Rejuvenation.[7][8] Williams-Sonoma, Inc., also operates through eight corresponding websites and a gift registry.[9]",
        "subsidiaries": []
    },
    {
        "name": "Williams Companies",
        "description": "The Williams Companies, Inc. is an American energy company based in Tulsa, Oklahoma. Its core business is natural gas processing and transportation, with additional petroleum and electricity generation assets. A Fortune 500 company,[2] its common stock is a component of the S&P 500.",
        "subsidiaries": []
    },
    {
        "name": "Willis Towers Watson",
        "description": "Willis Towers Watson plc (branded as WTW) is a British-American multinational advisory, broking and solutions company. Its operations span commercial insurance brokerage and risk advisory, employee benefits and rewards consulting, retirement and actuarial services, and investment advice for pension funds and institutional investors.[3]",
        "subsidiaries": []
    },
    {
        "name": "Workday, Inc.",
        "description": "Workday, Inc., is an American on‑demand (cloud-based) financial management, human capital management, and student information system software vendor. Workday was founded by David Duffield, founder and former CEO of ERP company PeopleSoft, along with former PeopleSoft chief strategist Aneel Bhusri, following Oracle's acquisition of PeopleSoft in 2005.[2]",
        "subsidiaries": []
    },
    {
        "name": "Wynn Resorts",
        "description": "Wynn Resorts, Limited is an American publicly traded corporation based in Paradise, Nevada, that is a developer and operator of high-end hotels and casinos. It was founded in 2002 by former Mirage Resorts Chairman and CEO Steve Wynn and is now run by CEO Craig Billings.[3] As of 2020[update], the company has developed six properties.[1]",
        "subsidiaries": []
    },
    {
        "name": "Xcel Energy",
        "description": "Xcel Energy Inc. is a U.S. regulated electric utility and natural gas delivery company based in Minneapolis, Minnesota, serving approximately 3.9 million electricity customers and 2.2 million natural gas customers across parts of eight states as of mid-2025.[3] It consists of four operating subsidiaries: Northern States Power-Minnesota, Northern States Power-Wisconsin, Public Service Company of Colorado, and Southwestern Public Service Co.[4]",
        "subsidiaries": [
            "Northern States Power Company (Minnesota)",
            "Northern States Power Company (Wisconsin)",
            "Public Service Company of Colorado",
            "Southwestern Public Service Company",
            "NRG Energy(1992–2003)"
        ]
    },
    {
        "name": "Xylem Inc.",
        "description": "Xylem Inc. is a large American water technology provider, in public utility, industrial, commercial, agricultural and residential settings. The company does business in more than 150 countries. Launched in 2011 as the spinoff of the water-related businesses of ITT Corporation, Xylem is headquartered in Washington, DC, with 2024 revenues of $8.6 billion and 23,000 employees worldwide.[2][3]",
        "subsidiaries": []
    },
    {
        "name": "Yum! Brands",
        "description": "Yum! Brands, Inc. (sometimes called just Yum!) is an American multinational fast food corporation. It was formed in 1977 as a subsidiary of PepsiCo, after the company acquired KFC, Pizza Hut, and Taco Bell. PepsiCo divested the brands in 1997, and these consolidated as Yum!. The company operates KFC, Pizza Hut, Taco Bell, Habit Burger & Grill, and several technology companies.",
        "subsidiaries": [
            "KFCPizza HutTaco BellHabit Burger & GrillHeartstylesTictuk TechnologiesKvantumDragontail Systems",
            "",
            "KFC",
            "Pizza Hut",
            "Taco Bell",
            "Habit Burger & Grill",
            "Heartstyles",
            "Tictuk Technologies",
            "Kvantum",
            "Dragontail Systems"
        ]
    },
    {
        "name": "Zebra Technologies",
        "description": "Zebra Technologies Corporation is an American multinational technology company, specializing in smart data capture systems.[2] The company manufactures and sells marking, tracking, and computer printing technologies. Its products include mobile computers and tablets, software, thermal barcode label and receipt printers, RFID smart label printers/encoders/fixed & handheld readers/antennas, autonomous mobile robots (AMRs) & machine vision (MV), and fixed industrial scanning hardware & software.",
        "subsidiaries": []
    },
    {
        "name": "Zimmer Biomet",
        "description": "Zimmer Biomet Holdings, Inc. is a publicly traded American medical device company. It was founded in 1927 to produce aluminum splints. The firm is headquartered in Warsaw, Indiana, where it is part of the medical devices business cluster.",
        "subsidiaries": []
    },
    {
        "name": "Zoetis",
        "description": "Zoetis Inc. (/zō-EH-tis/[4]) is an American drug company, the world's largest producer of medicine and vaccinations for pets and livestock.[5][4][6] The company was a subsidiary of Pfizer,[7] the world's largest drug maker, but with Pfizer's spinoff of its 83% interest in the firm it is now a completely independent company. The company directly markets its products in approximately 45 countries, and sells them in more than 100 countries.[8] Operations outside the United States accounted for 50% of the total revenue.[5] Contemporaneous with the spinoff in June 2013 S&P Dow Jones Indices announced that Zoetis would replace First Horizon National Corporation in the S&P 500 stock market index.[9]",
        "subsidiaries": []
    }
]